{
    "domain": "Healthcare",
    "url": "https://www.indeed.com/jobs?q=Healthcare&l=Philadelphia",
    "data": [
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cz4pj6uMAbGJ-Vr9u4VgIPBsUlQiPVQSCn8Aia2lhOHVolft8x0EcdrScqD6mbvtjGfaVfosi7_idVx1Kh6Gj-JD-J2pRve1pSVKo4XiX-fLVBULqFfmTAFdn4DHSzOJMXMq2MwbdFSDUF3UFcvDyno-uGoy1VcKmVswdvcxpP2g4pS-ZI3AEOo-VgOmycBfBX__UI8C6q14WRhwnQ-XQqaEs7rwhlAgO6FmztKlNdz5YX4iDgbu4W_NSh80d8DiW-R4s2cHwmVhcUSaIdkp5ucgh6R_kAvD1GkU8H-kj-WpXmgw2IMq2H-oZ9kyqUVyQtgV1aA4CsMwMTgstwx_K0ozxCP1xU2oKi8ZVBw4yjmvo4ayLsduHO_N4kfqCqVGPGYXVq1OCdklYLVcGOR_ld4S76nKj6pZLQ_t5b_56QHw-KPBkcKO7jV4MR6pPqanxWITU-YR9DnFdpzkaR-odpaBkree4iWanIZ9XFgelorYMie9BUbUXh-F3f9xJuDEyE3NxxW2L7EaIO6IBJssrGDr8i3nScuDOz43WIn3aHvBvV58Bmu7Jtubzrmd0178NpMn3K-MOZx1uB_X2WEeGHz5lMFEtJ6NE=&xkcb=SoCD-_M3HJ1abkTOpJ0LbzkdCdPP&p=0&fvj=1&vjs=3",
            "title": "Dental Hygienist",
            "company": "Warrington Dental P.C",
            "location": "1380 Easton Road, Warrington, PA 18976",
            "salary": "$40 - $45 an hour",
            "description": "INTERESTED IN FINDING THE PERFECT FIT FOR OUR GROWING TEAM. SOMEONE THAT IS EAGER TO COMMUNICATE WITH LOYAL PATIENTS FOR OVER 20 Y EARS AND CONTINUE THE SAME GREAT CARE THEY HAVE COME TO EXPECT. SOMEONE 2-3 DAYS A WEEK WITH HOURS TO BE DETERMINED UPON INTERVIEW. MUST BE REGISTERED WITH THE STATE OF PENNSYLVANIA AND OF COURSE X-RAY CERTIFIED. HOPING TO MAKE YOUR WORK ENVIROMENT FEEL LIKE A HOME! Job Type: Part-time Pay: $40.00 - $45.00 per hour Benefits: • Dental insurance Schedule: • 8 hour shift Ability to commute/relocate: • Warrington, PA 18976: Reliably commute or planning to relocate before starting work (Required) License/Certification: • Registered Dental Hygienist (Required) • Dental License (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AbGiuNSRsIZqoaRXHhOKyZ3_xwFkG03EO0MWoee3l2FA7TsWGA3RuvRZUJu5vQ63XLqI3kXSWXx5U_JMPshrbRKT3tUuoIitkioqF2pLSGUvYB68OQo70X9hb2_6QI4afJVD_FXZpwXDhcdg7hp3ivRQMl0fc9-qjx6PiWalOc2B7tG-4jWQ_cQdnQYZi-b31-hYW9I0CE3Tkuo6AVdMrKNHZbaQjDVx4yBuyK4AHF92ACCLO2o322ay9fBCU4cT-FSMLIKMWnYkbcgwb1_Gl4__kc23dufcA3OfcsyLctPHTonu4g2RvcNJy1punmaJD7AhaqIxsz8vlYWW1nC59aGkPUTRL9DaJr2dhr3IKHeYkq9Brm5BJbnwgGVcKQQ5dffccTDjoPFJghKFz8_ahHF-GufLDGYgFAGVTiYQzla51DRuNJGspxDyBJL5s8c6t0c6TnpWflhkHlW0i8mSPJ_7RxEvKnVxbAz3nxpCTx-7H_EXa3gJlDE0qgxzQE1c8Y3X4IvEC9sY6iKdi4dpgEGUSqJgrcBl6Q-Ago8iv_iKVx1mIIlbBQSAlVv8lQf-Kkg1YS8qR97GLfBtReU_ryK-FIJOP9ptI=&xkcb=SoA3-_M3HJ1abkTOpJ0KbzkdCdPP&p=1&fvj=1&vjs=3",
            "title": "Dental Assistant",
            "company": "Esposito Family Dental",
            "location": "220 Schooley Street, Moorestown, NJ 08057",
            "salary": "$18 - $25 an hour",
            "description": "Dental Assistant Wanted! We are seeking a full-time, highly motivated, and detail-oriented dental assistant to join our growing dental practice. The ideal candidate will have a passion for patient care, excellent communication skills, and a strong work ethic.Responsibilities:Chair-side assisting during dental procedures\nTaking and developing dental radiographs (x-rays)\nSterilizing and disinfecting instruments and equipment\nMaintaining a clean and organized work area\nCommunicating effectively with patients, dental staff, and office personnel\nPreparing patients for treatment and educating them on oral hygiene\nRequirements:Completed dental assisting training program and certification\n1-2 years of experience as a dental assistant preferred\nAbility to work well in a fast-paced environment\nProficiency in using dental software (Dentrix a Plus)\nExcellent verbal and written communication skills\nWe offer a competitive salary and benefits package, including paid time off and a 401(k) plan. If you're a driven and enthusiastic individual who is committed to providing exceptional patient care, we encourage you to apply! Job Type: Full-time Pay: $18.00 - $25.00 per hour Benefits: • 401(k) • Health insurance • Paid time off Schedule: • Monday to Friday • No weekends Ability to commute/relocate: • Moorestown, NJ 08057: Reliably commute or planning to relocate before starting work (Required) Experience: • Dental assisting: 2 years (Preferred) License/Certification: • X-Ray Certification (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=50b42542e45854f8&fccid=cce48ad42816872f&vjs=3",
            "title": "Scheduler",
            "company": "Jefferson - Center City, Philadelphia, PA",
            "location": "Philadelphia, PA 19106",
            "salary": "Not Available",
            "description": "• Screens patient calls and implements protocols for appropriateness of appointment. Confers with physician or allied health practitioner to determine if patient can be seen by physician. • Completes a full registration to secure a medical record number. Completes registration with complete accuracy to assure proper reimbursement to physician and Aria Health. • Takes messages and triages calls and directs to correct physician, allied health practitioner or department. • nstructs patients with correct information for appointment requirements such as labs, x-rays, location of appointment, insurance, referrals, directions and parking. • Manages a physician’s appointment scheduling, assuring maximum operational efficiencies. • Answers all calls for appointments, questions and other messages before the end of each business day for physicians and allied health practitioners. • Maintain and keep up all physician and AHP daily schedule changes. • Maintains confidentiality of information according to the policies and procedures of the Practice and Aria Health. • Performs other duties as assigned to assure patient satisfaction, quality patient care and efficient Practice operations. Education: High school diploma or GED.  Experience: At least two years of experience in a healthcare setting, preferably in a physician practice with a thorough knowledge of third party insurance, billing and reimbursement especially managed care. Proven knowledge of appointment scheduling and electronic registration. Two years experience in a physician practice is preferred. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AtZ2MRGD-6uF4T4WZnrf212O7IAtYyNGncHJfDVqe0BEBrYsdhD4sPKfzMpXBLmWVg6tHGEbwbhEG03AxF9eV-XWrJmfod9IaLpRk6tSQ9kN3-zSkmmPi_1Kdk4Q_JHlOIMGWn-Sj6zFSB6UZNq47KTYOUmEQCzJtFPVPoZWHtnmA9vfNcO-lxCqbvlqDic5Ai_oUN_tRUWSBpCV0Nc04RY0sJ3dIIur6SjeRbnF8bjdNoW7qP-nPQVhFleKWEb9snwuJcT5SqNU7p1vFWYojM53nDYvLkS5YTiWnx9qoqOmOrV1JP9su2MIIWE482SjPKIlyCGRv01fqskSZkJs_eEatZJ1XjJXJu4-wabFf9gAgQos2e3XNuMAiAePxLuSF7LbQLqW_Dpx66fRSf2k09OWjroJ7Vx2XWOcH2vXjJfkKRJ8rQ8dVVikn5hffjPVorG7bqO1Cpgi-F_bU1-pI2MKWHWRTtI5CoRIE8BhL_x9kgokNt6pXg2klOb0I5HgZqHhUbid_nnj8aZ2w3mxBg84MOLwiABp2-20h6hHO3DFUAN1A7zMjNdZ4DGDqGbXZ7Fh499fY8q6Awh_l_--7P&xkcb=SoAe-_M3HJ1abkTOpJ0IbzkdCdPP&p=3&fvj=1&vjs=3",
            "title": "Physician",
            "company": "The Clinical Trial Center",
            "location": "815 Greenwood Ave, Jenkintown, PA 19046",
            "salary": "$180,000 - $220,000 a year",
            "description": "The Clinical Trial Center, LLC is looking for a Principal Investigator who is Board Certified/Eligible MD or DO with some clinical trial research experience, to serve as Principal Investigator for pharmaceutical clinical research studies in our Jenkintown research clinic. The Clinical Trial Center, LLC conducts outpatient research studies in all phases of drug clinical development (Phases 1b-4). To find out more about our research clinic please go to: www.theclinicaltrialcenter.com Looking for Physicians Board certified in: Family Medicine Internal Medicine Neurology Responsibilities • Provide oversight and ensure proper delegation of duties to appropriate qualified staff. • Provide Sponsor and IRB with documentation of credentials as required. • Maintain all required licenses to practice and trainings required to execute the job as PI or Sub-I. • Assume responsibility as the Principal or Sub-Investigator for the duration of clinical trials. • Demonstrate the proper education, training and experience to conduct the clinical investigation. • Disclose conflicts of interest as described in the regulations. • Evaluate and screen potential subjects based on study eligibility criteria. • Perform and review assessments performed by raters in accordance with the clinical study protocol. • Complete all documentation, paper and electronic, as required per protocol. • Provide and maintain updated study related documentation as required by the clinical research trial to ensure data integrity. • Evaluate and report safety reports, protocol noncompliance and any other protocol specific reports. • Follow requirements for FDA form 1572. • Collaborate with operational and management team to ensure site goals are met. • Attend Investigator Meetings and educational seminars. • Travel to Investigator meetings as needed. Qualifications Must Have Active Pennsylvania License Board Certified MD or DO At least 4 years of Clinical Experience with adult to older adult population Preferred 6 months of Clinical Research experience working on pharmaceutical clinical trials. Job Type: Full-time Pay: $180,000.00 - $220,000.00 per year Benefits: • 401(k) • Dental insurance • Flexible schedule • Health insurance • Paid time off • Vision insurance Medical specialties: • Emergency Medicine • Geriatrics • Hospital Medicine • Internal Medicine • Neurology • Primary Care • Urgent Care Schedule: • 8 hour shift • No nights • No weekends Supplemental pay types: • Bonus opportunities Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Atj0oVbBavBKerL4eosPki5TrHwk9Fa7fT93p3fmJ4eaoMmMGGEVmlO2BigVe-wAJA7fYw6vwgqMGdlRXuhhDK-lLXg1V-usvsuu1uRtbA__Fp38_9jxSGIL-BOERmqyjTDVKD_eMYti3oUWlVMMkFMf0BbJFa6TFvIYP0DOgtg9zz-nvCfW6TmiAODkr5JuabJij9iAYNP0PXkORBI0mTn2fuoLqlOG2Ehsw3flAKUCPY_eYcpQSOy654ZejtpuaF38FYdddLz5UKR-tlsnhY9ykDKYR88p9bpwk0K_XCMyBNbxPlABg15hq_5Rf97c7uFU0M8BfzzsoxCh03qe46BBHK9DlnDposbPhUENLweXvbXnyxrHStAWcBO7o4n72mStT9VYs20-MTEmbARfvfjw7hvdhW_LytDL-Urno8MaNZzbrWw8u4U5JOF9buxWur34srDaLikH6qiEaHPPB9Cckmb14au3Ldg_hLSvnSVuhutznDHPYI6V7NdWB8P7fBX0_-EDFxVsAwJuQ7EcI7PYMvmsi3saL3Yg0zN970bAm5g4JbyD63cnnXXV1yZEgrnDnPqqjNbamTX9CK3HaFTEBD2HAQBEkxomdjmUqM9_HDnHGmhUj1&xkcb=SoCQ-_M3HJ1abkTOpJ0PbzkdCdPP&p=4&fvj=1&vjs=3",
            "title": "Bilingual Dental Assistant 1 year req",
            "company": "Super Tooth Pediatric Dentistry",
            "location": "2943 Swede Rd, Norristown, PA 19401",
            "salary": "$21 - $23 an hour",
            "description": "About us We are agile and our goal is to build a rockstar dental team in a brand new dental practice. Start your new year with a new job. Plenty of room for growth. Core competencies will be highest level of patient care. A motivated self starter with a \"say yes\" personality is the ideal candidate. Minimum one year dental assisting experience. CPR certification. Prior knowledge of Dentrix is a plus but not required. Must have excellent communication skills. Bilingual a plus. Impeccable organization for inventory control. Consistency in cleanliness, kindliness and mastery in simple restorative procedures. Only the best need apply. . Our work environment includes: • Modern office setting • Food provided • Lively atmosphere ```Duties```\n- Assist the dentist during dental procedures\n- Prepare treatment rooms, instruments, and materials for dental procedures\n- Take and develop dental x-rays\n- Sterilize and disinfect instruments and equipment\n- Provide patient education on oral hygiene and post-operative care\n- Maintain accurate patient records and documentation\n- Schedule appointments and manage patient flow ```Requirements``` - Must have one year experience as a dental assistant\n- Knowledge of medical terminology and dental procedures\n- Proficiency in Dentrix or similar dental software\n- Familiarity with HIPAA regulations and infection control protocols\n- Experience working with pediatric patients is a plus\n- Strong knowledge of dental anatomy and oral health assessment\n- Ability to assist with dental procedures such as fillings, extractions, and cleanings\n- Operating room care experience As a Dental Assist, you will play a vital role in assisting the dentist in providing quality dental care to our patients. Your responsibilities will include assisting during procedures, preparing treatment rooms, taking x-rays, sterilizing instruments, educating patients on oral hygiene, and maintaining accurate records. We are looking for someone with knowledge of medical terminology, proficiency in Dentrix or similar software, familiarity with HIPAA regulations and infection control protocols. Experience working with pediatric patients is a plus. Being Bilingual is a plus. If you have a strong understanding of dental anatomy, and the ability to assist with various procedures, we would love to hear from you. Join our team of dedicated professionals and make a difference in the lives of our patients. Apply today! Job Type: Full-time Pay: $21.00 - $23.00 per hour Expected hours: 32 per week Benefits: • Bereavement leave • Employee discount • Flexible schedule • Food provided • Free parking • Paid time off Medical specialties: • Pediatrics Schedule: • Monday to Friday Experience: • Dental assisting: 1 year (Required) License/Certification: • X-Ray Certification (Required) Ability to Commute: • Norristown, PA 19401 (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BuVxjzrRKxFIxkSd-eDXfW7bkGlF2tt1P3Nv2ojP2gzZQwwr8d8uXUQvKlQu2-zcbP2wu2sEVZ-AILk9bMbzIVLu2VuLKWH3EvyCw4_jglu4URGBA1AXVatBlBIUpznAm-0sclk3GO2sywxykLuRQxyO8_ZhjP_Z5XkRe1c1jT4BvGEj8Lv3-aqorGs2EYhDaNkZepl1qlnUTZDlPggJhoz9xyfSuKhoPjoEZPb8-YuY3elb7OSEAgJNY-uH4l7LpTRxd--KTpBCGA1zisfH4OVfGCFcOmhWOijMtTcNSTseZuZi22zCKRi7xl1Bm-lZgnhjOAY78kWFkh7KKthGT_GLryS6ApkN73Yzm2BbgmYpYulD1lTe_Twx_sDQxvZBZWAPtR0UNu2w8kadZ2Q94PW2hYURO4h8do0Dsn2nKIBg1ep7QEyq-IEHLwj6NnWRI1BIJk1qgLL0_n7HELQOc2py7OY8xgdjYuCVRQCv_E7ATqKxCbikFkiuF8GcZHkJAKQ5ntWC58E2-uCbLJ1yY7f-_RKutS3An0cD1ecYHbHbAk54Fx8rdjaMMLOP7HDWBqrj3pCoYVnRMRiE-Cq5PI3H8IfoXY601GN8vs-yiHsX477-c5AyWe&xkcb=SoAk-_M3HJ1abkTOpJ0ObzkdCdPP&p=5&fvj=1&vjs=3",
            "title": "Dental Office Receptionist and Scheduler",
            "company": "Philadelphia Dentistry",
            "location": "1601 Walnut Street, Philadelphia, PA 19102",
            "salary": "$20 an hour",
            "description": "Welcome to your new work family! Can you greet two people at the same time and answer a phone call all while smiling? Love chatting to perfect strangers ? Have dental experience but feel under-appreciated? Philadelphia Dentistry in Center City, Philadelphia is seeking an awesome receptionist / scheduler to work with us in our dental office! We are looking for an exceptional candidate seeking a better work environment, looking to be challenged and a long-term position with promotions and growth available. Recent renovations and expansion have caused a need for this position. Turn Ons: hard work, attention to detail, cleanliness, punctuality. Great communicators who are organized and love work for work's sake is what we are seeking. Best matches are people with personality who appreciate health and wellness and who love people, and who will bring something positive to our office each and every day. If this is you, we've been waiting for you to join us. A little more about us: We are a well-established, award-winning dental office known for our excellence in delivering the best dental care in the Philadelphia area. We are friendly and have a staff of 20 employees in a new, clean office environment in a high-rise medical building at 1601 Walnut Street. We are seeking to work with with an individual who wants to constantly improve, is up for a challenge and will enjoy the support that we have to offer. We have a positive work environment and work toward monthly goals. If you are not familiar with Dr. Ken Cirka, Dr. Mimi Jeon, Dr. Evan Ridge and Philadelphia Dentistry, we encourage you to review our website while applying at www.PhillyDentistry.com. Requirements: Health conscious, clean appearance, on-time and hardworking. A positive attitude is what you need-we will train. No dental office experience is necessary, but it is helpful. Compensation includes a solid pay including benefits such as 401K with matching, health benefits, dental care, time off, and paid vacation. Please no phone calls. We will review your resume and contact you if we are interested in working with you quickly upon receiving your application. Job Type: Full-time Salary: $20.00 /hour plus benefits. Job Type: Full-time Pay: $20.00 per hour Expected hours: 36 – 42 per week Benefits: • 401(k) matching • Dental insurance • Health insurance • Paid time off Healthcare setting: • Private practice Schedule: • Monday to Friday • No weekends Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=c59d5ce11428de9c&fccid=36b76cf613fccb72&vjs=3",
            "title": "Storekeeper",
            "company": "Penn Medicine",
            "location": "51 North 39th Street, Philadelphia, PA 19104",
            "salary": "Not Available",
            "description": "Description Summary: • Maintain storeroom(s) in a neat and orderly fashion while placing stock in appropriate locations. Responsible for the distribution of medical supplies throughout the Hospital. The accurate and timely restocking of assigned areas. Maintains an orderly work environment. Accurate and timely recording of inventory issues and communication of problems to management.  Responsibilities: • Restocks assigned areas with med/surg supplies in an accurate and timely manner.Accurately picks, distributes, and charges out inventory supplies using a PAR level, or exchange cart system in the Lawson.Answers phone and field messages in a timely manner.Develops and maintains accurate Inventory records to include dates and product usage.Fills and distributes requisitions and purchase receipts from departments according to established schedules, or after receiving telephone/beeper requests.Rotates stock items according to department policy in all stock locations; including storerooms, omnicells and supply carts.Re-stock code cartsPrint labels and update hand held scanners as required.Participates in product evaluation/ in service process.Maintains continuity of services in emergency situations (i.e. may be required to continue staffing in disaster codes and other emergencies).Notify appropriate management if unable to deliver supply or service.Establishes and maintains a professional rapport with all internal and external customers.May be required to work in the Periop storeroom, main storeroom, mailroom or receiving, based on daily workload requirements.IV Solution management to include insuring IV fluids are secure and locked in all areas of hospital including par locations, storeroom and receiving area.Ensures that all work areas are kept clean, clutter free and organized as per department procedure/policyProperly dispose of all cardboard and packing material.Responds to requests, for supplies in a timely manner.Notify appropriate management if unable to deliver supply or service.Participate in department meetings/action planningMaintain all hospital HIPPA requirementsParticipates in Entity and Department wide initiatives for Patient/Employee safetyDemonstrates an awareness of patient/ employee safety when carrying out daily responsibilities of their position.Must follow all infection control policies and procedures. (example: scrubs, masks where appropriate, PPE) and follow all hand washing guidelinesMust maintain a safe work area in compliance with all healthcare regulatory entities.  Credentials:  Education or Equivalent Experience:   We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AqD0btFauUPFz_26bomOd3eZCzyZTqgvFGJlMTZ3ud9s3mlkvyGhZKFhtfV_ZsROSAuBQsVXh5P5NHcysU86vnj9F2ZnbmuykdpSogdL4IrRm9Q6vOynIItvV2HmLXaisFGm3Qsvp9phlBltd-_py_c2wHU9t65niulNd49tYECdwcMQFHtoxJAAKqN1CRRY4mLZQdsP8nlHgKppo3EspH-vmiyuvY8_XYT0rZBoF5EPpbOpm6sb2L3UcOc9x9LSEu5xGv1tgacTew_EqospdraTIU5C4-BUCOtJpDxMvQ7FEQ-07BpAYCfHVa7gGkYqqDPWlGpIxjQfVAvUM05dJZ8V8Pn1DXojhvNF1kYzVYM0LayzOzaGFSMjCmNh57lEgM7lEULl5u_PFWi35FjCqxAakWNrJUnkWgNSETRjfNPv-hCwtjCy4rfdW88c1WR8rbpnvWICCY7y4yjEuWYVsjadkpP-YKrWev6EYgjbx0Tn6DzUGAJrm_JeygEYDBxSJcx9sCY12Co-ukSMdtltwHx1u95XDkoMFHCIfjlmvls0nBguMbfArSAySk1nHvLneH4n6isttIB_DpLGigQIOUcaD1dEY8Cw0XXt3rk7fDwgCurfdIyKt9G5UsV6fTd3zQDMxsbE-zX9LKEO7ndiQyVU2mqaVAIEnlNiiVNIutrQ==&xkcb=SoAN-_M3HJ1abkTOpJ0MbzkdCdPP&p=7&fvj=1&vjs=3",
            "title": "Physical Therapist Assistant (PTA) Position for Outpatient Clinic",
            "company": "Integrated Medical Care, LLC",
            "location": "Integrated Medical Care, LLC in Philadelphia, PA 19116",
            "salary": "Not Available",
            "description": "Looking for a Licensed Physical Therapist Assistant (PTA)to join our established outpatient practice in Philadelphia, PA. This privately owned facility provides rehab services for a diverse patient population. We believe that quality, patient-centered care is the foundation for any successful rehabilitative program. As such, our therapists excel in hands-on treatment where the patients and their needs come first. Requirements: Candidates must possess active Physical Therapy Assistant license for the state of Pennsylvania. Minimum of 2 years experience in an outpatient setting Competitive salary and benefits offered (commensurate with qualifications and experience) Russian-speaking is a plus Job Types: Part-time, Full-time Medical specialties: • Orthopedics • Physical & Rehabilitation Medicine Schedule: • 8 hour shift • Monday to Friday Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/company/Bryn-Mawr-Medical-Specialists-Association/jobs/Call-Center-Representative-a28ecb382f7e16e7?fccid=d47d4800bf4e4fa7&vjs=3",
            "title": "Call Center Representative",
            "company": "Bryn Mawr Medical Specialists Association",
            "location": "Bryn Mawr, PA",
            "salary": "$16 - $17 an hour",
            "description": "Our Cardiology practice provides exceptional cardiac care, including disorders of the heart and blood vessels. We offer diagnostic, preventative, clinical and rehabilitative cardiac care and perform a number of both non-invasive and invasive procedures. The office is located in a main line suburban setting and is privately owned. We have a team-oriented approach and a work culture designed to create an excellent patient experience. We are looking for 2 full-time Call Center Reps to join our growing team! This person will be responsible for patient scheduling, new patient information, and general patient inquiries. Our ideal candidate has excellent communication skills and attention to detail. Job Title: Call Center Representative Duties:\n- Answer incoming calls and respond to patient inquiries in a professional and timely manner\n- Provide accurate information to patients\n- Handle patient complaints and resolve issues effectively and efficiently\n- Maintain a high level of patient satisfaction through excellent service and follow-up\n- Input patient information into the system accurately and efficiently\n- Follow call center scripts when handling different types of calls\n- Collaborate with team members to achieve individual and team goals Skills:\n- Excellent verbal communication skills with the ability to actively listen and understand customer needs\n- Strong problem-solving skills to address customer concerns and find appropriate solutions\n- Ability to multitask and navigate computer systems while speaking with customers on the phone\n- Attention to detail to accurately record customer information and update records as necessary\n- Ability to work in a fast-paced environment and adapt to changes quickly\n- Strong time management skills to prioritize tasks effectively For questions, please call 484-272-3270 ext. 3026. or email agorsonmarrow@bmmsa.com Job Type: Full-time Pay: $16.00 - $17.00 per hour Benefits: • 401(k) • Dental insurance • Disability insurance • Flexible schedule • Flexible spending account • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • Monday to Friday Experience: • Call center: 1 year (Preferred) • Customer service: 1 year (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=5407181b7f3195af&fccid=e65a7f54f32082bd&vjs=3",
            "title": "Surgery Scheduler",
            "company": "Main Line Health",
            "location": "Wynnewood, PA",
            "salary": "Not Available",
            "description": "Description:\nCould you be our next Surgery Scheduler at Lankenau Medical Center?\n\nWhy work as a Surgery Scheduler with Main Line HealthCare? • Make an Impact! Are you compassionate, comfortable on the phone, and a good listener? Communication is key as the Surgery Scheduler: you will be interacting with patients to schedule office procedures (both inpatient and outpatient), follow up appointments, and any testing required by the doctor. Attention to detail is paramount to ensure all patient demographics are correct, insurance is verified prior to procedures as well as pre-certifications are acquired. You will also use your keen attention to detail to review necessary medical preps for day of surgery, as well as discuss follow-up with the patients. • Develop and Grow your Career! Invest in furthering your education through seeking certifications or advanced degrees by taking advantage of our Tuition Reimbursement! This position is eligible for up to $6,000 per year based upon your Full or Part Time status. • Join the Team! Like our patients, the Main Line Health Family encompasses a wide range of backgrounds and abilities. Just as each of our patients requires a personalized care plan, each of our employees, physicians, and volunteers, bring distinctive talents to Main Line Health. Regardless of our unique design, we all share a purpose: providing superior service and care. • Position-Specific Benefits include: You are eligible for up to120 hours of paid time off per year based on your Full or Part Time status. We also offer a number of employee discounts to various activities, services, and vendors... And employee parking is always free! Position: Surgery Scheduler Position Responsibilities: • Acts on a consistent basis to support the Mission, Vision and Values of MLHC. • Schedules inpatient and outpatient procedures with the operating room, surgicenter, etc. • Verifies and updates insurance coverage for procedures; precertifies procedure when necessary. • Coordinates preadmission testing, medical clearance, EKG studies, etc. • Communicates regularly with patients regarding status of procedure and instructions for day of procedure or any other patient issues that may arise. Discuss with surgeon as necessary. • Discusses any necessary medical preps for day of procedure. • Ensures that all necessary information is in admission, OR, etc. before day of procedure. • Prepares chart for the day of surgery for physician; coordinating films, consents, lab work, etc. • Schedules post-operative visit. • Makes arrangements for all medical supplies that will be needed after surgery. • Review daily OR schedule, physician meeting and on-call call schedule. Distribute as necessary. • Review daily inpatient census and distribute as necessary. • Answer telephones and schedule appointments as necessary. Check-in and check-out patients during office hours. Often acts as receptionist or is back-up for receptionist. • Contact physician regarding requests for inpatient consultations. • Assist with office hours as necessary. • Responsibility for filing, copying, mail, etc. as per office procedures. • Attends meetings as required • Maintains patient confidentiality. • Performs other duties as assigned by practice providers and/or practice management. Shift: Full Time, Day Shift\n\nExperience:\n1. Three years of experience in a specialty physician's office with strong knowledge of managed care payors required.\n2. Knowledge of medical terminology and hospital procedures preferred.\nScheduling experience is preferred.\n\nEducation:\nHigh school diploma or equivalent.\n\nLicensures/Certifications:\nN/A"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cs0rmy8NcKuMwjZ33B3MwJia_5S8TV5Xj4dHNx35rR_XUpn4JqVkD4uTs24jSG895V1VKq6tl-hB-if0wPnH674EH-lbs8fCY53gYea_5Pyu7atrlRaUY1qjKVG8-lQTa7gRNl2vkEHo1n0tGmNSLkKVTU5ISu3d-ITuyhV9D0J8Clu2CfLbeC7TtLZ2S-P3lQwRvlsk_6lqmIcR8XkFF-DQkdHjPsTnNwGioN5v0VzXOxsVU5FjJGjGjBRLCNb1z9OQvDH_DsE_5Ukw4Rf15ff33D-sEhxQ9kqUlZ1jegNw79zv00YGNa6cftVBVePd1LRdXYYgoaAf1hl_Ipkty7vrpKgGEGxmoS5BR2Is9Rwio6XdbxkaccZ6FgOZfzFpUVoUHBa-kagio-VjwUWA7JPCxfCTNIBZNjNc-GaJd-HV4SmUQD-4qBw0utwQrw-ccSz25DN4FacqlqWhyFST4TFchh5ZOK0XMourMfVIj9syU2we8QIc_APHg0Bc4eRr76Y6OoXCT-usFwNZkRFldXednNSbUr08KAJ1SUoWm8IoL3N1o3TQW7_tBo1TPYYE8UeOJStmNOwd-hWfXgaJVXFW1GFU64xbso-ticMIVKcNygZs0d1EFl&xkcb=SoDN-_M3HJ1abkTOpJ0BbzkdCdPP&p=10&fvj=1&vjs=3",
            "title": "Patient Representative",
            "company": "Bryn Mawr Medical Specialists Association",
            "location": "Bryn Mawr, PA",
            "salary": "$18 - $20 an hour",
            "description": "About us Our physicians in the BMMSA Gastroenterology department diagnose and treat diseases of the gastrointestinal tract, which includes the esophagus, stomach, small intestine, colon, liver, pancreas, gallbladder and bile ducts. Specific disorders/conditions that we diagnose and treat include: • Reflux/Gerd • Irritable bowel syndrome • Crohn’s disease • Colitis • Celiac disease • Swallowing disorders • Barretts esophagus • Chronic diarrhea • Hepatitis • Fatty liver disease • Pancreatitis • Gallstones • Gastrointestinal cancers We should also mention that we have an infusion unit to treat IBD with the most advanced biologic therapies. Procedures should include ERCP and wireless capsule “camera” studies of the small intestine. We are looking for a full-time Patient Representative to join our growing team. Our ideal candidate is organized, dedicated, and passionate about patient care. Medical office experience is preferred but not necessary for this position. If you are looking to work in a fast-paced medical office with a strong team, apply here! Responsibilities:\n- Greet and check-in patients as they arrive at the medical office\n- Collect and update patient information, including medical history and insurance details\n- Schedule appointments for patients and assist with rescheduling as needed\n- Answer phone calls and respond to patient inquiries in a professional and courteous manner\n- Verify insurance coverage and process insurance claims\n- Maintain patient records and ensure accuracy of information\n- Assist with medical administrative support tasks, such as filing, scanning, and data entry\n- Collaborate with healthcare providers and other staff members to ensure smooth operations Experience:\n- Previous experience working in a medical office is preferred but not required\n- Familiarity with medical terminology and procedures is a plus\n- Strong communication skills, both verbal and written\n- Excellent customer service skills and ability to interact with patients in a compassionate manner\n- Proficient in using computer systems for scheduling, data entry, and record keeping\n- Attention to detail and ability to multitask in a fast-paced environment We offer a competitive compensation and benefits package for qualified candidates. If you are looking for an opportunity to work in a dynamic healthcare setting and provide essential support to patients, please apply now. For questions or concerns, please contact Ali Gorson at 484-272-3270 ext. 3026 or agorsonmarrow@bmmsa.com. Job Type: Full-time Pay: $18.00 - $20.00 per hour Benefits: • 401(k) • Dental insurance • Disability insurance • Employee discount • Flexible spending account • Health insurance • Life insurance • Paid sick time • Paid time off • Retirement plan • Vision insurance Schedule: • Monday to Friday • No nights • No weekends Work setting: • In-person • Office • Private practice Experience: • Customer service: 1 year (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=c7f55ea2d1682d6e&fccid=cce48ad42816872f&vjs=3",
            "title": "Unit Secretary Part Time Night Mom Baby Jefferson Einstein",
            "company": "Jefferson - Philadelphia, PA",
            "location": "Philadelphia, PA 19141",
            "salary": "Not Available",
            "description": "Join the mission of Improving Lives as a Unit Secretary Clerk at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.  Unit Secretary Clerks are responsible for the following:  • Provides support to the nurse manager with reports, data, and special assignments. Provides support to the nurse manager with reports, data, and special assignments. • Transcribes physician orders for medications, diets, treatments, etc. Transcribes physician orders for medications, diets, treatments, etc. • Runs errands as directed/necessary Runs errands as directed/necessary  Reporting to the Nurse Manager, the Unit Secretary Clerk will perform various clerical responsibilities on nursing units including preparing, compiling, and maintaining patient records. Qualifications for this position include:  • High School Diploma or equivalent High School Diploma or equivalent • Six (6) months of clerical experience Six (6) months of clerical experience • Knowledge of medical terminology preferred Knowledge of medical terminology preferred  Benefits include, but are not limited to:  • Comprehensive Medical, Dental, & Vision Plans Comprehensive Medical, Dental, & Vision Plans • Retirement Plans Retirement Plans • Tuition Reimbursement Tuition Reimbursement • Health Coaching, Commuter Discounts, Day Care Services, etc. Health Coaching, Commuter Discounts, Day Care Services, etc. Since this position will require the selected candidate to engage in regular contact with children in the form of care, guidance, supervision or training, you will be required to meet the requirements of the Child Protective Services Act, including the Pennsylvania State Police criminal background check, the Pennsylvania Department of Welfare child abuse criminal background clearance, and an FBI finger print based federal criminal records check. The selected candidate will not be allowed to commence working until all three (3) are completed satisfactorily. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=e93642fc4bea01e0&fccid=36b76cf613fccb72&vjs=3",
            "title": "New Patient Coordinator",
            "company": "Penn Medicine",
            "location": "3400 Spruce Street, Philadelphia, PA 19104",
            "salary": "Not Available",
            "description": "Description Job Title: New Patient Coordinator\nDepartment: Radiation Oncology\nLocation: Hospital of the University of Pennsylvania - 3400 Spruce St\nHours: Full Time First Shift Summary: • This position is responsible to provide optimal new patient coordination in an integrated, multi-disciplinary environment. Care will be coordinated across multiples specialties and ancillary departments within UPHS. Employee will ensure that all new patients are well prepared for their first visit by making certain patients are being seen by the appropriate physician and specialty and that patients arrive for their appointment with all pertinent information to ensure optimal care coordination (medical records, test results, referrals, copays). In addition, patients will be provided information on directions, parking and building navigation. • The position requires that the individual convey a positive image of UPHS through excellent communication and customer service skills in support of patients/families and to ensure an ideal patient experience. Responsibilities: • Act as point of contact for all new patients for department. • Serve as specialty expert of nuances of care coordination so that patients are seen by the appropriate physician and specialty. • Schedule new patient appointments with appropriate physician and/or group with emphasis on working with providers on a regular basis to ensure that the right diagnosis and patient is scheduled with appropriate provider. • Coordinate new patient appointments as needed with Patient Facilitated Services and Penn Health Referral. • Follows new patient coordination protocols to ensure that patients are coordinated and prepared for visit in an organized, consistent and seamless manner. • Coordinate/organize all facets of new patient appointment – scheduling, coordination of medical records, test results, pathology results – all information needed to ensure an optimal level of care coordination. • Coordinates the scheduling of diagnostic tests, other evaluations and review of necessary information prior to new patient appointment. • Responds to patient inquiries or problems. Answer questions regarding practice, procedures, tests, directions etc. • Coordinate the retrieval and flow of outside medical records to ensure receipt and appropriation (review by provider, scanning, etc.) of records for visit. • Ensures appropriate retrieval, processing and returning of patient radiology films, CDs, slides and other related items. • Manages physician new patient IDX schedules, ensures appropriate preparation of new patient charts and information 48 hours prior to date of new patient visit or services. • Reschedules new patient appointments appropriately. • Ensures optimal patient experience through coordination and communication. • Follows Health System and Department Protocols for Epic Messaging. • Communicates issues effecting flow with managers and providers as necessary. Keeps manager aware of potential issues or problems as they arise. • As required, maintains compliance with all federal, state and local regulatory standards and requirements, including TJC, Department of Health, funding agencies, FDA, HIPPA, HCFA, DPW, LCGME, SCGME, department specific guidelines and other. • Ensures patients have been properly registered and referred to Financial Counseling. Makes sure new patients arrive for new patient appointment with referral and copays, as appropriate. • Maintains an excellent understanding of managed care plans and protocols for referrals, co-payments, and pre-certification. • Readily adopts and is engaged in practice operation changes • Is proficient in the use of all system applications necessary for practice operations, including, but not limited to: • IDX (and its applications) • ONTRAC • EPIC • MEDVIEW • NAVICARE • CHART ONE • Other • H.S. Diploma/GED (Required) • 5+ years experience in a medical office setting or Customer Service experience. (Required) • Advanced degree (Associate's, Bachelor's, Master's) preferred and may be considered in lieu of some experience • College-level coursework in business, accounting, or health care administration strongly preferred. • Specific knowledge of precertification requirements, CMS medical necessity required, and third party billing knowledge is ideal. • Experience with spreadsheet and word processing software preferred. • Knowledge of medical terminology and office procedures.  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CoaJ7C2lsi2k2gNgvLcN_aSmEzL_E2opWAf5Z9WvxazFw7ohc8APc17hyzoeo2GbRDJf_Xt1UOn3ydiZ6hlwtVl19t0Yr6IBJh2Fjnr8i1XH1AHBxz7KcMBpD0DnkuH4kpEzf4hyk0oAX0QTlIa8Gn_EsLPc2W-acxXydZvXsP0DkI9BqQZD_6K6fjE4bh1UuswdoxhCgfR1UVmJDmnXQblDkNEPk9o7XL9HcUJHyeHJja_uAlcXBPpIjUJx5o6f-EIf-KhY_g-K5Ds5FklQNlH77WCh3wEylu-994Go9dg143zSKTOtGE-ahLaGogtXdccT7ktoprMxxj9dvfCWXfMizpRGruVey3wruot_yh9jeGoHPSr0_O_Tgebj7zNFXBGsatfYGS60UXDsjnN5YTZCsnhPOpQmcSTU9JbgEAX_O3RFLs7EfcJHp2Vplb8qUKncYWtS7cR1a2B5SpC-D-GYjJjRw930yF3lLNUw1DxdML8Ntlbo6DJEwv0K9URCiyHIxe9VGecWWV8Mop8KThSnKJbwWkEa55TijzLNsIlQVZW1f903UaCbG-80fc4nfCLb2XhmA0OWMfPvVoyRGF&xkcb=SoBD-_M3HJ1abkTOpJ0GbzkdCdPP&p=13&fvj=1&vjs=3",
            "title": "Home Care Coordinator",
            "company": "NCA",
            "location": "2442 S Broad St, Philadelphia, PA 19145",
            "salary": "$20 - $25 an hour",
            "description": "Home Care Coordinator\nJob Responsibilities: • Responsible for scheduling & coordination of services. • Supervise caregiver performance & ensure a high level of care for the participants. • Responsible for proper documentation of cases. Skills: • Prior customer service experience in a healthcare setting is preferred. • Excellent communication and customer service skills. • Strong computer skills including knowledge of HHAeXchange . Requirements: • High School Diploma • Bilingual English/Spanish. • Experience as a Home/Health Care Coordinator preferred. Compensation based on experience and performance. We are an equal opportunity employer and do not discriminate based upon race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, or disability status. Job Type: Full-time Pay: $20.00 - $25.00 per hour Expected hours: 40 per week Benefits: • 401(k) • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • 8 hour shift • Monday to Friday Work setting: • In-person • Office Experience: • Home/Health Coordinator: 1 year (Required) Language: • Spanish (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=d28174f931189739&fccid=36b76cf613fccb72&vjs=3",
            "title": "Telehealth Coordinator",
            "company": "Penn Medicine",
            "location": "1800 Lombard Street, Philadelphia, PA 19146",
            "salary": "Not Available",
            "description": "Description Entity: Penn Primary Care and Specialty Practices Department: Center for Connected Care Location: Philadelphia, PA (On-Site)  Hours: Day Shift- 6:30am-7:00pm; (3, 12-hour shifts) Summary: • Serves as the primary source of contact in coordinating telemedicine/telehealth activities at Penn Medicine Center for Connected Care. Responsible for supporting the day-to-day operations of the telemedicine/telehealth activities and/or telemedicine/telehealth initiatives occurring at the Center for Connected Care. Contributes to continuous improvement in patient care and population management. Collaborates in coordinating patient care management across enterprise wide cross-functional departments, supporting telemedicine/telehealth services and telemedicine/telehealth best practices. • Assists in the management of clinical data: retrieval, entry, aggregation, analysis, and reporting. Tracks and analyzes trends on the data relating to the quality, safety, utilization, and satisfaction of telemedicine/telehealth services to evaluate the Center's clinical effectiveness and potential areas of improvement. Responsible for thorough and accurate documentation to include patient training and patient troubleshooting for the proper use of telemedicine/telehealth equipment. Must be confident, composed, responsive, and approachable when interacting with patients, families, and clinicians via telemedicine/telehealth devices including two-way camera technology.  Responsibilities: • Maintain confidentiality, exercise discretion, use independent and mature judgment, work independently without supervision with a commitment to clinical excellence • Operate a computer with proficiency in utilizing clinical applications, telemedicine/telehealth applications and office programs such as Excel, Word, Outlook, Skype, etc. Maintain basic IT troubleshooting skills for computer applications and telemedicine/telehealth peripherals. • Prioritize workload and meet deadlines, develop and carry-out assignments in an efficient and timely manner, provide accurate and succinct documentation of activities. • Be flexible and amicable to efficiently manage multiple tasks in a fast-paced work environment. • Communicate effectively with patients and clinical staff members including nurses, doctors, providers, social workers, etc. Support telemedicine/telehealth activities with internal and external stakeholders. • Exercise tact, courtesy and diplomacy when dealing with individuals at any level. Engage, support, and educate stakeholders within telemedicine/telehealth programs using age & developmentally appropriate tactics. • Triage incoming telephone calls and appropriately manage each call by obtaining adequate information to make a proper telemedicine/telehealth referral and scheduled teleconsultation when appropriate • Schedule appointments, set-up and test equipment for telemedicine/telehealth engagement, reconcile telemedicine/telehealth applications to maintain accuracy across electronic medical record.  Education or Equivalent Experience: • H.S. Diploma/GED (Required) • 3+ years' experience in a medical environment preferred and experience with patient teaching a plus.   We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        }
    ],
    "metadata": {
        "source": "https://www.indeed.com/jobs?q=Healthcare&l=Philadelphia",
        "timestamp": "2023-11-27T22:13:39.877924"
    }
}