[
    {
        "domain": "Healthcare",
        "url": "https://www.indeed.com/jobs?q=Healthcare&l=Philadelphia",
        "data": [
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Dan4qRYW6AyOVQnsVTF0p7NN7GQ0ELhKU6lTI4ws-1hUqqFGKPPjfNkRPS6F234iTJp1kbNWFxMIzvOGG83Ij9ToIiNJlGFbA2gZhYv-HInQB4UX-xRNIMx7cAeGrQUIZV04Hp06upvRepCWNFqsu8srBhg6whC29Av9YCITcaZaRRWOFHwW4qJC6IHal_9EA3GRsk5QT34rVXdWx9fFAwfD5aL4p4xVeHA9juFjrCa1hbFrgB70v7kkoUL0l9_lon6STFZe-uo3lN77Ss0a2kS5vazsReR7Y6LyuL_J1eJ-5kf5ZRhus_xKdgDjTFiQi4eMthxweJI7gkUT3CT1Qix-3GoXqywq7dHdqsmJ4CPKm3Eqat2lo3sZZjb2mg_g5qvhn0uUZ5WWYfNP_vdE4c31coHGHOLeCCzlVU0xPLhyWhfrgLSGHgCvdtzWEIGH2kLGioK6qIW8olNsUdHTl6kCpioVUM1aYNOYdWbpR4DMOljo9dsxuZEyc_TGMfkCmM_3506Ton9LHQE11cn5M-akMMYq26sDVSkssc80I3RPjAAtyLe_DxUsi6Cp95XyYGlQWPPnneE5dL4ZNcdt3EbDDx0ltrgSI=&xkcb=SoB_-_M3HKHhYr2eFZ0LbzkdCdPP&p=0&fvj=1&vjs=3",
                "title": "Otolaryngologist",
                "company": "Otolaryngology Plastic Surgery Associates",
                "location": "103 Progress Drive, Doylestown, PA 18901",
                "salary": "$250,000 - $450,000 a year",
                "description": "Seeking BC/BE otolaryngologist to join a busy practice in the suburbs of Philadelphia to begin summer / fall 2024 Serving Montgomery and Bucks counties, we are a 4 person independent practice with an academic affiliation. We have 3 fully staffed offices, 6 audiologists, and operate out of 2 local hospitals and a nearby surgical center. A great place to live and work! We practice all aspects of otolaryngology. While primarily a general ENT practice, one of our partners is fellowship trained in facial plastic surgery. Specialty interest is encouraged and can be supported. We offer a competitive salary, a benefits package, and a clear path to partnership if desired. An excellent opportunity to be busy right away and grow your practice! Please visit our website at www.ent-drs.com Job Type: Full-time Pay: $250,000.00 - $450,000.00 per year Benefits: • Health insurance • Paid time off • Retirement plan • Vision insurance Healthcare setting: • Outpatient Schedule: • Monday to Friday • On call License/Certification: • BC/BE (Required) • Medical License (Required) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BKgzQyzTF1Q9mOsR1amaS-juVGLjHt5Cdom-gEF9y-xeW_4N5IZFKMYoVqeSyTWlzMN99g34jsLdypPRuthGFhgelLMAbgiuL3abTcjN1Y8H8zdXIB2707f266yn4MSl3FudFA0pGlkdB8-JYw-dURRqpw7LCz0TksbIjv_XP9bescRo44SHAr_CrwWVfrRyhwuSf3AUD7N1EJiaWXaIQ_iRMFCVPS7YpWYdqJ5Qu7CjhKih9kCqQKiDCp9tC-1fF4O0gHOx4o62OHGAJnJNhPf9jEeDrc1KM2gywqQ3b7UDqaMyVsy7SQaB0MKEJG9VLrpGgXiEXcP7PcTxqN63rHPTIa3NcOmf1ixec0pciN7wXCrFWQtGrItjUs-eKG9T9CGHLr7QffrPsFb1A0CYm1tsbuOhhGV0uSR9frsr-Vy-1kL3EXBpJBZ8HVCYTzLJugyHwhv_y_QsEOhGyGHbqDEmUs6ZkEVYfAp9ynqOFw_sMnSNDkkcxhK7Mzi05IOqk4M1B4bvSt0C7ljGdW66iiiBOtr-HHCPbf6NoWBNwInqiggoALhrc8S123E_51IGE9GPEBi5s_Ec5YcZT9FfjhhJwEHJzADuWpjPDA27KRkeqDAwQYa0ba_qF-Op0bwm47US-nSXEypdK_LG_hqvOaSZY6SUYj49k=&xkcb=SoDL-_M3HKHhYr2eFZ0KbzkdCdPP&p=1&fvj=1&vjs=3",
                "title": "Crisis and Consultation Psychiatrist Supervise Medical Students",
                "company": "Generation Health Search",
                "location": "Location Not Found",
                "salary": "$220,000 - $260,000 a year",
                "description": "Join a leading healthcare provider and employer in Pennsylvania. We are seeking a Board Eligible/Board Certified psychiatrist for the health system’s crisis and consultation service. The ideal candidate will be responsible for providing psychiatric evaluations to patients that present to the medical center as well as in-person consults to hospitalized patients receiving medical care. The candidate must be open to medical student and Advanced Practice Provider supervision and training. The candidate will provide clinical oversight to psychiatry residents as part of clinical rotation. This is a wonderful opportunity for a new graduate or an experienced psychiatrist. Requirements: Psychiatric and Medical license. Current MD license in the State of Pennsylvania required plus current DEA registration. A competitive compensation package will be offered consisting of: • Paid Time Off (PTO):26 days per year: 6 Legal Holidays • Full-time, competitive salary • No Call Required • Malpractice insurance coverage including Tail coverage • Generous CME package. • Health insurance package • Relocation package if needed • Commencement bonus for select candidates Job Type: Full-time Pay: $220,000.00 - $260,000.00 per year Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Health insurance • Life insurance • Professional development assistance • Retirement plan • Vision insurance Medical specialties: • Psychiatry Schedule: • Monday to Friday • No weekends Supplemental pay types: • Bonus pay Ability to commute/relocate: • Upland, PA 19013: Reliably commute or planning to relocate before starting work (Required) License/Certification: • BC/BE (Required) • Medical License (Required) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BuVxjzrRKxFIxkSd-eDXfW7bkGlF2tt1P3Nv2ojP2gzZQwwr8d8uXUQvKlQu2-zcbP2wu2sEVZ-AILk9bMbzIVLu2VuLKWH3EvyCw4_jglu4URGBA1AXVatBlBIUpznAm-0sclk3GO2sywxykLuRQxyO8_ZhjP_Z5XkRe1c1jT4BvGEj8Lv3-a_9qzQDUm9n88diye-eYZvrvBlLaZHTy2QzhngHhcjBoVpKFaIPcMGMBH39tGlwAz3BttAtxHb2bq2GhjAl0YEHcrh14t8tjlX3HPQCtW-fsLLs6oczE7IuiRiT0bh7JxVDIDamSOjOvsNPI1EfV3Qzy3sLpAeduuBygpxDp2KRT8usKT6MsTB1wHXyMvhSE1PrBxxcSAT98faPNnBhyZBrfn9FooTDU3ymvyMikEuecx4Z20X7iw7e_zrEfsuRU3_w7UNO1OQpi5yhWcrvVeNGi9bzjTua29bEGK8bBQah_jVImheWiPXEF8XJTHFxRuQP9Hik_GQoDLNqi0C7wAG2sZUiy1p-wOnEqtQGA9ZrB5bI2W1AegLWXTQBGcukI6M2P2nRbcyCSf_kNRsqaEBfZ--_xkhEONh2JEg74NgAAIqsgmnIJ4WhCxPOc6ujMQ&xkcb=SoBW-_M3HKHhYr2eFZ0JbzkdCdPP&p=2&fvj=1&vjs=3",
                "title": "Dental Office Receptionist and Scheduler",
                "company": "Philadelphia Dentistry",
                "location": "Location Not Found",
                "salary": "$20 an hour",
                "description": "Welcome to your new work family! Can you greet two people at the same time and answer a phone call all while smiling? Love chatting to perfect strangers ? Have dental experience but feel under-appreciated? Philadelphia Dentistry in Center City, Philadelphia is seeking an awesome receptionist / scheduler to work with us in our dental office! We are looking for an exceptional candidate seeking a better work environment, looking to be challenged and a long-term position with promotions and growth available. Recent renovations and expansion have caused a need for this position. Turn Ons: hard work, attention to detail, cleanliness, punctuality. Great communicators who are organized and love work for work's sake is what we are seeking. Best matches are people with personality who appreciate health and wellness and who love people, and who will bring something positive to our office each and every day. If this is you, we've been waiting for you to join us. A little more about us: We are a well-established, award-winning dental office known for our excellence in delivering the best dental care in the Philadelphia area. We are friendly and have a staff of 20 employees in a new, clean office environment in a high-rise medical building at 1601 Walnut Street. We are seeking to work with with an individual who wants to constantly improve, is up for a challenge and will enjoy the support that we have to offer. We have a positive work environment and work toward monthly goals. If you are not familiar with Dr. Ken Cirka, Dr. Mimi Jeon, Dr. Evan Ridge and Philadelphia Dentistry, we encourage you to review our website while applying at www.PhillyDentistry.com. Requirements: Health conscious, clean appearance, on-time and hardworking. A positive attitude is what you need-we will train. No dental office experience is necessary, but it is helpful. Compensation includes a solid pay including benefits such as 401K with matching, health benefits, dental care, time off, and paid vacation. Please no phone calls. We will review your resume and contact you if we are interested in working with you quickly upon receiving your application. Job Type: Full-time Salary: $20.00 /hour plus benefits. Job Type: Full-time Pay: $20.00 per hour Expected hours: 36 – 42 per week Benefits: • 401(k) matching • Dental insurance • Health insurance • Paid time off Healthcare setting: • Private practice Schedule: • Monday to Friday • No weekends Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=50b42542e45854f8&fccid=cce48ad42816872f&vjs=3",
                "title": "Scheduler",
                "company": "Jefferson - Center City, Philadelphia, PA",
                "location": "Philadelphia, PA 19106",
                "salary": "Not Available",
                "description": "• Screens patient calls and implements protocols for appropriateness of appointment. Confers with physician or allied health practitioner to determine if patient can be seen by physician. • Completes a full registration to secure a medical record number. Completes registration with complete accuracy to assure proper reimbursement to physician and Aria Health. • Takes messages and triages calls and directs to correct physician, allied health practitioner or department. • nstructs patients with correct information for appointment requirements such as labs, x-rays, location of appointment, insurance, referrals, directions and parking. • Manages a physician’s appointment scheduling, assuring maximum operational efficiencies. • Answers all calls for appointments, questions and other messages before the end of each business day for physicians and allied health practitioners. • Maintain and keep up all physician and AHP daily schedule changes. • Maintains confidentiality of information according to the policies and procedures of the Practice and Aria Health. • Performs other duties as assigned to assure patient satisfaction, quality patient care and efficient Practice operations. Education: High school diploma or GED.  Experience: At least two years of experience in a healthcare setting, preferably in a physician practice with a thorough knowledge of third party insurance, billing and reimbursement especially managed care. Proven knowledge of appointment scheduling and electronic registration. Two years experience in a physician practice is preferred. \n Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DKCgHRiFkXP4Vp7DmWPeSMRZwW8ITmX5bAP87iacCuBajTXbSyZLb7gkJv_bEeWoEIB6czZ2IyEJ0e6QTS5TCZIUaDYWl1v-6G1Ky5DKID_9WlxKE0abZxyZ_V41yCbRFXPoXO4mBbCNKPZ7-gBGQ3ODP2PbOEMrt3FwsdC5qs1rBqLDDUFkiLVNFpLF-Vg1X1Avnwt5qvKL1DKXJIgjJe2VZhIXU7y3Q7oM8n6EWbinvDYoSDo2RjHGYdySdEFgZZ3p2NMM4_1d1kJHxi9XxL9rF9YufvMBSrqecVB6vMpeV7ABM_0XDNsRdFwKUntpCU_Rwpe3PpShYJU17w9wWFWuEW6VrRCNCs4aCXlPX5dq8JZRI-bVYiRkq2R8uSyqjHwzlIMlPvCCDaSoDCcVSba5EuGa1eySnuaIVAlp38TH7n5Q2d5ZzRLLjcv5baSijwHJ0DzGo4c5CG_6KKwLZswfgJzbJoeqxmKo8gmROVas7ng9hj5tXgylR2IryziSM8G3pemWZhwQHDTQpJbIP20nxlAYpedoNCEXPuwgMwSmMKSrpsoxhcDwaZjdwU6hg3WU0ai-d5oc13ZISPR1Z1c-xyTtH11ROr0YDH6KfHHA==&xkcb=SoBs-_M3HKHhYr2eFZ0PbzkdCdPP&p=4&fvj=1&vjs=3",
                "title": "Physical Therapist",
                "company": "Immediate Homecare & Hospice",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Physical Therapist Immediate Home Health and Hospice is a leading provider of home health and hospice services in the Philadelphia, PA area. Our mission is to provide exceptional home health and hospice services to patients who need our help the most. We are seeking talented, passionate individuals to join our team and help our patients live happier and healthier lives…in their homes. What We Offer*: We know that, to be the best place for our patients, we must be the best place to work for our employees. We offer the following to our employees: • Be part of a unique healthcare company where we can help those in our communities who need our help the most • Flexible hours/work-life balance (full-time or part-time available) • Competitive pay • Paid on a weekly basis • Medical/dental/vision/life insurance • Paid holidays/PTO/401(k) match • Career growth opportunities • Great and collaborative work environment What You Will Do: • Work collaboratively with physicians, nurse practitioners, nurses, therapists, social workers, and caregivers to deliver comprehensive and coordinated care to our patients in their homes – conduct patient home visits • Conduct evaluations and develop physical therapy treatment plan for our patients • Deliver treatment/care in accordance with care plan • Prepare and maintain accurate and complete clinical and progress notes on a timely basis Qualifications: • Active Physical Therapist state license • Valid drivers’ license • Two or more years of applicable physical therapist experience *Eligibility for certain benefits may depend on employment status Immediate Home Health and Hospice is an equal opportunity employer committed to providing equal employment opportunities without regard to race, color, religion, sex (including pregnancy), sexual orientation, age, national origin, disability, genetic information, veteran status, or any other classification protected by applicable law. Job Type: Full-time Benefits: • 401(k) • 401(k) matching • Dental insurance • Flexible schedule • Health insurance • Paid time off • Vision insurance Medical specialties: • Home Health Schedule: • Monday to Friday Experience: • Physical Therapist: 2 years (Required) License/Certification: • Physical Therapy License (Required) • Driver's License (Required) Work Location: On the road"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DgjFPyz9HbuVAXQ9B9EMKgc4sbnjVokPvRBmGOpXm1yBSOLqumaikJEnNy5ZnkRnHZdZldqxS2xroQA33MVOjRUV5AYUybL000aKrIpfc0wRBGPIvpbukIRkQV-I6t-TG3pasNZblcmkxvfX_AoyfomAK_-tHbCYxjTzrBG-FEQoeYPffxSrIz4VI7GTQ8YOpHCaCrLnYzWPfhCCBlOQAG_s0PWSGZRDyIk7fhhrhB4mzYYJxbkEzr2GW_5CaBWnZ8ehUwAUFy3E63Y82v4ZkgKIN1IWk--i1kE-E0vUB9-rf4Z97Ldwyizonxa50uuEM5nvZtheQCl0lTw_PRLRWU1uxeZYfQnWebOPviXPbd1tGjyHdlIMgZOttwAnprndYy3U6STmTNtpvwKOofe6O8aEMj0SZ2lT3V_L9leHHFBAkORZMvZo96zeHqndqAi-13tJUBHKYgpZG8VGO2ZNpKGj4TFlvPRBCYIpvP6GpmRm3u112IUVmlJpZWdpS_si6lgwCN-T9Tu7Dmt8gl2ltNRt9DaWA8WSryE2ezgAo78CWqcFyosvOJP3q_bFtysHb1lzqO_uGafODvOMIswBpypkHdLSyHYM0=&xkcb=SoDY-_M3HKHhYr2eFZ0ObzkdCdPP&p=5&fvj=1&vjs=3",
                "title": "Director of Nursing",
                "company": "CADES",
                "location": "401 Rutgers Avenue, Swarthmore, PA 19081",
                "salary": "$70,000 - $80,000 a year",
                "description": "Job Title: Director of Nursing Location: 401 Rutgers Avenue, Swarthmore PA 19081 Schedule: Full-time - Exempt Position Description: The Director of Nursing by the virtue of special knowledge, training, and experience, is uniquely able to inform, motivate, guide, assist, and care for individuals with intellectual/developmental disabilities (I/DD). In this process, it is the primary responsibility of the I/DD nurse to recognize which problems are beyond the scope of his/her training, skill, or competency and to be willing and able to refer the individual to other appropriate professional services. Duties and Responsibilities: • Performs the advanced medical training in New Employee Orientation. • Agrees to be a Certified Diabetes Educator. • Completes clinical review of Health Risk Screening Tool (HRST). • Audits monthly nursing activities. Specific audits include, but are limited to: Monthly weights, Monthly head to toe assessments, Monthly SBAR reports, Weekly CLA meeting minutes, Bi-monthly medication reconciliation, Hospital discharge paperwork is correctly uploaded • Reads daily clinical reports. Provides feedback as needed. • Reads and reviews the electronic health record daily, specifically: Reads SComms, Reads all high-level T-logs, Reads and responds to GERs, Reviews and acknowledges all plans of care, Reviews and acknowledge all custom forms • Assessment, Planning, Implementing, and Evaluating new CLA nurses. • Performs an annual performance review for CLA nurses in collaboration with Assistant Director. • Provides expert opinion and training in the field or designates a proxy. • Communicate and coordinate health information between CADES, Program Directors and, outside provider agencies, and other health professionals, routinely and whenever further assessment, evaluation or monitoring is required. • Screening of individuals for illness/injury and determine the need for the implementation of routine, urgent, and emergency care as identified in CADES Nursing Policy and Procedures. • Prepare and administer medications, treatments and tasks as ordered and in accordance with CADES Policies and Procedures and the Pennsylvania 6400 Regulations, as needed. • Evaluate the therapeutic effectiveness of medication with pertinent data and report any observed side effects or relevance laboratory values to physician. • Monitor and oversee medication administration/issues for individuals to ensure accurate administration, documentation, and storage. • Oversees routinely scheduled CLA Nursing Meetings, in-service meetings, and other meetings as necessary. Ensures meeting minutes are placed in the appropriate folder on the intranet. • All communication is in accordance with the CADES Code of Conduct. • Reviews all hospital discharge reports, ensures appropriate follow-up actions are completed in alignment with all recommendations. Provides feedback to primary care physician on recommendations from discharge summaries for follow-up. • Maintains health care records in alignment with PA Department of Human Services regulations (Chapter 6400) and Medicaid Waiver regulations (Chapter 51). • Collaborate in the development and implementation of client annual assessment, health screening tools (such as HRST), ISP/IEP health plans and Plans of Care. Updates electronic health record(s) for any change in status throughout the ISP/IEP year. • Assists with disposable DME and supplements for clients on caseload in conjunction with residential staff as needed. • Assists in maintaining the confidentiality of medical records. • Audits CLA electronic health record documentation as directed. • Implements new clinical initiatives as directed by the Senior Director of Residential Services. • Keeps clinical supplies ready by inventorying stock. • Communicates with client’s family members and designated health care decision makers. • Other duties as assigned. Qualifications: • Master’s degree in nursing (or equivalent) desired, Bachelor’s Degree in Nursing required. • Unencumbered active registered nursing license in the state of Pennsylvania. • Minimum of five years’ experience working with and developing programming for individuals with multiple disabilities. • Current PA State Police & Child Abuse clearances; FBI clearance for anyone living outside PA in the past two years. • Valid driver’s license and 3-year adequate driving record; maintain adequate vehicle liability insurance. Required Knowledge, Skills and Abilities: • Ability to take accept direction from the Senior Director of Residential Services and implement departmental changes as needed. • Competent in nursing assessment, diagnosis, planning, implementation, and evaluation. • Basic lifesaving (BLS) certification. • Ability to facilitate team meetings. • Maintains client health care confidentiality. • Consistently presents in a positive, pro-active, open manner. • Seeks first to understand; demonstrates ability to meet individuals at their need level. • Able to manage expectations of multiple stakeholders • Holds peers and staff responsible by ensuring a commitment to training, understanding and high expectations. • Ability to travel within 3 counties (Delaware County, Chester County, and Buck’s County) • Excellent written and verbal communication skills. • Effective use of Microsoft word, excel and software computer applications. Visit our website at www.cades.org to complete an online application. CADES - Human Resources Manager Kenya Miah\n401 Rutgers Ave.\nSwarthmore, PA 19081 \n \n 610-328-5955 ext. 1122 COVID-19 considerations:\nThis is position is required to work onsite. Masks are optional within the building. \n We are committed to providing equal employment opportunity to all persons regardless of age, citizenship, color, disability, genetic information (including family members’ genetic information), marital status, national origin, race, religion, sex (including pregnancy), veteran status, sexual orientation, or any other protected status. We value and promote diversity as a strategic advantage. EOE Job Type: Full-time Pay: $70,000.00 - $80,000.00 per year Benefits: • Dental insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Tuition reimbursement • Vision insurance Schedule: • Day shift • Monday to Friday Education: • Bachelor's (Required) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AL_fMpfOsslTVVbSRCYFa3Wnjz87DWaHTFEfQItTYE45tLwtJhOmJXPXUacBfbLFWWDRU5dHhySYkEhYl_2rS798_PYquinHR6i21RVHgRRocdKk7s2Ozevz6k__pwG0a5s-3rGuv6z3vNH2ADc_uWFKhuozVnkjdkUfsIhtBIIVmqBx4ew_lva1NkhcR8ftlaL7QE-0TpUkEKQwKy9v1CeHTZkybW0f_NGMSriIdSSK8mJR1rzDOxcEX46BuOZNrBtLEBfUHBrZBL8xLjsTzqCmJrbghe7yZF9aTbUUKZGryTMw1Go9MOQp-Yd9ItnoeMQ3VbMxU8wfsWv7BAeEIulbxjr9R5syx2FlTSA_Ue9gTQqGpleUJ4aZHxnw6HacY4wFDHf2_GFLMluyrZbeEpo3XXlpJqHY3fjDeBJa0rGhEM7iTpeAHtO_mSa9X7st4CXHPLMu1bBFNpJRt4VSmh6GchavowSCCy86NcpWzHGpYVz4LI6uW6q9O6k40NXiaVZia7UUiQkEHvphrmSdTpxX1v5l883E2EzM3_O-cizdIcnApuOeWAvHaBDJDRm5HvtWSCl29qBp_DOtnBQY2p&xkcb=SoBF-_M3HKHhYr2eFZ0NbzkdCdPP&p=6&fvj=1&vjs=3",
                "title": "Periodontist",
                "company": "The Smilist Dental",
                "location": "Location Not Found",
                "salary": "$1,000 - $1,200 a day",
                "description": "The Smilist is looking for a top notch Periodontist interested in working in a team-oriented environment. We are looking for a periodontist to be responsible for gum related treatments and procedures. The responsibilities of a periodontist include performing surgical procedures, diagnosing and treating conditions, and establishing treatment programs to monitor oral health. Periodontist Responsibilities: • Providing implants • Performing cosmetic surgical procedures • Diagnosing and treating conditions • Developing treatment plans • Providing preventative treatment • Resolving gum issues such as gum sensitivity Periodontist Requirements: • Board eligible or board certified • 2+ years of experience • New Jersey license • Caring chairside manner • Collaborate well with general dentists and other specialists *The Smilist Dental provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Job Type: Part-time Pay: $1,000.00 - $1,200.00 per day Schedule: • 8 hour shift Work setting: • In-person Ability to commute/relocate: • Sewell, NJ 08080: Reliably commute or planning to relocate before starting work (Required) License/Certification: • Dental License (Preferred) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=5407181b7f3195af&fccid=e65a7f54f32082bd&vjs=3",
                "title": "Surgery Scheduler",
                "company": "Main Line Health",
                "location": "Wynnewood, PA",
                "salary": "Not Available",
                "description": "Description:\nCould you be our next Surgery Scheduler at Lankenau Medical Center?\n\nWhy work as a Surgery Scheduler with Main Line HealthCare? \n \n \n \n • Make an Impact! Are you compassionate, comfortable on the phone, and a good listener? Communication is key as the Surgery Scheduler: you will be interacting with patients to schedule office procedures (both inpatient and outpatient), follow up appointments, and any testing required by the doctor. Attention to detail is paramount to ensure all patient demographics are correct, insurance is verified prior to procedures as well as pre-certifications are acquired. You will also use your keen attention to detail to review necessary medical preps for day of surgery, as well as discuss follow-up with the patients. \n • Develop and Grow your Career! Invest in furthering your education through seeking certifications or advanced degrees by taking advantage of our Tuition Reimbursement! This position is eligible for up to $6,000 per year based upon your Full or Part Time status. \n • Join the Team! Like our patients, the Main Line Health Family encompasses a wide range of backgrounds and abilities. Just as each of our patients requires a personalized care plan, each of our employees, physicians, and volunteers, bring distinctive talents to Main Line Health. Regardless of our unique design, we all share a purpose: providing superior service and care. \n • Position-Specific Benefits include: You are eligible for up to120 hours of paid time off per year based on your Full or Part Time status. We also offer a number of employee discounts to various activities, services, and vendors... And employee parking is always free! Position: Surgery Scheduler Position Responsibilities: • Acts on a consistent basis to support the Mission, Vision and Values of MLHC. • Schedules inpatient and outpatient procedures with the operating room, surgicenter, etc. • Verifies and updates insurance coverage for procedures; precertifies procedure when necessary. • Coordinates preadmission testing, medical clearance, EKG studies, etc. • Communicates regularly with patients regarding status of procedure and instructions for day of procedure or any other patient issues that may arise. Discuss with surgeon as necessary. • Discusses any necessary medical preps for day of procedure. • Ensures that all necessary information is in admission, OR, etc. before day of procedure. • Prepares chart for the day of surgery for physician; coordinating films, consents, lab work, etc. • Schedules post-operative visit. • Makes arrangements for all medical supplies that will be needed after surgery. • Review daily OR schedule, physician meeting and on-call call schedule. Distribute as necessary. • Review daily inpatient census and distribute as necessary. • Answer telephones and schedule appointments as necessary. Check-in and check-out patients during office hours. Often acts as receptionist or is back-up for receptionist. • Contact physician regarding requests for inpatient consultations. • Assist with office hours as necessary. • Responsibility for filing, copying, mail, etc. as per office procedures. • Attends meetings as required • Maintains patient confidentiality. • Performs other duties as assigned by practice providers and/or practice management. Shift: Full Time, Day Shift\n\nExperience:\n1. Three years of experience in a specialty physician's office with strong knowledge of managed care payors required.\n2. Knowledge of medical terminology and hospital procedures preferred.\nScheduling experience is preferred.\n\nEducation:\nHigh school diploma or equivalent.\n\nLicensures/Certifications:\nN/A"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=c7f55ea2d1682d6e&fccid=cce48ad42816872f&vjs=3",
                "title": "Unit Secretary Part Time Night Mom Baby Jefferson Einstein",
                "company": "Jefferson - Philadelphia, PA",
                "location": "Philadelphia, PA 19141",
                "salary": "Not Available",
                "description": "Join the mission of Improving Lives as a Unit Secretary Clerk at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.  Unit Secretary Clerks are responsible for the following: \n  • Provides support to the nurse manager with reports, data, and special assignments. Provides support to the nurse manager with reports, data, and special assignments. \n • Transcribes physician orders for medications, diets, treatments, etc. Transcribes physician orders for medications, diets, treatments, etc. • Runs errands as directed/necessary Runs errands as directed/necessary  Reporting to the Nurse Manager, the Unit Secretary Clerk will perform various clerical responsibilities on nursing units including preparing, compiling, and maintaining patient records. \n Qualifications for this position include: \n \n  • High School Diploma or equivalent High School Diploma or equivalent \n • Six (6) months of clerical experience Six (6) months of clerical experience • Knowledge of medical terminology preferred Knowledge of medical terminology preferred  Benefits include, but are not limited to: \n  • Comprehensive Medical, Dental, & Vision Plans Comprehensive Medical, Dental, & Vision Plans \n • Retirement Plans Retirement Plans • Tuition Reimbursement Tuition Reimbursement • Health Coaching, Commuter Discounts, Day Care Services, etc. Health Coaching, Commuter Discounts, Day Care Services, etc. Since this position will require the selected candidate to engage in regular contact with children in the form of care, guidance, supervision or training, you will be required to meet the requirements of the Child Protective Services Act, including the Pennsylvania State Police criminal background check, the Pennsylvania Department of Welfare child abuse criminal background clearance, and an FBI finger print based federal criminal records check. The selected candidate will not be allowed to commence working until all three (3) are completed satisfactorily. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CbfnmyAPArm4OTZegQevbcf430bw0mhmB7Dd9uVicoZ0WfnCI--pU1z0Irx9Hk3S7in1OtYUlT5icxfscRQzl5g7VirqGJWAQcvjxgxoIJVeL5vdcFoqvBusraEsaRYPHyIvXJJl7d_l4RME0_cpvZViuJhImADOB5QZ9BvdA6jR28NDEmfJYfaDOInkRIgpyXVHL2L6H9Gr82OKLTYJKPUaV7gEgWMEnrXUDszTR5SI_E2xxYG5FzoWJ9GKwdlQfgAJ493qoxCAgjE5ODbeQGpNGbCLo7dRblXQ_9UTmswtNWkObGMUWLmhhXvT2PPXHXoe6ZowjKyg2qRoaGDLwFGICsS8_P-i0hh9j9Pxsu3L5p1pUKvbBtoGiaJyUKx2byyrhAJZE-6x9AjfxjBGzjUk9xeyTtwYtMPqf9ipFDIF6I55sbw_GH6sih4k7mL7Vgv5SbAbWPsMdctjw39-Ebl6wzc6RlZjokSItDjM7NR9gBbHFArYxl9k731z3R35YVawwrW4JuhwPxYO1-VVdkOhwpJf0ZtAzHaWzZ0GVMO9movQ3lvOI10ONQTMbMFJYeopvoNTgkd4219w2AK1qUZyj-oCUA8lKDMTOyCqY9Zg==&xkcb=SoCs-_M3HKHhYr2eFZ0CbzkdCdPP&p=9&fvj=1&vjs=3",
                "title": "Vaccinating Pharmacist",
                "company": "CVS Health",
                "location": "317 W Lancaster Ave, Ardmore, PA 19003",
                "salary": "$58 - $61 an hour",
                "description": "About us CVS Health is a large business in Ardmore, PA. We are professional, agile and innovative. We are looking for a Pharmacist to join our team and provide excellent customer service. The successful candidate will be responsible for filling prescriptions, providing medication information to patients, and maintaining accurate records. The ideal candidate will have a thorough understanding of pharmacology and the ability to provide accurate advice to customers. We are looking for an individual who is passionate about helping others and providing the highest quality of care. Responsibilities: • Dispense medications according to prescriptions. • Provide advice on the proper use of medications. • Counsel patients on drug therapies and monitor patient health and progress. • Maintain records of patient profiles, drug interactions, and advisories. • Monitor drug therapies for effectiveness and adverse reactions. • Ensure compliance with state and federal laws regarding the storage, handling, and distribution of drugs. Job Type: Part-time Pay: $58.00 - $61.00 per hour Benefits: • Employee discount • Flexible schedule Schedule: • 10 hour shift Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CoaJ7C2lsi2k2gNgvLcN_aSmEzL_E2opWAf5Z9WvxazFw7ohc8APc17hyzoeo2GbRDJf_Xt1UOn3ydiZ6hlwtVl19t0Yr6IBJh2Fjnr8i1XH1AHBxz7KcMBpD0DnkuH4kpEzf4hyk0oAX0QTlIa8Gn_EsLPc2W-acxXydZvXsP0DUInzAVoiGNJd9nEgIhLNYM7Mjdq0vR-ochzYtQ1RKbPeoyJYwxcOWiR-6syxpsUGaswm7ggIyRY-4eaShdmu_RO3kZXG48xgNhx8sYa1ue-d9eE7kuKFOU7fFSN9R_oaK3GKBghfpF4W-ePLTlIOjL4F-puuvnXiAIeKQmx__fzywLY3TCNn8gK_CzhU_ELhIvz6hbXHc8zbEzQw-zrXxYiAsNN9kXUeUFTobKhj6_9BZoS2lcuhqMwNk64pfz7_--tSO0qR0VxAsxCquKkCNM1UsZCU-EdJQf3g3NxoN_jkdsh-9PTO-GBxaYHRsOFdNiVxNbFXlOo0IDPhvPuUKWgZoigwVc5wVhEJ660G463wpEhzXyKT0n-QJS2kV61aaSz1GDCfIGoFSvVdUqNNzMOKZLPSpeTR3o_HA5l5fj&xkcb=SoAx-_M3HKHhYr2eFZ0BbzkdCdPP&p=10&fvj=1&vjs=3",
                "title": "Home Care Coordinator",
                "company": "NCA",
                "location": "2442 S Broad St, Philadelphia, PA 19145",
                "salary": "$20 - $25 an hour",
                "description": "Home Care Coordinator\nJob Responsibilities: \n • Responsible for scheduling & coordination of services. • Supervise caregiver performance & ensure a high level of care for the participants. • Responsible for proper documentation of cases. Skills: • Prior customer service experience in a healthcare setting is preferred. • Excellent communication and customer service skills. • Strong computer skills including knowledge of HHAeXchange . Requirements: • High School Diploma • Bilingual English/Spanish. • Experience as a Home/Health Care Coordinator preferred. Compensation based on experience and performance. We are an equal opportunity employer and do not discriminate based upon race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, or disability status. Job Type: Full-time Pay: $20.00 - $25.00 per hour Expected hours: 40 per week Benefits: • 401(k) • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • 8 hour shift • Monday to Friday Work setting: • In-person • Office Experience: • Home/Health Coordinator: 1 year (Required) Language: • Spanish (Required) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=e93642fc4bea01e0&fccid=36b76cf613fccb72&vjs=3",
                "title": "New Patient Coordinator",
                "company": "Penn Medicine",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Description \n \n Job Title: New Patient Coordinator\nDepartment: Radiation Oncology\nLocation: Hospital of the University of Pennsylvania - 3400 Spruce St\nHours: Full Time First Shift \n \n \n \n Summary: \n • This position is responsible to provide optimal new patient coordination in an integrated, multi-disciplinary environment. Care will be coordinated across multiples specialties and ancillary departments within UPHS. Employee will ensure that all new patients are well prepared for their first visit by making certain patients are being seen by the appropriate physician and specialty and that patients arrive for their appointment with all pertinent information to ensure optimal care coordination (medical records, test results, referrals, copays). In addition, patients will be provided information on directions, parking and building navigation. • The position requires that the individual convey a positive image of UPHS through excellent communication and customer service skills in support of patients/families and to ensure an ideal patient experience. Responsibilities: \n • Act as point of contact for all new patients for department. • Serve as specialty expert of nuances of care coordination so that patients are seen by the appropriate physician and specialty. • Schedule new patient appointments with appropriate physician and/or group with emphasis on working with providers on a regular basis to ensure that the right diagnosis and patient is scheduled with appropriate provider. • Coordinate new patient appointments as needed with Patient Facilitated Services and Penn Health Referral. • Follows new patient coordination protocols to ensure that patients are coordinated and prepared for visit in an organized, consistent and seamless manner. • Coordinate/organize all facets of new patient appointment – scheduling, coordination of medical records, test results, pathology results – all information needed to ensure an optimal level of care coordination. • Coordinates the scheduling of diagnostic tests, other evaluations and review of necessary information prior to new patient appointment. • Responds to patient inquiries or problems. Answer questions regarding practice, procedures, tests, directions etc. • Coordinate the retrieval and flow of outside medical records to ensure receipt and appropriation (review by provider, scanning, etc.) of records for visit. • Ensures appropriate retrieval, processing and returning of patient radiology films, CDs, slides and other related items. • Manages physician new patient IDX schedules, ensures appropriate preparation of new patient charts and information 48 hours prior to date of new patient visit or services. • Reschedules new patient appointments appropriately. • Ensures optimal patient experience through coordination and communication. • Follows Health System and Department Protocols for Epic Messaging. • Communicates issues effecting flow with managers and providers as necessary. Keeps manager aware of potential issues or problems as they arise. • As required, maintains compliance with all federal, state and local regulatory standards and requirements, including TJC, Department of Health, funding agencies, FDA, HIPPA, HCFA, DPW, LCGME, SCGME, department specific guidelines and other. • Ensures patients have been properly registered and referred to Financial Counseling. Makes sure new patients arrive for new patient appointment with referral and copays, as appropriate. • Maintains an excellent understanding of managed care plans and protocols for referrals, co-payments, and pre-certification. • Readily adopts and is engaged in practice operation changes • Is proficient in the use of all system applications necessary for practice operations, including, but not limited to: • IDX (and its applications) • ONTRAC • EPIC • MEDVIEW • NAVICARE • CHART ONE • Other \n • H.S. Diploma/GED (Required) • 5+ years experience in a medical office setting or Customer Service experience. (Required) • Advanced degree (Associate's, Bachelor's, Master's) preferred and may be considered in lieu of some experience • College-level coursework in business, accounting, or health care administration strongly preferred. • Specific knowledge of precertification requirements, CMS medical necessity required, and third party billing knowledge is ideal. • Experience with spreadsheet and word processing software preferred. • Knowledge of medical terminology and office procedures. \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=fcfdea929062d2b8&fccid=e65a7f54f32082bd&vjs=3",
                "title": "Patient Services Representative",
                "company": "Main Line Health",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Description:\nCould you be our next Patient Services Representative at Lankenau Medical Center?\n\nWhy work as a Patient Services Rep with Main Line Health? \n \n \n \n • Make an Impact! Be an Integral Member of our Organization! As a PSR, you are the first person to make a GREAT impression with our patients! Using your excellent communication skills, you will help greet, direct and schedule patients and visitors. Serve as a liaison between patients and support staff by preparing patient charts before check-in and keeping the office and all records, reports and other correspondence organized. \n • Develop and Grow your Career! Invest in furthering your education through seeking certifications or advanced degrees by taking advantage of our Tuition Reimbursement! This position is eligible for up to $6,000 per year based upon your Full or Part Time status. \n • Join the Team! Like our patients, the Main Line Health Family encompasses a wide range of backgrounds and abilities. Just as each of our patients requires a personalized care plan, each of our employees, physicians, and volunteers, bring distinctive talents to Main Line Health. Regardless of our unique design, we all share a purpose: providing superior service and care. \n • Position-Specific Benefits include: You are eligible for up to 120 hours of paid time off per year. We also offer a number of employee discounts to various activities, services, and vendors... And employee parking is always free! Position: Patient Service Representative Position Responsibilities: • Greets patients and visitors in a prompt, courteous, and helpful manner, determining their needs. • Checks in patients, verifies and updates insurance and demographic information in the medical record and billing system. (Includes HIPPA regulations) • Prepares patient chart prior to the patient’s appointment. • Maintains appointment schedule and follows office scheduling policies and procedures. • Sends confirmation/ instructions/directions to patients promptly. • Answers telephone, screens calls, takes accurate messages and provides information to customers. • Files charts, coordinates lab work, physician’s report, etc. • Files records daily in appropriate section of patient charts and keeps charts in proper order. • Types correspondence as directed. • Sorts and delivers mail, medical records and other correspondence. • Maintains work areas and waiting room in neat and orderly manner. • Attends meetings as required. • Confirms all patient appointments based on the following days schedule. • Maintains patient confidentiality. • Performs other duties as assigned. Shift: Full Time, Day Shift\n\nExperience:\n1. Two to three years of office experience required.\n2. Knowledge of insurance payers and medical terminology preferred.\n3. Must be experienced in Microsoft Word (columns, tables, envelopes, mail merge, labels) Excel (data base maintenance) and Outlook (maintaining calendars of several staff).\n\nEducation:\nHigh School Diploma\n\nLicensures/Certifications:\nN/A"
            },
            {
                "url": "https://www.indeed.com/company/Crossover-Health/jobs/Corporate-Receptionist-54bb6db2ae81c650?fccid=7edbf0a68bac57aa&vjs=3",
                "title": "Corporate Medical Receptionist",
                "company": "Crossover Health",
                "location": "1701 John F. Kennedy Boulevard, Philadelphia, PA 19103",
                "salary": "$20 an hour",
                "description": "Crossover Health is seeking a Patient Care Host for our Philadelphia Comcast Clinic Monday - Friday 8am-5pm 1701 John F Kennedy Blvd Floor 25, Philadelphia, PA About Crossover Health Crossover makes remarkable health possible by bringing people, their doctors, data, and benefits together under one connected system of health. We’ve built an entirely new category of primary care providing one simple place to go for trusted care—in person, online, anytime. We are working with the most innovative employer partners to integrate disconnected health and wellness benefits with tech-enabled services which allows our partners to increase access to care, decrease spending, and deliver an unrivaled experience for employees near and far. Job Responsibilities The Host role is at the forefront of providing an exceptional member service experience. As an important member of our clinic team, the Host assists members with checking in and demonstrates an in-depth knowledge of self-insured employer health insurance, including copays, co-insurance, and related benefits. The Host role facilitates the member’s experience throughout our health center. • Welcomes each member and handles all member interactions with the highest level of hospitality and professionalism. • Demonstrates a commitment to quality, delivering uncompromised service and outcomes. • Accommodates special requests for member support whenever possible and helps to promptly resolve member questions. • Assists with assigned projects and special provider or patient requests. • Assists with the member check-in process, including a basic understanding of benefit eligibility files, check-in technology and overall clinic workflows within the context of care delivery. • Processes transactions required to begin or complete the visit. • Demonstrates an in-depth knowledge of employer-sponsored health insurance, including copays, co-insurance, and related benefit specific requirements, in order to support members. • Engages with members by answering calls, scheduling appointments, responding to emails, and following up with member needs. • Collaborates with providers and staff members to deliver an exceptional seamless patient-centered care experience. • Performs other duties as assigned Required Qualifications • Bachelor’s degree or equivalent experience • 1 year of experience in customer service position Job Type: Full-time Pay: $20.00 per hour Expected hours: 40 per week Benefits: • 401(k) • 401(k) matching • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Healthcare setting: • Clinic • Outpatient Medical specialties: • Primary Care Schedule: • Monday to Friday • No weekends Education: • Bachelor's (Required) Experience: • Customer service: 1 year (Required) • Healthcare: 1 year (Required) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=22dcacb3776a6f28&fccid=dcff5dab0a5948d4&vjs=3",
                "title": "Clinician (Remote)",
                "company": "ENDEAVORS",
                "location": "Philadelphia, PA 19019",
                "salary": "Not Available",
                "description": "***In addition to the salary, Endeavors is prepared to offer you a sign-on bonus of $5,000.00 payable after 45 days of continuous employment. JOB PURPOSE Provides professional therapeutic services to individuals, families, or groups receiving services within the program area. Must have a license for the state of Pennsylvania. ESSENTIAL JOB RESPONSIBILITIES • Conduct intakes, psychosocial assessments, and mental health diagnosis including the clients’ acuity, strengths, and treatment needs. • Develop family-centered and culturally appropriate treatment plans and provides outpatient services to include: providing individual counseling, family counseling/training, and/or group counseling. Use evidence-based practices and trauma- informed practices. • Work cooperatively with members of a larger treatment or service coordination team, either internally within the agency or externally in the larger community. • Develop, facilitate, and effectively present program curricula for classes or groups on human trafficking, substance abuse/mental health, and other topics. • Responsible for clinical documentation, i.e., progress notes, patient assessments, service/treatment plans, and other forms/records as required in a timely manner. Maintain detailed case files and other documentation in 100% compliance with the program standards. • Participate in actively soliciting feedback from program participants through distributing satisfaction surveys or other approved means. • Meet or exceed program productivity expectations on a regular and sustained basis • Other duties as assigned"
            }
        ],
        "metadata": {
            "source": "https://www.indeed.com/jobs?q=Healthcare&l=Philadelphia",
            "timestamp": "2023-11-28T00:54:40.882977"
        }
    },
    {
        "domain": "Business",
        "url": "https://www.indeed.com/jobs?q=Business&l=Philadelphia",
        "data": [
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CzP5X3UIjhqm1h3iihoefmjidu4w2_LPlPWPtgcIQTaZhquSQRj1WAefZWcYAfurI--cZEu1aq4tN1k71MQ3pLJIIrs0uWAjgXs2x9sYz4UC9FO8xuoWuQJ2hj2V_3L2gSWlFvayDRF-jszCmEv0L7QEdLX0Zj3Tjhi7EvfuSqTR1l8DnPxgE0kV2Q5mabmZzJsmTAVVibIFrIdGMkNpyvzzluoauksq5IKkNP7c09JE33tkdjMlSxjbrztZr0sEs3-iwx_lzQeuTfW9Mv2SeKvFSDAIss2HMaFh8dPG_ujcWWH3JpL_7kjjNlNMd3ERHyHgqVKewYok_6DGMp1Rh4H0bqO-OOCqU_1A99BY7S_oAC8eLCGQmKFS4m80KclXB2MjDwVcGz-UG4lv6C0OXps86n457RwME46yhRul_pJoSehr6MQTTQmQjvK8ZgXpfaBeizlal8tqVdC1wCqbwQO27okdzWC75Xb-DjXZRw1yKziQD6i1zTHvL81yt3aexRqkefkaIw9TNbR847RK8kThgUI2X7Rz8F0iCR8ECMmMJOzs1sFC770gbVNPijJ27pWu1ZDNhL6Vxcxt9pUDlFIRIEqmbnFrnvztZ8jyMft81_ww1eD9naEG2NMrds3vR0G4E6OMp1TsjgB3mF2-mskbHfS_zsqH8=&xkcb=SoDp-_M3HKH8RM2eKh0LbzkdCdPP&p=0&fvj=1&vjs=3",
                "title": "Regional Manager, Colleague and Labor Relations",
                "company": "Trinity Health Mid-Atlantic",
                "location": "Newtown Square, PA",
                "salary": "$100,000 - $130,000 a year",
                "description": "Trinity Health Mid-Atlantic is seeking an experienced Regional Manager to join our Colleague and Labor Relations team! This position will support the colleague and labor relations team at four hospitals under the THMA region including Saint Francis Hospital, Mercy Fitzgerald Hospital, Nazareth Hospital and St. Mary Medical Center. The Regional Manager supports the development, implementation and standardization of system-wide colleague and labor relations strategy, policies, processes and programs throughout the Regional Health Ministries (RHM). In partnership with the Regional Director, Colleague and Labor Relations, Colleague and Labor Relations Center of Expertise (COE) leadership, Human Resources Business Partners (HRBPs), and ministry leadership, implements and manages the day-to-day activities supporting colleague and labor relations strategic plans, policies, and procedures to achieve Trinity Health's Strategic Aims to realize a person-centered, mission-focused colleague culture. Locally drives and implements the colleague and labor relations strategy through systemic policy alignment and program management to support key stakeholders to proactively cultivate positive colleague and labor relations throughout the RHM. Works in conjunction with the Regional Director, Colleague and Labor Relations, Colleague and Labor Relations COE and HRBPs, to provide local direction, operational management and integration of long term and short- term colleague and labor relations initiatives. Responsibilities include, but not limited to: • Knows, understands, incorporates, and demonstrates the Trinity Health Mission, Vision, and Values in behaviors, practices, and decisions. • Oversees daily functions of the Colleague and Labor Relations Partners within the region. Provides support to the direct reports through mentoring, coaching, and ongoing feedback regarding professional development and performance quality. • Ensures implementation of the vision for Trinity Health's colleague and labor relations strategy, policies, procedures, and programs ensuring alignment and standardization, where appropriate, throughout the RHM. • Influences, collaborates and innovates in conjunction with Regional Director, Colleague and Labor Relations, local COEs, HRBPs, and RHM leadership teams on a broad range of colleague and labor relations matters, conducting investigations, reporting on colleague and labor relations trends, and managing complex colleague transitions resulting from MD&A activities and organizational redesign. • Provides support in the planning, defining and application of ministry-based colleague and labor relations programs and initiatives, including strategy, policy, and program development in conjunction with the Regional Director, Colleague and Labor Relations and Colleague and Labor Relations COE leadership. • Provides RHM leadership, direction, development, and oversight of the work, priorities, and competencies of the HR ministry service area-based colleague and labor relations field operations teams. • Engages COEs, HRBPs, and RHM leadership and management in the planning and implementation of system-wide colleague and labor relations policies, procedures, and programs to support the operational needs of the organization and Trinity Health's Strategic Aims; provides support in understanding, adopting, and supporting colleague and labor relations strategy, policies, procedures, and programs across the RHM. • Under the direction of the Regional Director, Colleague and Labor Relations provides support in collective bargaining negotiations, and contract interpretation, including planning and assessing performance and compliance. Similarly, provides support in matters pertaining to grievance procedures, mediations, and dispute resolution. • Coordinates the delivery and utilization of RHM communications, tools, and resources to support stakeholder alignment, adoption, and implementation of Trinity Health's national colleague and labor relations strategy. • Provides local dissemination of colleague and labor relations trends and data to monitor and measure the impact of ongoing colleague and labor relations programs and initiatives; uses data to gauge the potential of unionization and/or organizational wide colleague and labor relations issues that may lead to complaints, litigation, and investigations. • Partners with the Regional Director, Colleague and Labor Relations, key stakeholder groups, and RHM leadership to co-develop and manage protocols for addressing diversion, fitness for duty for all colleagues, non-employed physicians and allied health professionals and contract staff. • Maintains a working knowledge of applicable Federal, State and local laws/regulations; the Trinity Health Integrity and Compliance Program and Code of Conduct; as well as other policies and procedures in order to ensure adherence in a manner that reflects honest, ethical and professional behavior. Minimum Qualifications: • Must possess knowledge of state and federal laws, regulations and requirements related to HR, colleague and labor relations, union agreements, collective bargaining, colleague dispute resolution, conducting investigations, and fostering a positive colleague and labor relations environment. • Bachelor's degree in human resources management, Business Administration, Labor and Industrial Relations or a related field with five (5) years of progressive colleague and labor relations experience, including collective bargaining and program development; or an equivalent combination of education and experience. Previous people management or team leadership experience is required. • Previous management experience required in Colleague Relations, preferably in the health care environment. We offer a competitive salary and comprehensive benefits including: • Medical, Dental, & Vision Coverage (Effective First day of Hire) • Retirement Savings Program • Paid Time Off • Tuition Reimbursement • Free Parking • And more! Our Commitment to Diversity and Inclusion Trinity Health is a family of 115,000 colleagues and nearly 26,000 physicians and clinicians across 25 states. Because we serve diverse populations, our colleagues are trained to recognize the cultural beliefs, values, traditions, language preferences, and health practices of the communities that we serve and to apply that knowledge to produce positive health outcomes. We also recognize that each of us has a different way of thinking and perceiving our world and that these differences often lead to innovative solutions. Our dedication to diversity includes a unified workforce (through training and education, recruitment, retention, and development), commitment and accountability, communication, community partnerships, and supplier diversity. Job Type: Full-time Pay: $100,000.00 - $130,000.00 per year Benefits: • 401(k) • 401(k) matching • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • 8 hour shift • Monday to Friday • No weekends Education: • Bachelor's (Required) Experience: • management: 3 years (Required) • colleague and labor relations: 5 years (Required) Willingness to travel: • 50% (Preferred) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A36aFqHU2GOpuFDzR-YZcpjyeStVqmVg2WCdck7Vyralrk2da6aoYdyMSDTdKmwIDcX0URMUkVHr7RORdgRqRH71RsqXBIzyd-DWSOP-zD360IFkXy60BYCRnBRkEMgrQCVdYDoQHru2uCjntGk6RepMdjU9jSbj5tMmc730nqEecZ4A27Ghfuej5Ym_hg_4TGpP-ywXOSOk4kYiEYFWwZiM4QpzmF9zcB-Db-Zd6uMPacNg0GQISlENUogug31Aqmcr6D_Cd9_f-bnOGyy5xLwrY8vMkgelJPaMZtPzB4jO6unKWcMfxyAK14QiVInfKDyK8p0rhPvhKtMWUO0uvuh7D-NcDp2wRP9yMxPddAfBruaVoFV2DNFpJ4BCt4DHLKZNztVXQ9sRjSlXOgp-00ih5I_JNSbZhEXY-1GUufkt7HGZJe7xRhAFHZaP4U2f9RyQ7eslWJ2tcGKWL5kWYXjrFhI2soGGH7LyCe3tBGD8punN7TjUotoYFaGnaWKO35ovW-vwVx_F0iHhcwRJIg_5x5OhSt3KSbPK9Ypd1_Q82yjbbs3rEsg0kiFrp9d96xtWLplzBnSan_Q9IfKl_rE0kR-VoH_dY=&xkcb=SoBd-_M3HKH8RM2eKh0KbzkdCdPP&p=1&fvj=1&vjs=3",
                "title": "Operations Manager/Owner",
                "company": "FW Fleet Clean",
                "location": "Philadelphia, PA",
                "salary": "$91,000 - $120,000 a year",
                "description": "Fleet Clean is a mobile truck washing company with 40+ locations throughout the country. Our locations are a mix of franchise and corporate owned locations. We are seeking individuals that have the entrepreneurial spirit who will not let failure stand in their way. This position is for a candidate for our manage to own program. Manage to Own Program Overview: This program is designed to mentor and train the candidate to become a franchise owner. During the training program the candidate is hired as a corporate employee with a base salary and an option for bonus. Earn $1,200-$1,500 per week salary with options for weekly bonus\nGet trained in the business\nOpportunity to own a franchise \n \n Fleet Clean provides our franchise owners with all of the necessary tools, opportunities and expertise for direct entry into a nationally recognized brand with robust, recession resilient revenue opportunities. At Fleet Clean, you are part of a family that values your local market expertise. About Fleet Clean With more than half a century of expertise in the field, Fleet Clean stands as a formidable leader in the industry. We provide our franchise owners with the solid foundation of a well-established brand, ensuring unwavering support in their entrepreneurial journey. As a name synonymous with trust and quality, we are the preferred choice for businesses nationwide. Specializing in mobile truck washing services, Fleet Clean has a robust presence across the United States, boasting over forty strategically placed locations. Job Type: Full-time Pay: $91,000.00 - $120,000.00 per year Benefits: • 401(k) • Dental insurance • Health insurance • Paid time off • Vision insurance Schedule: • 10 hour shift • Weekends as needed Supplemental pay types: • Bonus opportunities Experience: • First-Line Managers: 1 year (Preferred) License/Certification: • Driver's License (Preferred) Shift availability: • Day Shift (Preferred) • Night Shift (Preferred) Work Location: Multiple locations"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A_wAAiltCI1DjiIXwY4kCEAs65K9PhmOAmbY1VMYlI4kDl_Zb7LGPUoU9ZKLe5hMk9U7jmqbwaB6Hm3lWQUwsW0QR4Vow5APvxXT4DmhFlEL2YYisEuqNRHWWnlsroSnWTbJbwNQ-Cp-Vv2BEUrybY5IhWWjLwYqeNl7Pdwry-XAZWTdx_wdhrcypI_65DzmtypXX3Y8FiQSyHzgeJGboCm4kxUvdEcL7VZqpyl-iOyswf8-at07I1mBQV0hpVevMUYkloYG-gXL6ES7SYpU8WxXQ0g-9Sm3D1Sylp75ponxReHet20Pj5LWVLGIEZdXQLoAFmJB6VEcrzVK2l689gp0I93lvJ8Gezri8W6nBVb3B6RRPnO-l8h-InjXoIiWDHATohjhBZRN6sIHMiuUfm9rHyOMlwfYfWrF0uIp55mWz4ZrA4ElvEa2IDbGlxmIk07FY1EZttXFAuUjOt2TtDpNzVTmZ_ybM3SisNGboAi-bN2Kh6BH0jWdaEZLLib9uJyAvSPsq-ui7CyHE2BWD0e_mrMAOosNF9t8TBFwL5Uhu-2Usp06OKGpEEL8TBJ2iVRsY-HwblCGxKGS4BxMxP&xkcb=SoDA-_M3HKH8RM2eKh0JbzkdCdPP&p=2&fvj=1&vjs=3",
                "title": "Accounting Bookkeeper",
                "company": "Trinity Packaging Supply Company",
                "location": "Location Not Found",
                "salary": "$34.85 - $38.46 an hour",
                "description": "THE COMPANY Trinity Packaging Supply is the first company to leverage proprietary software to connect over 300 distribution and manufacturing centers across North America to provide businesses with packaging’s largest catalog (over 80,000 custom and stock packaging supplies) — offered at low prices with next-day delivery. Since 2010, Trinity has been the wholesale source of pallets and packaging supplies for manufacturers, retailers, and logistics companies across North America. We have a mindset of innovation, harnessing the power of state-of-the-art technology and our growing network of manufacturing and distribution partnerships to change how businesses think about packaging supplies. After sustained hyper-growth, doubling revenue every two years, we are scaling our team and applying our dropship expertise to a new e-commerce platform. Similar to how Airbnb changed hospitality and Uber changed transportation, this will change the packaging industry forever. THE CULTURE At Trinity Packaging Supply, everyone is driven to win and do whatever is necessary to help push the company to new heights. The culture is about rising the tide that will lift all boats and growing the company into something greater. We believe each team member delivers unique value, and together we are a force for positive change in the world. Not only do we save our customers money, but we also have a lot of fun doing it. We walk the talk and have the awards to prove it. THE OPPORTUNITY This is a once-in-a-lifetime opportunity to join a company that is on the verge of disrupting an entire industry and play a key role in that success. As a bonus, Trinity is also one of Inc. Magazine's Best Workplaces in America (three-time winner!). The culture at Trinity Packaging Supply puts the team first which has directly contributed to the company’s growth. Our authenticity and confidence are part of what makes the creative minds behind Trinity continue to innovate, serve, and connect with the real people behind the businesses we serve. RESPONSIBILITES This is a hands-on accounting role, handling all daily accounting and finance responsibilities. This position requires the ability to work on a wide range of financial duties including: accounting, reporting, GAAP, payroll, and internal policies and procedures in order to provide accurate and timely financial statements. • Responsible for managing and reconciling AR & AP • Maintains and reconciles all accounts • Manages cash flow • Reconciles all bank/credit card statements • Comply with local, state, and federal government reporting requirements and tax filings • Processes payroll on a weekly basis • Comply with Generally Accepted Accounting Principles (GAAP) for financial statements. • Analyze financial information and prepare balance sheets. • Ensure compliance with organizational guidelines and procedures, and federal and state • regulations. • Assist in financial and tax audits and general ledger preparation. • Closeout month-end • Responsibilities and tasks outlined in this document are not exhaustive and may change as determined by the needs of the company QUALIFICATIONS & REQUIREMENTS You could be a fit if you have: • Bachelor's degree in Accounting or Business Administration • Minimum 5 years of accounting experience • Sound understanding of accounting and financial reporting principles and practices • Analytical mind with strong conceptual and problem-solving skills • Meticulous attention to detail with superb organizational skills • Ability to work under pressure and meet tight deadlines • Critical thinker with a high proficiency in math • Ability to work independently and as part of a team • Excellent report writing, communication, and IT skills • Advanced competency in Microsoft Office, a working knowledge of NetSuite software would be an advantage • Excellent report writing, communication, and IT skills * WORKING CONDITIONS • Must be able to remain in a stationary position 80% of the time • The position is set in an office setting • Constantly operates a computer BENEFITS & PERKS Trinity Packaging Supply is a four-time winner of Inc. Best Workplaces because we put our team first. It's a \"work hard, play hard\" type of environment. A few of the employee perks that make us award-winning include: • Medical, Dental, Vision Insurance • PTO & Holidays • 401k with employer 3% contribution • GTL life Insurance • Voluntary life insurance • Voluntary STD plan • Gym membership Job Type: Full-time Pay: $34.85 - $38.46 per hour Expected hours: 40 per week Benefits: • 401(k) • 401(k) matching • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Physical setting: • Office Schedule: • 8 hour shift • Monday to Friday Application Question(s): • This position requires being on-site, Monday - Friday. Are you able to commit to this schedule? Education: • Bachelor's (Required) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D9_OZ6lvVYK7TOym690zAs0a2VuR3HPvfc6L2d-MEy1JCx77qWHSrMDamFqZPxZz3MUTuy5nYgK-PGjdyRkMlxL7knF7SCVE49IoJ-7A2GMK9UkeApXcYqfXg75XSks3aCaw-Q-K1sXwNLRuZui8aMvcEFYlxBO4Mgt1AbbSkORnqlYzAh7oJefiuEmjRVbHqMY3buF9Hnmst31Ug9IhXYLc7COj9w4hB9vCnkPjsVMs6Okkw6-frw0GMVBfn8jID1aJBwqt5bMD4tyrMbbDzheuLQxi5XYAk3lCUnr52eKoyipFMjthENCME8jbZRBtRuirVJQo7fhOG5HcSzelmq9xHGwO94qdSxdY9k7ckGnN2VYJnnzslz1ZGuBW4dywhvOOS2Ps0p__oKhMVGwNbgsSv1RXgH-2cVlv0LsxU6ji6xAbU1qi1O2KnNcrEY9h7TUBw8gg8Lu3px8W9aMseCu7YIxuxxj8k44zZiD8Bd-CVt10f-MjPlRZKcIwf9vZhzcAJGRoJzXTAwLUHP63pskkw-k9EysHECniokDlvL5hkqwkYrzbiC4Bjch57KzIkZiR_CzTrJH5_Jsd_x5O3dg0e8mT0ZwF7vccjowRRbVTSyb4vjeHeM&xkcb=SoB0-_M3HKH8RM2eKh0IbzkdCdPP&p=3&fvj=1&vjs=3",
                "title": "Revenue Cycle Data Analytics Manager",
                "company": "Emergency Care Partners",
                "location": "Location Not Found",
                "salary": "$85,000 - $100,000 a year",
                "description": "RCM Data Analytics Manager We are seeking an experienced Data Manager to lead the development and utilization of data systems within the RCM Department. In this role, you will be responsible for identifying efficient methods to organize, store, and analyze data while maintaining strict security and confidentiality measures. An exceptional Data Manager comprehends the intricacies of data management and possesses an understanding of databases and data analysis procedures. You should also possess strong technical acumen and exceptional troubleshooting abilities. Your primary objective will be to ensure the seamless and secure flow of information within and outside the organization, guaranteeing timely access and delivery of data. By implementing effective data management practices, you will contribute to the overall success of our organization. Responsibilities · Maintain Excel and Tableau data models. Create and enforce policies for effective data management. · Manage annual RCM data testing with billers to ensure accuracy. · Devise efficient procedures for ongoing RCM data management. · Support RCM Operators with the delivery of actionable metrics. · Manage visit reconciliation procedures between census, billing and hospital systems. · Manage reconciliation procedures between bank deposits and payment applications. · Develop and manage dashboards that monitor RCM vendor performance. · Interface with Finance/Accounting on revenue, visit and RCM analysis. Requirements: · Excellent understanding of data administration and management functions (collection, analysis, distribution etc.) · Proficient in MS Office · Experience managing data models in Excel · Knowledge of one or more SQL variant, such as MySQL, MSSQL, and PostgreSQL · Familiarity with Tableau and other BI applications · 1-3 years experience in healthcare setting Job Type: Full-time Pay: $85,000.00 - $100,000.00 per year Benefits: • 401(k) 4% Match Experience level: • 3 years Schedule: • 8 hour shift Ability to commute/relocate: • Philadelphia, PA: Reliably commute or planning to relocate before starting work (Required) Application Question(s): • Do you have at least one year of healthcare billing experience? Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BNImrFkCS6fEoeAIJ8pgClasKGlizxBU5PgqLRU-hQV5YRZ9EwqHXbE4TAN1Ce4DrMsaCrBtqL5PQerr7C6cuQsBn4DdHMQtNTtfZt9J8bF95qri6iaUVSP1TJnKCZ44ECIKa445Ql9CWhxjsUiS9VX6ngbEPeLFPXeMGE9srDISxPNj498JIZrygp-C3vGkPro6DmesogeRYp0i5_ya0w_l4iC5H51RSFs7LZ9VQK1ARS1Fo5wa0K1gnnpfJTYcEQbqwzfm2gOcpLFPbI2mAZqB9zG0XHi2UFkaLJldXLr33fN0na7fy1nurypG1bJ73PSHtGNUFF1aC6t4qpnHUNE7l6BQZKdPwV0W8Id_ieTldn-6_rwlPseoUpknz23GV15YGur0xLrMAD_OnuK77bYLVz5UQVXQjBJT7GY8mtqR6A38yfBNIHv5Oh06b9x6p2pR717h0TYqsoyw6AyB5Iyv0yXpRJkgHDZRXjwSomdoF7Fb11iwTscKpzzZRJV5GRS1xPEaHPaK61CO56ALxSMtM_9Khk1avhkBi0WzPOLkQ-anP9PE_vubDxZLJVxDd9QR9AEDt3-PpOGPwaYISk&xkcb=SoD6-_M3HKH8RM2eKh0PbzkdCdPP&p=4&fvj=1&vjs=3",
                "title": "Social Media Specialist",
                "company": "Dreamline",
                "location": "Location Not Found",
                "salary": "$40,000 - $42,000 a year",
                "description": "The Social Media Specialist will manage multiple channels within America Bath Group, such as, DreamLine, ASD, Maax, etc. including Facebook, Instagram, Pinterest, Twitter, LinkedIn, Google Plus/Business, Amazon, SNAP, Tik Tok, and any others that may arise. This includes coordinating posts, promotions, and editorial calendars. This position is also responsible for creating content and responding to all customers through these channels. Using deep analytics, the Social Media Specialist will provide recommendations on content type, targeting, and budgets. The position will also help across the Marketing departments as needed and provide key support and assistance to Marketing Managers to ensure that marketing projects are delivered on time and on budget. This position will effectively manage, coordinates, and tracks the flow of technical writing and creative projects. Additionally, this position acts as a primary liaison with internal departments to relay information, assist in the development of written communications, and make marketing and sales collateral and tools readily available. Essential Duties & Responsibilities: • Social Media Management for DreamLine Shower doors, Arizona Shower doors, and other American Bath group social media channels. • Manages Instagram and Pinterest special promotions, coordinated from a weekly analytics report. • Marketing rollout for NPD: Social Media product launch and Facebook campaign product specific banner publishing. • Creates SEO Keywords for new DreamLine products. • Manages the creation/updates for DreamLine Product Technical Drawings. • Research social media trends to enhance our Creative “Mood Board” for our DreamLine room scene creations/requests. • Social Media Influencer manager: Research and manage all influencer partnerships. • Conducts weekly Social Media strategy meetings to help social media improvements/ grow out social presence. • Works with Customer Service and engages all customers and comments in social media. • Manages social media Calendar for DreamLine daily social posts. Gather images from customers and work with our copy writer on copy for posting twice a day on Facebook, Instagram, Pinterest, and Google. • Manages and build out Facebook Shop Campaigns for DreamLineShowers.com and The Home Depot. • Continuously manage and edit Facebook vendor campaigns for DreamLine, The Home Depot, Lowe’s, Build.com, Wayfair, Overstock, Amazon.com, Custom Glass, Arizona Shower Doors, West Coast specific campaigns. • Manages social media specific videos within Facebook ads manager. • Works with creative to create DreamLine specific videos for Instagram, Pinterest, Facebook, and Twitter. • Observes and updates monthly social media budget to stay on track for DreamLine monthly budget on Facebook, Instagram and Pinterest. Create specific spend on boosted posts for the month on each specific platform. • Receives direction from and directly interfaces with multiple in-house clients/stakeholders to effectively coordinate and “traffic” the flow of projects in and out of the organization’s marketing systems. • Collaborates with vendors (including internal and external design, creative and web resources) to coordinate projects and deliver marketing communications that meet timelines and quality standards. • Quickly intakes information to become well versed in the organization’s products, process and services. Utilizes this expertise to successfully assess, decipher and deliver clear messages and communications to internal and external audiences. • Leads continuous improvement projects for the marketing communication and implementation process to maximize efficiency for the marketing team. • Collaborates with program managers to identify business and workflow requirements for optimizing marketing support tools and systems. • Provides signage inputs for store-specific launch guides. • Additional duties as assigned. Qualifications: • Bachelor's degree in business, marketing or a related field required. • Must be comfortable with social, new and changing technology in the digital marketing space. • 2 or more years’ experience with social platforms such as Facebook, Pinterest, Instagram, etc. • Creative thinker and desire to engage and please customers. • Ability to effectively manage, coordinate and track the flow of technical writing and creative projects as described as normally obtained through 2 years’ experience in a project management capacity or traffic position at a creative or advertising agency or a similar role in a corporate marketing department. • Experience working for a fast-paced /service-driven company preferred. • The ability to write marketing communications that are technically accurate and conform to the Company's branding image and writing style guidelines is essential. This entails excellent verbal communication, writing and proofing skills. • High degree of organizational skills and collaborative skills to effectively manage, coordinate and track the flow of technical writing and creative projects as described. • Excellent project management skills, a keen sense of urgency, a strong orientation to detail as well as a high commitment to customer service are required. • Demonstrated skills in project tracking and management of writing technical and creative projects are required. • Advanced proficiency in using Microsoft Excel and Word. Strong skills in PowerPoint. • Excellent time management skills and ability to multi-task and prioritize work. • Exceptional communication, organization, and time management skills. • Collaborative in driving decisions and a team-player. • Strong organizational and planning skills. • Ability to adapt to changing requirements. Closing Statement: This brief summary is not an all-inclusive description of job duties. Other job duties and responsibilities may also be assigned by the incumbent’s Manager at any time based upon need. DreamLine is a proud Equal Opportunity employer, m/f/d/v. Job Type: Full-time Pay: $40,000.00 - $42,000.00 per year Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Employee discount • Flexible schedule • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • Monday to Friday Supplemental pay types: • Bonus opportunities Work Location: Hybrid remote in Warminster, PA 18974"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A9MdQ2B_0aOOP6HmPM1FhIqLuDKBE0b0VSfZPsapCG32cRPx8H-c4BdSCljexnQfZMXL7FYove6KsF8aAxdpQtUy18w7-W8Qg2_5GWMtnfTwDuWI6zt7Y8yVqOUWH9hZBVs1jzlXZSnkuyaou0YT1qaNNybKamkxY33gA5BfjJ_oqDKMa4Z7I632uxS94G4JCtd2RM-PtZvPD1HSZRsj0TRI_w7Z4mjneNp93-oHHvHq_RaQe1Mn9M1L_Mpbhnm55mB97mVxY-1IQZh2INJjPMfc8VekBxso-QEEQMZHlvUpOTZ-Ib83dUSO_iNGkxqHVP7NUT9KW8COsZM07TppbABVakMz7nY2ynLM-P2SH8DZclUBkGaEpcLW8P0cOlZ-kLaJXpY4wguaJD740CiLpMvj_DD_4IdBYOx3PnjU_gJUA_EYCP0vdVkmhC9EeI15Unzc6WRsBb0lRW6Z1Ii1g6GObQLVbnMvYgJcabOsxOfNeGJ72bKFD39ofUL6ifjOg56CnbwxvH59d4JIdlE4coYlhHTvKrNv5-WXPKN6WhAa_8-Bdinl8eTVf1zqXDEqpCC_Nyg3IoplGotRWkrED4xosFLL0r5Ew=&xkcb=SoBO-_M3HKH8RM2eKh0ObzkdCdPP&p=5&fvj=1&vjs=3",
                "title": "Business Development Assistant",
                "company": "The Candor Agency",
                "location": "Location Not Found",
                "salary": "$50,000 - $70,000 a year",
                "description": "Business Development Assistants Wanted! This is a brand new position in the Philadelphia and South Jersey area. Interviews are being conducted over the next week via Zoom and the hiring process takes roughly one week. Responsibilities Include: Business Development with C-Level Executives Business to Business Marketing Presentations Sales Consultations with small to medium sized business' Training and development of new associates Zoom meetings and virtual demonstrations as needed Other responsibilities could be added as someone grows in the role. Qualifications: 2 or 4 year degree in business, sales, marketing or any other related field Communication, time management and leadership skills Work Ethic and Personality Ambition and drive to succeed We have found that the right fit for this position is someone that has clear goals for their future, is a team player and loves learning in the business arena. Entrepreneurship and vision are qualities that we appreciate as well. This client is a new firm that focuses on business development and business consulting. Candidates are responsible for having a professional demeanor when talking to C-Level Executives, business management, business development and growth for the company. It's vital to this companies success that the person that works in this role is able to have common sense and make wise and prudent business decisions. They are only looking to add a few new members to their business team and they want to ensure that the candidate is the right fit prior to hiring. Please submit your resume today and a member of our HR team will reach out to you to schedule an interview or a phone call to get to know you better. Job Type: Full-time Pay: $50,000.00 - $70,000.00 per year Benefits: • Employee discount • Health insurance • Paid time off • Parental leave Schedule: • 8 hour shift • Day shift • Monday to Friday Supplemental pay types: • Bonus opportunities • Signing bonus Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DkTAbqbqL57Zx5xEndvQHaCf5hsY9_xWA_cy5IoLfAql503lmKwjM1hGH3CwGSxUxSRVh29kCJxbnSmVYVgrf79FYm8SC-HxqxOPtMw2Nzbt2SphUT4HX_m5xYwXwNwUZqBYrUfNwurPlP_t8C0fsF6x2ux3olgvfn_VvKY7qD4BF9_4G8sk_Gn1YM-hHg0zzXV1iDlyi1aysknWMzmvP3s0S2cGEW3vh9yvHLjVKLGD2oiq-XqUrNfU7uD7NaChIeWyxAcWlPqT_GEFd6NDYRt5pTtzmIkMbhydNcMcBZIfjXx95yhDEK7GOYDugKGfjpDSyX3fViy4YtXkB3Z-Vsqkcjk4T1w9yxvYuPFLXXeXrCAikxnqP0Jdd5VDL9kX-HWJIvHPP0v14590_-k9HXMjyld6nsiC6gaXOEumEMaKkYyye944loEE-0TfMJZk92_3H5LGUJrL_1g7ngPhO2rbSRSmZ3Vr0aiH1LJqAihf_WgLGSRysbzcPcrI0VOdAoZ2u9FUSWfkcuKgiLhzKEpkI0v2wk3kziNvl3OzkRUvQkaVB8vjn6dRcHTYnOyrGN95l2MSGSZrhHrMiThWHeJ7aES-nXM4fBVsuiyMA3Jw==&xkcb=SoDT-_M3HKH8RM2eKh0NbzkdCdPP&p=6&fvj=1&vjs=3",
                "title": "Business Development Associate",
                "company": "Jayce Grayye Consulting",
                "location": "Location Not Found",
                "salary": "$70,000 - $100,000 a year",
                "description": "Jayce Grayye Consulting is seeking a Business Development Associate for one of our clients! They are a leading provider of high-speed, reliable, and cutting-edge Internet connectivity services for businesses, residents, and events. Our client is expanding its footprint from New Jersey, NYC, and Miami to the vibrant Philadelphia market. As a Business Development Associate, you'll be at the forefront of our client's expansion, making a significant impact. Your mission? Engage with building owners, property managers, and real estate developers to drive the integration of building-wide Internet services into new and existing properties across the Philadelphia area. Your dynamic approach and strategic thinking will play a pivotal role in this endeavor. If you're driven by results, possess a fervor for business development, and have a fascination with cutting-edge connectivity solutions, we invite you to apply for the Business Development Associate position. This is your opportunity to shape the landscape of connectivity in the Philadelphia area and be a part of this transformative journey. Structure & Compensation • Full-Time Opportunity • W2 Position with Benefits • $60,000/yr base + commission • On Target Earnings 1st Year $90,000 - $100,000/yr+ • Schedule: Monday - Friday (9am - 5pm) Responsibilities • Responsible for identifying and engaging building owners, property managers, and real estate developers in order to support the expansion of the building-wide Internet service into new constructions and existing residential properties; • Strategic outreach through emails, phone calls,in-person meetings, and city exploration; • Establish and nurture productive, professional relationships with key client’s personnel; • Ability to build, educate, and nurture business relationships with high-level real estate executives to achieve success; • Ability to clearly articulate the differentiation of our client’s service from the traditional residential Internet service providers; • Generate and manage a healthy pipeline of sales opportunities and exceed sales targets; Position Requirements and Skills • At least 1-3 years’ experience in prospecting and closing deals; • Not afraid of rejection and able to work with the client’s executive team; • The ability to work well in an entrepreneurial environment and \"wear multiple\" hats when necessary; • Proven Sales Experience: A track record of success in sales or business development roles, ideally within the telecommunications, technology, or related industries; • Local Market Knowledge: Familiarity with the Philadelphia market, including an understanding of residential real estate trends and key players in the industry; • Relationship Building: Exceptional ability to establish and nurture professional relationships with property managers, real estate developers, and homeowners; • Communication Skills: Strong verbal and written communication skills, enabling effective presentations and negotiations with clients; • Goal-Oriented: Results-driven mindset with the determination to meet and exceed sales targets; • Self-Motivation: Ability to work independently and as part of a collaborative team, demonstrating self-initiative and resourcefulness; • Adaptability: Comfort in a fast-paced environment, with the flexibility to adjust strategies based on market dynamics; • Passion and Enthusiasm: An inherent drive to contribute to the expansion of client's services in the Philadelphia market and a genuine passion for the world of business development and technology; • Patience: Ability to maintain composure and patience, especially during complex negotiations and relationship-building efforts; • Having a car is a necessary; If you embody these qualities and are eager to play a vital role in shaping the future of Internet connectivity in Philadelphia, we encourage you to apply for the Business Development Associate position. Join us in driving growth and innovation while becoming an integral part of the transformative journey. Benefits • W2 Position • Medical Insurance • 401(k) • Competitive base pay + commission • Vacation and PTO • First-class training Job Type USD, Business Development Associate, Sales, Internet Connectivity Service Provider, Base + Commission, Benefits, Philadelphia. Job Type: Full-time Pay: $70,000.00 - $100,000.00 per year Benefits: • 401(k) • Dental insurance • Health insurance • Paid time off Schedule: • 8 hour shift Ability to commute/relocate: • Philadelphia, PA: Reliably commute or planning to relocate before starting work (Required) Experience: • Business development: 1 year (Preferred) • Sales: 1 year (Preferred) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BZq6Z5GbZp_ki3w8MOxsstE_vSWM3OtvHYTZ_lFPx6-7wBycDVukc73nxbLmRpjFhaTT7z0vJ6t5psXN1b8yOuflp1gYmDzbs0-9jQWoR-IhUrvucEiqWV5oWjpNHbjCmRipUns2ZQHidksqepObk4HtBQYW05-EWEqCv-C4lqlQjjpzjJEedlWL8r_OI3XdyaKTUs95BOs0AVGGzmT4XkRxOrbtrW0HL5Jtowt7WRzoEZ82nh75JX1sFK-Y4F5ioXxbN5xqxBgDbwucPu6ZTFIRwMN6cWGuAkKzIZYrw7CFwLCyDsMcQ35SZtzUkfhhkIvawIy57_INuaSqvu3l-PSI0UUvzDfqW2jXNjyPpsduBKjaCWnBMpBskM6BsywH6K4dcpGekB1992A40SEnqnVWu--4iqH7db7yY3uxkqvgEN1m1tWIxrJHjvKnm2HEL-ECUYx7V0wFfr8v89gw1c9nx9DyROlBOqNx7P-TbBYRAJlOixcFLKewDu-A_g8wp_Taz89oFKLHAuEhJO0XRbfJSaTWsopl_5YTY72XV9JjPcQVCdGAGW0oD9GVvvkCEfo0vj0bgJjMk4Rq1WOh-qdtlc5epo6Xvduio07ejZZfarPN0AsWwfl7tracyUinE=&xkcb=SoBn-_M3HKH8RM2eKh0MbzkdCdPP&p=7&fvj=1&vjs=3",
                "title": "Entry Level Marketing and Sales Representative",
                "company": "CTM Marketing",
                "location": "King of Prussia, PA",
                "salary": "$48,750 - $62,800 a year",
                "description": "MARKETING AND SALES ASSISTANT Entry Level *Note: This position is NOT remote. ABOUT US: Working at CTM Marketing is an exciting, outgoing, and people oriented work environment! Our culture and community consists of talented team members who are ambitious, positive, knowledgeable, and determined, to not only assist our company, but also to succeed themselves. WHAT SETS US APART: • Fast track career growth • Environment fostering collaborative efforts • Personal and professional coaching by the industry leaders • Leadership development Our company seeks candidates with an entrepreneurial mind-set who are looking to start with a company and grow into an leadership role with our team. We find individuals who have a drive, determination, and the ability to excel in problem solving situations. On a daily basis our team handles marketing campaign strategy creation, brand building and awareness, customer acquisition, and account management. Currently, we are hiring for full-time positions. REQUIREMENTS: • 1-5 years of restaurant, retail, sales, or hospitality experience recommended • 2 or 4 year degree in Business, Marketing, Politics, Media, Communication, History, or English (preferred but not required) • 1-2 prior internships in Media, SEO, Business, Marketing, Sales, or Customer Relations (not required) QUALIFICATIONS: • Customer Service experience • Career growth mindset • Willingness to train and develop others • HS Diploma or Equivalent • College Degree preferred but not required WHAT YOU WILL LEARN: • How our dynamic team creates business solutions unmatched by competitors. • How Sales & Marketing impacts local and national markets. • Working with your peers to create a progressive, more successful company culture. • Developing & Managing a relationship with a client. • Business to consumer client acquisitions. • Management training. Our marketing and sales firm is the leader in the industry, as we deliver quality customer service experiences for our clients. Our clients are Fortune 100 companies that want us to deliver a face to face customer service experience. We do this by taking care of the existing customer base and providing personal care with new customers. Representing one of the largest telecommunications companies in the US, it is a priority for our team to provide the best customer service and professionalism we can, by building and maintaining quality customer relationships. If you feel like you have any of the above characteristics, we would love for you to join our team! You can submit your resume by clicking APPLY NOW! Check out our website to learn more about our company!! Job Type: Full-time Pay: $48,750.00 - $62,800.00 per year Benefits: • Employee discount • Health insurance • Paid time off Schedule: • 8 hour shift • Day shift Supplemental pay types: • Bonus opportunities Experience: • Marketing: 1 year (Preferred) License/Certification: • Driver's License (Preferred) Willingness to travel: • 25% (Preferred) Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AD-4xtc2p1PErP1FrqbdLAnCVBT0xXsZJP4tSI4P9Hd-sq9dPybwN-m_mmVYoVX2sAY0LhMCPnp38RvIhk8Nv130F8nE0GduN1y5mnj8NiEYvRXpuyI53-7hclRfihipl6xAr1xoWDlCX083yCaSWothItMWdZUyYhgkrmhfAZCNzanyXQY5314vpFvP9dXMV3FyYUC9x1eZEORl_1znsxbq08k0svDl0nRaYZ1ocX-xRO7vGqX5YWhEXToEndPO3XY5TR4EkCij_ASJJ_0QG__KSlXtKa7iBhJX-v-DdRDe5y6LsWWyaAPalCEmlyuNiO9o23sTotWcqVyi8fzKfvEKyoucgN4KrN_TlOsV4Gd2STaGXFCbHxUNgTjlLQUrdnk3AyCokzVKBwXPYdOTG453495IMTnKMGdIKjdW9bcZy4sDA87o7-3pyiSqYHg5UKPwFjyKpQj_yVD91Y5EKmWu33R7Ik754XtjpxYvh4RfU2-Iq4M1sKW4MLaoK1GoUNEivQw2LnbqMj3PwOWnnGo86K6oy-siwQHBxoitf2pruq5gwXKhBIJUDZjK2eoxY=&xkcb=SoCO-_M3HKH8RM2eKh0DbzkdCdPP&p=8&fvj=1&vjs=3",
                "title": "Store Employee",
                "company": "Greater Way Marketing",
                "location": "Willow Grove, PA",
                "salary": "$17 - $21 an hour",
                "description": "Are you ready to embark on a career where your contributions truly matter? We are seeking dynamic, motivated, and trainable individuals eager to enter the world of sales. As a Retail Store Employee, you’ll initiate contact with potential clients, uncovering sales prospects through proactive efforts. To thrive in this role, you should be ambitious, goal-oriented, and geared for success in all aspects of life. At Greater Way Marketing, we've discovered that a perfect cultural fit leads to a fantastic, enduring work partnership. Our aim is to make this your most rewarding job opportunity ever! Greater Way Marketing is a top performing marketing and sales company working directly with some of the largest companies in the world representing their brand directly to the consumer. We work to acquire new customers while retaining the existing ones to increase overall revenue across the board. Role responsibilities: • Greet and direct customers • Provide accurate product feature and pricing information • Give knowledgeable answers to customers questions • Conduct price and feature comparisons to facilitate purchasing • Inform customers of discounts and special offers • Coordinate with team to provide exceptional customer service • Meet minimum weekly, monthly, & annual productivity and sales goals • Working closely with management and contributing innovative concepts to enhance sales What we are looking for: • Reliability • Previous work experience in customer service role preferred • Understanding of team work • Excellent communication skills capable of building trusting relationships • Ability to perform in fast paced environments • Schedule flexibility • 18+ required for position • BS in Business or related field a plus What’s in it for you: • Hourly base pay + commission • Paid sales & leadership training • Performance recognition • Diverse business casual team • Group building activities and outings • Exciting incentives • Team orientated environment • Networking conferences and events • Opportunity for career advancement If you think you are the right fit for this position please apply with your resume and/or cover letter for immediate consideration! Job Type: Full-time Pay: $17.00 - $21.00 per hour Benefits: • Dental insurance • Employee discount • Flexible schedule • Health insurance Shift: • 8 hour shift • Day shift Weekly day range: • Monday to Friday • Weekends as needed Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/company/Weber-Gallagher-Simpson-Stapleton-Fires-&-Newby-LLP/jobs/Intake-Specialist-26dd792682e47f4a?fccid=834924b3935cdf0d&vjs=3",
                "title": "New Business Intake Specialist",
                "company": "Weber Gallagher",
                "location": "Location Not Found",
                "salary": "$19 - $31 an hour",
                "description": "Weber Gallagher is a regional law firm, with more than 110 lawyers in ten regional offices.  We provide legal counseling and representation in the Mid-Atlantic and Midwest regions of the United States to local, national and international businesses, financial institutions and insurance companies. We represent businesses, employers and individuals in multiple areas of law. Weber Gallagher has an immediate opening for a New Business Intake Specialist to assist with the processes and procedures for the onboarding of new clients and the identification of potential conflicts of interest. Responsibilities: • Run conflicts and make sure the appropriate waivers/clearances and approvals are received. • Processing new business intake forms to open new matters through Aderant Expert (keeping to a 24 turnaround) • Work with staff to ensure that information is appropriate to formally open all new matters. • Send engagement letters to Billing to create rate codes for new billing clients, when needed. • Determine attorney origination credits and update the master spreadsheet with new credit splits and update the information in Entity Manager in Expert • Apply proper billing rates to each matter, adding the bill cycle. • Quality control of matter data ensuring completeness for every new file • Re-open files as necessary which includes re-running conflicts and a check of matter parties, billing contact, rates, and originations. • Close designated matters upon receipt of emails from staff and update bill cycle to final for billing. • Make record changes to files such as adjusters, addresses, offices, billing attorneys, clients, bill cycles, etc. • Manage the Conflict inbox and Records inbox - making sure requests are organized and completed in a timely manner. • Maintain and update conflict database with current information received regarding clients and their affiliate relationships. Qualifications: • Minimum of two (2) years of prior New Business Intake experience in a law firm setting • Experience with Aderant Expert and conflicts database software • Strong knowledge of conflicts of interest and new business intake principles • Ability to work independently in a high-volume practice and take initiative • Strong multitasker, ability to juggle multiple projects simultaneously Weber Gallagher offers a friendly office environment, excellent benefits package, including 401(k) and medical. Please visit our website: www.wglaw.com. Equal employment opportunity is provided to all employees and applicants for employment without regard to a person’s race, color, religion, age, gender, sex, sexual orientation, gender identity, pregnancy, ancestry, physical handicap, disability, national origin, genetic information, marital status, veteran status, disability, or any other factor/ status in accordance with applicable federal, state and local laws. Job Type: Full-time Pay: $19.00 - $31.00 per hour Expected hours: 35 per week Benefits: • 401(k) • 401(k) matching • Dental insurance • Disability insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Retirement plan • Vision insurance Schedule: • Day shift • Monday to Friday Travel requirement: • No travel Application Question(s): • How many years of experience do you have with the new business intake process? • How many years of experience do you have with the conflict clearance process? Experience: • Law office: 2 years (Required) Work Location: Hybrid remote in Philadelphia, PA 19103"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=245fe0f3cc275394&fccid=7821a2e77aac6277&vjs=3",
                "title": "Business Analyst",
                "company": "Exelon Corporation",
                "location": "2301 Market Street, Philadelphia, PA 19103",
                "salary": "Not Available",
                "description": "Description \n \n \n \n \n \n \n \n \n \n Perform general analysis and prepare reports to support business operations. Conduct modeling, forecasting, trending, variance analysis, business case development, and other general financial and operational analysis. Monitor and coordinate activities to support operational performance management (e.g., safety, reliability, service level, productivity, etc.). Research and provide statistical financial and operational information. Track, maintain, analyze and provide current information on the operation's business scorecard or key performance indicators (KPIs). Develop and organize performance reports for both internal and external use. Contribute to the development of shortterm and long-range business planning. Provide analytical and operational support to the business unit. Position may be required to work extended hours for coverage during storms or other energy delivery emergencies. \n \n • Support and contribute to the development of short-term and long-range business planning. Conduct modeling, forecasting, trending, variance analysis, business case development, and other financial and operational analysis (e.g., operational effectiveness, budget, resource, workload, workforce and capacity utilization, competitor, etc.). • Provide statistical information to ensure the most effective utilization of personnel, equipment and/or materials for business operations. • Monitor and coordinate activities to support operational performance management (e.g., safety, reliability, service level, productivity, etc.). • Track, maintain, analyze and provide current information on the operation's business scorecard or key performance indicators (KPIs). • Perform analysis of the operation's cost elements to ensure effective and efficient operations. • Prepare and analyze detailed standard and non-standard reports. • Develop, organize and present detailed performance reports for both internal and external use. • Provide analytical and operational support to the business unit. \n • This is an individual contributor position that works under general supervision and frequently performs non-routine work. This position is expected to resolve most questions and problems through interaction with internal and/or external stakeholders, executives, directors, managers, and staff across the organization, and refers only the most complex issues to higher levels. On occasion, may mentor less experienced colleagues. • May require working extended hours and/or shift work to support business operations. Qualifications MINIMUM QUALIFICATIONS • Bachelor's degree in Business or Engineering AND 2 - 4 years related business experience, or in lieu of Bachelor's degree, a minimum of 3 - 6 years relevant business experience is required. • General understanding of applicable standards, methods, processes and practices, business fundamentals, and performance metrics in the specific functional area supported by this position (e.g., asset management, electric or gas operations, customer service, transmission and substation, distribution system operations, regulatory and external affairs, transmission operations and planning). • General proficiency in standard software applications (e.g., Microsoft Word, Excel, Access, PowerPoint, Project), specialized business technologies and applications (e.g., workforce management, project management, PassPort, Brio, CIS, EPS, Business Objects, SAP planning, business modeling, forecasting, voice response unit, automatic call distributors, work management, outage management) to retrieve and analyze data in support of business needs. • Ability to provide general analysis and apply managerial accounting concepts, customer intelligence gathering, forecasting, staff planning, scheduling, analytical and statistical problem solving, financial, accounting, business and budget analysis. General analytical skills for project evaluation including analysis of projects with economic, financial, risk and decision analysis. • General analytical skills for project evaluation including analysis of projects with economic, financial, risk and decision analysis. Experience in business case development and ability to effectively present business cases to business unit leadership. • Customer driven with good oral and written communications skills and general analytical, problem solving and project management skills. • General knowledge of the practices, procedures and principles of performance analysis (trending, root cause and gap analysis) benchmarking and audit compliance. Ability to analyze organizational data and problems, interpret and recommend alternative courses of action, and implement intervention strategies to attain performance targets. PREFERRED QUALIFICATIONS \n • Experience in the practices, procedures and principles of performance analysis (trending, root cause and gap analysis) benchmarking and audit compliance. Ability to analyze organizational data and problems, interpret and recommend alternative courses of action, and implement intervention strategies to attain performance targets. • Responsible for the prioritization, scheduling, and coordination of project task and project resources • Proficiency in standard software applications (e.g., Microsoft Word, Excel, Access, PowerPoint, Project), specialized business technologies and applications (e.g., , project management, WPT, Asset Suite 8, , CIS, EPS, , forecasting, ) to retrieve and analyze data in support of business needs • Strong organizational, interpersonal and verbal and written communication skills • Ability to adapt to new or changing conditions"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B3llpZ45E7x7Y--KtHC5xwy9wrfgNqEHcvCC96CU0B0mvtGNoALd1zGvYqCa7J0UkMeiOVvDnDaHm7ULgdWVzSj0O0DhZl2h0jNEZRmT4KX99dXeKuz-iKYzxmlvD7GusHUh9cK_DK8bNdBHrNkNg5dYVjZ0vpA83OpvYZaoIBOHIQGVufUuT07-11sLG7fK9GFeWs2z61HgryUNmoekLH9tR5HGOECRna5lAOErSo_-ZBdN9MzkubOsdJmJSwtp5EchG80rcgwTS87uAp_8HV5Ei3oJ7iC-vld-Ww9QHfBRQiq8zCYr_tJTQZ6P8WqkFbcYgIuv4PpxpAVgNmvcNQEe7uglv4_4kEJPaund6a-4SpiFD9u6UVaGiSKJXwzo5KjmPNusxaRSLfJjk68uENA38wx2JuuVGF1zaAkb96ouXGr_HSon7B5EzVwyzlrBDcAYOuP7mBs6unJui6ZTce8gjd0kiBZcUBLl67J5dNLo11UDnmUuvH-c8CtBHlu-DdU7b3HNVNj5YlshJhDszB1ujkqo_3v_SRt3PJNytgkYFvgP_yk2eveLgeOsTURAot3QWSj7qi-c1ZlwBPSu4_qWOfOr8UjUiXXHdwTGlqpyDAdC22iBeUghBGO_e_XNwyPrWABhiJqD4RbLAWUCeXPbm-tCQCa_Fd7VN1c76yJNwVeD8DXqsLm4ZmWG65bL7Xrb--YtvNyZfXs243fXPlg473KblC_cINwlyKlmhJXcok03qLKK60K7W1rWLwX7xvTDW5-gJO1TheS8OWAta7-IW6iT36cSmOWNKqzufsa-N4WrjCu0VktRNJrIfOnTaN3Nu1XbIXseaIGij5OaHs&xkcb=SoAT-_M3HKH8RM2eKh0AbzkdCdPP&p=11&fvj=0&vjs=3",
                "title": "Reentry Workforce Connector",
                "company": "EDSI Solutions",
                "location": "1617 John F Kennedy Blvd 2nd FL, Philadelphia, PA 19103",
                "salary": "$47,000 a year",
                "description": "• Deliver PA CareerLink® Philadelphia information to various community locations, physical and virtual events, job fairs, and panels, particularly those with a focus on supporting the population impacted by the criminal justice system (ie, customers returning from local, state or federal correctional institutions, probation/parole half-way houses, house arrests, or those beyond sentence). • Engage actively in the city’s re-entry coalition and work in close partnership with the Office of Re-Entry Partnership on service improvements for those with criminal histories. • The Re-entry Employment Connector supports program participants in the successful transition of pre-employment services received in the Prison and Jail to services received at the PA CareerLink® Philadelphia site upon release from prison and jail. • Provide basic career services, WIOA intensive case management services, and job matching services to a targeted caseload of jobseekers within the assigned community \n • Provide job search assistance for participants in cohort-based groups, and/or 1:1 meetings, including: preparation of resumes, cover letter, applications and preparing for interviews • Motivate, encourage, and coach reentry participants in advancing employment, training and retention goals, and provides support in resolving issues that may impede successful job placement • Assess each individual’s needs to determine basic service needs and career readiness • Determine eligibility, enrollment and offering of WIOA intensive services, including and not limited to vocational training enrollments, On-The-Job Training referrals, and supportive services. • Serve as liaison among the Bureau of Community Corrections, Philadelphia Department of Prisons, Adult Probation and Parole, and PA CareerLink® Philadelphia • Work with correctional leadership, and probation and parole staff to inform, educate, and recruit eligible inmates/ reentry customers into PA CareerLink® Services. • Refer participants to employer events, workshops and various services being offered at PA CareerLink® Philadelphia locations • Deliver workshops on a regular basis to engage customers and prepare them with the skills they need to find jobs • Work directly with reentry participants, Philadelphia Prisons and Jails, and PA CareerLink® Philadelphia to seamlessly transition between Prison/Jail system and PA CareerLink® Philadelphia ensuring consistent training and employment follow up service delivery • Regular intake and case management appointments facilitated across all PA CareerLink® Philadelphia locations to provide customer centric case management to support employment opportunities upon release • Support the use of virtual tools, including virtual workshops, PA CareerLink Online, and PHL Career Portal. • Utilize Goal4It! Methodologies in customer interactions \n • Increase awareness for which convictions create limitations within specific industries, and which career pathways are feasible with certain criminal backgrounds • Maintain organized database of all clients served, including information on criminal history, year of conviction, and other information relevant to understanding trends of who receives re-entry services in PA CareerLink® Philadelphia’s system • Responsible for data tracking of every service provided and utilization of the state system of record, CWDS, as well as the team-wide reporting platform. Data capture is a daily responsibility. • Implement project management skills, tools, and methods • Demonstrate fluid approach to work and actively be part of continuous improvement \n • Any certifications in providing re-entry services in a workforce setting preferred • Must have 2-3 years of experience servicing the re-entry population • Must be highly familiar with local, state, and federal laws and policies around returning citizens, including rights and employment law. • Must have experience in team-oriented environment • Ability to prioritize tasks, document visits and contacts • Model positive and professional behavior • Use language reflective of a commitment to diversity; demonstrate cultural competence • Bachelor's Degree in business, education, human resources, liberal arts or related area is preferred • Proficient in Microsoft Office Suite • Must be comfortable with local travel and have access to reliable transportation"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CgSHFaRv44kRmLJ9IxxQKmHGWHymaSeMmKgzomBQ-Ttjy3-gvynXfoBYvU5O1LU-8Q-LMcdIKO6qJLct6rBnA5rSsgUY--aMKQytqk59wYPojdq3stTepeB3I2E-PdTnep7aJ5s1hrWExq0P3_xGDvPniEV2Ufhpict1Xa6s4rPWI9xRzq6pl9V-Lg2ZFVWWJ4IePBFN_TPARBusIDYFDd3Xj_hGaDHCiMBGGFs1lWjS5uoVdmLAspOlJhEo9lstqp2LPfvYBdcLN7Fsr0zvhkUuFVwvfgbStTTuvPllbpIQrTgBscRE-Hzj4Be6YfTXRHVfscI8w2rUgtHUvzFmisYZdmvctuZ18gl2769FApVUFALYhCdZDIX20MRwF3kd6EkM87q5ikqsPnI2OGzP5_6OqTztmj82HQ3SZGzgT-1rX7pd9DQV3ZrwTC3BwRw09_pD4DEmdTXml3_j3wXpl7PD-XDZsgl2YHaQhAqM1Q8QoFx4wcUEqMvKJNAiJ23sn_w5k3_6micRUoeq-JjKigERH44gKg1ThMiHcV1fmqe24vQU5NG7oiQNoV9pRbBsSXzHp40Ic2ecDfKqxtU2NJPF04N8b3hyTUS6YXmOk_5QLd12UWQ8tQCMaVSS4UjOJ9vFdi8j5JFvRCNsvgk2TSBT9l7l_S871zAr-lQFusUFduhhZU1KzkDIRJBmjuIy300g6T1IVwhpzmO_PQ85w-3-IILXEf_4KF8x76veK92yGyYXZqZwsK9eqy15CkOw-UJ7jh1CxgwsZzti1Wir0NFYNudX9ng0Iym7owOLDpBO6S_KRFtgLykIbh8q8lEYy15Um_4SbYgjRi1uRIHMq5x_xUFvANtzX6FuCUDxIZt2cXMPtOLpUmBo86_hhbd0m8jZs6RrSYMmkBshIGGwDvK6L2vZyHQSB_1luqivsRxkBMOw4WrCDZfMaSBNvY8DSOzw1QGk7z3L8lE172ot7SvEpZMhsb-MHbXc9rcRVlfhXFVu6BjO3cun5gCnhETLqbkjJCvPBNSjuZvEE7HTjMRLFnyN1dlJw8y_coFmLhFUQVqlytdCFOqa9l0wTKqP4JTVZS_IdeyihzHrXmq3WHND0v4PfArGYq3h6STHeHUg==&xkcb=SoCd-_M3HKH8RM2eKh0HbzkdCdPP&p=12&fvj=0&vjs=3",
                "title": "Analyst - Marketing",
                "company": "TalentBurst, Inc.",
                "location": "Location Not Found",
                "salary": "$36 - $37 an hour",
                "description": "• Bachelor's Degree preferred but not required (minimum Associates Degree) • Minimum 1-2 years' previous experience in marketing communications, sales, or marketing • Ability to coordinate multiple priorities & work with multiple persons • Working in matrix organizations with multiple distribution channels and influencers • Executing business and marketing strategy for a sizeable business segment • Knowledge or experience with SFDC, LinkedIn, Websites, Paid Search • Creative, highly motivated and results-oriented with a high-energy level and passion for marketing • Shows good, independent judgment, makes decisions, and commits to a course of action with appropriate factbased analytics • Willingness and ability to operate \"hands on \" to get results • Strong writing skills, especially in more technical areas \n \n \n \n \n • Marketing specialist will execute established marketing strategies • Work with sales team to develop key materials for customer interactions (PPTs, Brochures, etc) • Coordinates tradeshows (primarily US-based) for sales & marketing teams • Executes on collateral and content work, working as liaison with 5+ key agency partners and industry publications and groups • Marketing Specialist will coordinates process execution for marketing team including inputting purchase orders with appropriate approvals, manage and pull key digital metrics, assist to update key processes and track in central SharePoint folder. • Support in development of outbound digital marketing tools, including use of SFDC and Marketo (CRM system)\n\n20% travel will include domestic trade shows and events\nPerson will be expected to be in office 3 days a week, 2 days can be remote"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=283e023d1e3d73cd&fccid=cce48ad42816872f&vjs=3",
                "title": "HR Business Partner - HOSPITAL",
                "company": "Jefferson - Center City, Philadelphia, PA",
                "location": "111 SOUTH 11TH STREET, Philadelphia, PA 19107",
                "salary": "Not Available",
                "description": "Thomas Jefferson University Hospital is looking for a strategic partner to the hospital departments within Jefferson Center City, Philadelphia. MUST HAVE STRONG HOSPITAL EXPERIENCE!!! The HR Business Partner (HRBP) aligns business objectives with employees and management in designated business units. The HRBP serves as a consultant to management on Human Resource related issues. Successful HRBP will act as employee champion and change agent. HRBP assesses and anticipates HR-related needs. Communicating needs proactively with our HR department and business management, the HRBP seeks to develop integrated solutions. The HRBP formulates partnerships across the HR function to deliver value added service to management and employees that reflect the business objectives of the organization. The HRBP maintains an effective level of business literacy about the business unit’s financial position, its mid-range plans, its culture and its competition. • Acts as a single point of the contact for the employees and managers in the hospital units • Proactively supports the delivery of HR processes a the client’s side • Builds a strong business relationship with the internal client • Accountable for HR service delivery satisfaction to client. • Interacts with co-workers, visitors, and other staff consistent with the core values of Jefferson. EDUCATIONAL/TRAINING REQUIREMENTS: • Bachelor’s degree in related field required. Master’s Degree preferred. CERTIFICATES, LICENSES, AND REGISTRATION: • SPHR or PHR preferred. EXPERIENCE REQUIREMENTS: • Minimum of 5-10 years of the resolution of complex employee relation issues. • Strong experience supporting hospital/in-patient functions in a large healthcare entity is required. • Working knowledge of multiple human resource disciplines including compensation practices, organizational diagnosis, performance management, federal and state respective employment laws. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson."
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=4c18cb5964694f6d&fccid=44cccfbc6f3429d5&vjs=3",
                "title": "IT Business Analyst",
                "company": "City of Philadelphia",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "A best-in-class city that attracts best-in-class talent, Philadelphia is an incredible place to build a career. From our thriving arts scene and rich history to our culture of passion and grit, there are countless reasons to love living and working here. With a workforce of over 30,000 people, and more than 1,000 different job categories, the City of Philadelphia offers boundless opportunities to make an impact. \n As an employer, the City of Philadelphia values inclusion, integrity, innovation, empowerment, and hard work above all else. We offer a vibrant work environment, comprehensive health care and benefits, and the experience you need to grow and excel. If you’re interested in working with a passionate team of people who care about the future of Philadelphia, start here. What We Offer: Impact - The work you do here matters to millions. Growth - Philadelphia is growing, why not grow with it? Diversity & Inclusion - Find a career in a place where everyone belongs Benefits - We care about your well being The Office of Innovation & Technology (OIT) is the central IT agency for the City of Philadelphia headed by the Chief Information Officer (CIO). OIT oversees all major information and communications technology initiatives for the City of Philadelphia - increasing the effectiveness of the information technology infrastructure, where the services provided are advanced, optimized, and responsive to the needs of the City of Philadelphia’s businesses, residents, and visitors. OIT responsibilities include: identifying the most effective approach for implementing new information technology directions throughout city government; improving the value of the city’s technology assets and the return on the city’s technology investments; ensuring data security continuity; planning for continuing operations in the event of disruption of information technology or communications services; and supporting accountable, efficient and effective government across every city department, board, commission and agency. \n The Business Analyst reports to the Enterprise & Governance PMO Operations Manager. This role is responsible for guiding the success of the technology and services related to various business processes that align with the City’s technological strategic priorities and future-state agile, digital city experience. Working with cross-functional technology teams and business process stakeholders, they will oversee technology related business process initiatives from requirements through implementation, assessment, testing, and continuous enhancement. In this role, the Business Analyst will be the ‘voice of the customer,’ focusing on needs, expectations, understandings, and desires of the OIT and business process stakeholders to improve processes and increase satisfaction.\nAs a member of the Enterprise and Governance PMO, the Business Analyst is expected to uphold the organization’s mission and contribute positively to a collaborative, human-centered, innovative, accountable, transparent, and inclusive culture within the Enterprise and Governance PMO. \n \n \n \n • Advocate for the value of various business processes and encourage their use. • Lead requirements gathering (including interviewing users, analyzing work processes and operations, establishing solution objectives, and evaluating systems functionality) to uncover insights about various business processes and opportunities to improve existing services and explore new ones. • Work closely with development and support teams during business process related projects, including writing use cases and assisting in prioritization of features and functionality for systems. • Contribute to the planning for new or enhanced IT services or service bundles based on partner input and knowledge of OIT policies and standards. • Research, investigate, and promote the use of existing and emerging technologies to support or enhance IT operations and/or work. • Perform initial testing of enhancements and provide feedback to developers as needed. Coordinate with subject matter experts on second level testing. • Keen ability to determine when to apply Project Management principles. • Contribute to Project and Portfolio Management. • Ask smart questions, take risks, and champion new ideas. \n • Build and maintain collaborative and consultative relationships with customers and central OIT areas related to specific business processes being managed and serve as primary point of contact for IT coordination of services, communication, and planning around those business processes. • Gain an in-depth understanding of OIT’s processes and requirements. • Conduct regular reviews, priority-setting, and planning sessions with customers and other stakeholders. Serve as an advocate for those priorities, plans, and other technology needs within customer departments and OIT. • Monitor, evaluate, and regularly report to Enterprise & Governance PMO leadership on business process-related IT projects, services, and support; the delivery of services according to service level agreements; and levels of client satisfaction. \n \n • Demonstrated ability to think strategically about the application of technology to solve business problems and develop user/business-driven technology strategies and plans. • Ability to work with end users to understand and analyze business processes, define requirements, and assess technologies to determine fit for client needs; and with technical staff to translate those requirements into appropriate technical specifications. • Exceptional communication skills, with the ability to communicate technical concepts and information to non-technical audiences in a compelling and empowering way. • Deep commitment to developing and delivering modern, user-centered, and value-producing technology products, systems, and services in a collaborative way. • Ability to build effective relationships and strong commitment to working collegially and collaboratively with constituents at all levels in a diverse and distributed environment. \n We care more about what you can do than where you learned how to do it. That said, a bachelor’s degree is a good foundation for the work, and job-related experience around the competencies above is acceptable as well. The ideal candidate will have at least three years of experience with business analysis as well as working on and/or leading project teams. \n \n Salary Not to Exceed: $75,000 \n Starting salary to be determined based on experience and qualifications. Important: To apply, candidates must provide a cover letter and a resume. Did you know? • We are a Public Service Loan Forgiveness Program qualified employer • 25% tuition discount program for City employees (and sometimes spouses and dependents as well) in partnership with area colleges and universities • We offer Comprehensive health coverage for employees and their eligible dependents • Our wellness program offers eligibility into the discounted medical plan • Employees receive paid vacation, sick leave, and holidays • Generous retirement savings options are available • The successful candidate must be a city of Philadelphia resident within six months of hire The City of Philadelphia is an Equal Opportunity employer and does not permit discrimination based on race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, source of income, familial status, genetic information or domestic or sexual violence victim status. If you believe you were discriminated against, call the Philadelphia Commission on Human Relations at 215-686-4670 or send an email to faqpchr @phila.gov. For more information, go to: Human Relations Website: http://www.phila.gov/humanrelations/Pages/default.aspx"
            }
        ],
        "metadata": {
            "source": "https://www.indeed.com/jobs?q=Business&l=Philadelphia",
            "timestamp": "2023-11-28T00:55:23.456755"
        }
    },
    {
        "domain": "Cybersecurity",
        "url": "https://www.indeed.com/jobs?q=Cybersecurity&l=Philadelphia",
        "data": [
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZkFBy4Qr63BQKSyytxWB3Sgzy_vd8yjbi0cGQsgSDeipCmzmyri-rdibq1-_uwHFyWhrldfXI2OAbHSLF1_ejcAGD6oJsvW3T5W9Q2Pn-RWyYlemxKzXMVC6Si7-cxqyblJ2lBXv9NIlK1F5OZf51sDi_20dWwdP8Q3vBNrC0MOC7dX6TAGVQaKmwOu99HwvWXqYE92h2SQcb3aKgszcv4raeXSMG-PNBywZS2USYtHb3HWj--Qqt2HAuHoWYEOW3mzeUqzErDUJ-xEB0hTkvEhDiLmqQJc6-6_s1pa7QFH_e7OaUPUEgDp0lOXupU9pqoGrKsuik1FNm7W2AOxxbzmjckJsfsnzpCZN4JxmGsCXNib3yzhdjBQN6FkPjrAA2VMYp7AaYWBbEAa3oQl5t4KiVoh9GVExBgbtRs_m0J5rztTJnn-5yS8OYnwekSWogGsrM762hh0voxL0dTqSFtyCygU4RcZXHJ0Cdfc4m6JQEesIObOdhAQ75BvbWA5F5iiZ0H8wx0fpbvrpypxmKR1emN5VOkkYHZVzqnEBIh8l3-UcYW093TpQMobLuiVxLVJbAKgekL6lqF-FHL2OJ4I8ZdCgrFOKl93JoS1oGuQNT94p694O1gyrxfU835L1XTTmCc13rsSaGz3RDhhpMc0oZfHwa4lyka7XhKHoLfT_Hr59ODBihZIoJwOZ-dt24xD_zjVh0MLPk6x_eLB5oRpHLf57NRJ3x2HarCTuV0Kq4x6H1U6iFCIufKmn3l4AL8voklQht0uMGxxn1z6OxyqvC4FSJOqLBiRZ8cLRU7lYyQsvJhTY-HQYx0nkuHe-HZPnnrHbTWh6PA0XOULJVz3dbpthzBFXkW9QGJWtlt3hZ80fxGh4SMg0AMwP4lcw3VPh3kl9T29wM_4vcUk0D1LijOetsbe0yns4inkDHgjiL1ljUkwW4QOlJgjxkTI_SiOinOXolW8Zjv1XvdvZ2N06LZsKsSWxxzKB7DCIPiyjCyQeMVZh2WZLQyZSFXfsRkssU1suHX41afMyxArJMHWwpYar_PMhiUyLw04kYv586uMAQ71rDqVpYCpTrf4dbCCZkEIZQdmVgzSgYmpZEv64cijCxRJBoDqgzGUahm8XfzSqX6BYOqTqHMFVR_xj35BfmflPuvaVMXUvgP6lx4dY-pjYWuZ9BA8uGpt2eP32KM_V_bQ-CALc63-lHrqa29xXGjJy8ZZ4-cV3EG52pf4PokFcGZQSwGMmGIuHvRpch2xjWPtyXRz5W11I7TBV1hoSkyj3svL68WDt-8ANDhhD1jlEqjj-Hfv-YGD9MZ5yjnsAJ9d57zQ=&xkcb=SoBF-_M3HKH3C9WeKh0LbzkdCdPP&p=0&fvj=0&vjs=3",
                "title": "Comcast Cybersecurity: Principal Vulnerability Scan Operations Engineer",
                "company": "Comcast",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Job Summary \n Job Description • Lead daily vulnerability scanning operations, including configuring scans, monitoring scan executions, triaging scan issues, and ensuring overall scan coverage meets expectations • Continuously improve vulnerability scanning operations through automation, scaling, and optimization • Manage scan assessment processes to validate coverage, risk exceptions, and procedural gaps • Lead a globally distributed team of scan engineers across onshore and offshore locations • Provide technical guidance and mentoring to offshore team members • Facilitate collaboration and knowledge sharing between onshore and offshore scanning teams • Conduct regular status checks and sync-ups with offshore team member Coordinate task assignment and capacity planning for onshore and offshore scanning resources • Develop standards and playbooks for vulnerability scanning and remediation workflows • Collaborate cross-functionally with security, development, and IT ops teams on scanning integration and improvement initiatives • Track scan performance metrics and report on operational status to senior management • Develop roadmaps for vulnerability scanning toolchain upgrades and migrations • Create and manage scan assessment dashboards, reports, and metrics to provide security insights • Work with security architects on vulnerability scanning integration and data flows • Troubleshoot network and firewall-related issues impeding vulnerability scanning activity • Work cross-functionally with networking and security operations teams to resolve scanning challenges related to network topology, access rules, etc. • Develop network diagrams and data flow documents to assist with triaging network-based scanning problems • Configure scans and policies to properly authenticate into various environments leveraging credentials, keys, certificates, etc. • Triage and debug various authentication errors and issues affecting scan performance • Create troubleshooting guides and playbooks for common network and authentication-related scanning challenges  Requirements: • 8-10+ years of overall cybersecurity experience • 5+ years managing dynamic vulnerability scanning at scale in a large enterprise environment • Expert knowledge in leading vulnerability management solutions • Strong hands-on experience with configuring policies, troubleshooting scan issues, and optimizing scanning operations • Proficiency in scripting and automation using Python, PowerShell, Bash, etc. • Experience building and leading high-performing globally distributed engineering teams • Ability to effectively collaborate across time zones and geographies • Strong communication skills and cross-cultural awareness • Comfortable managing individual contributors remotely • Passion for team development and coaching distributed teams • Relevant vendor certifications in vulnerability management solutions • Strong knowledge of networking concepts - firewalls, proxies, IP addressing, routing, VLANs, etc. • Hands-on experience troubleshooting and resolving network-based scanning challenges • Familiarity with a range of authentication mechanisms - LDAP, SAML, OAuth, SSH keys, etc. • Ability to diagnose and fix authentication problems impeding vulnerability scanning Comfortable interfacing with networking and identity management teams to resolve scan environment issues\n\nEmployees at all levels are expected to: \n \n • Understand our Operating Principles; make them the guidelines for how you do your job. • Own the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services. • Know your stuff - be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences. • Win as a team - make big things happen by working together and being open to new ideas. • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers. • Drive results and growth. • Respect and promote inclusion & diversity. • Do what's right for each other, our customers, investors and our communities. We are determined to create an environment where our employees feel valued, understand our business goals, and are motivated. Here's a look at just some of the perks and benefits we make available to our US-based employees: • Medical & Dental • 401(k) Savings Plan • Generous paid time off • Life Milestones - from adoption assistance, childcare resources, pet insurance, and more, Comcast supports you at all life stages. • Courtesy Services - We offer all of our full-time employees in serviceable areas free digital TV and internet. • Discount tickets for Universal Resorts, including theme park tickets and onsite hotel rooms. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive other benefits and privileges of employment. Please contact us to request an accommodation. • This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications. Comcast is an EOE/Veterans/Disabled/LGBT employer. Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Education \n Master's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 15 Years + Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZkFBy4Qr63BQKSyytxWB3ShPhLRyFkEHC_ouaWBu8rx-SBjqS8s9tmfY-GxOStErf2sfkvHKh1CDB3LRjI91A-fFkv1E_s1RTfikgPttU-CV5tjSe1zpPEitKhlvU-13tqbi-p2L-AslB2n-68kuG6nz2lK_toh51Q99Ndk3olpD7ofi6gcm1oDvLV29lnwcDP1ETBzoGUIhg9cEkPoAk0Bpd_br6E0IGt2q8uB_14sSUQcE28NuTQwqWopDSUthH1fQV4bV58k8k5IJk1wyTqqt9FXSGVQmQemFkLxq5ud9dW3jhTaHvN851YvwggIU_2lYgbaxne_2s9uDmDCWekaN5v914lx6KoobbkZfWnjg8iJYilFvt2ZOlVouHjcv_v-EQPo50EoA6E71EclZSnIDgZGNCEsutspL3Rl28_v3t9mFyx-2W3tNrQpDiF7rTZrlBvY_woEe4PTaZY9AhEH_p5WEgilY8OiWEN_LAFHc-KBYCJT_eP9Mwkrz5U9yQyFxEyR5Hl9leajVUTa_-fBbg7gFcwOvRAO8zQbi_tNH4kmubYlDTqYneUSbVt00gC6E-p8YfLsKhI5QcSxGuLGCa78AAWMzci2D3363G6X6Lzpfc50HPt8VHHP2qOQ9CFo4QIgRl9BuPwf4T6-6wt-H3kogbP90lmNMdyNbC9GHqnlMcSkvboZCFzx7D0amS1HC2nP5Fqf0MT3lphd3vQP_zCD850CV39ep75bnI24jLKYSDLVWrm8bly_0PdIBfEReUAWw_3KwKAn173if_q5QyNcRVZuWC-1sDjFE-Wt-6FFf0RevE7a_57T8zq5MTQe65QUaXYMki3hoF0SexV1WfTeMk02V4sIuDFM-ryl2_Aw1CcpYj87he_J5ddW_WpBbZkElAXI-RckTgdpGHbdC4FmZHtv9iZTwTXMdISRwexxVnQ0yM8YnjNl3mvvcEqDvNogZ5CiHTbmH9IYhj35wR9tV0TRit0XWQAeXAibniA81wIgatMTl7Kqe-MzhzjOtKXIRBxCBS63eSd-1bHscWD9w94-buLIWZqLnXn9cmurBRHy5hC5_N1DPebDOH-5LoU91lPkJsQ23xfMAvRRUOgwTrF5uFjDymwXHpv10fTbaInDA-Z_H9ePWwtNZenCsalslNhqboXUafBkGcxnGD7NvsRpKlozxD3edY0MP05y0xwJZspV00T8vSTCTulaSycAoxBvzAT0xlxFDnpCHv93-PlyUTX2pSKHLb5bftceN6ixaJ1EAtsaYsnjW4pZq99bwHjkhiVV1NU4ioYnp_PZEOTEr0k8iNRooLxoxE6mCCduhf8k=&xkcb=SoDx-_M3HKH3C9WeKh0KbzkdCdPP&p=1&fvj=0&vjs=3",
                "title": "Comcast Cybersecurity: Executive Director, Cyber Security Engineering",
                "company": "Comcast",
                "location": "Location Not Found",
                "salary": "$177,581.69 - $302,696.06 a year",
                "description": "Job Summary \n Job Description • Reviews and presents operating and capital budgets including forecasts of operations, development, testing and any specialized needs to senior management. • Supervises operations and ensures business strategies and objectives are being met in a structured and concise manner. Delivers strategies and objectives within the department and across the organization. • Evaluates overall work processes and standard procedures to ensure performance is to company and industry standards. • Continuously develops staff through ongoing training programs, operational procedures and policies and develops staff organizational and technical skills etc. • Sets the reporting standards and then works with the Manager of Engineering to analyze reports for such issues as schedule completions for testing, spend levels for NRE costs, yearly license costs etc. • Stays knowledgeable of competition and important new technologies and standards. • Applies background and understanding of Network protocols at all layers, Secure Routing, DNS/DNSSEC, Network Device Security for a broad spectrum of vendors and devices, experience with SDN and automation, understanding and expert ability to fix network issues and network stacks of different platforms, e.g. TCP tuning, queue management for various OSs, Experience with operations at scale, H/A architecture and strategies. • Consistent exercise of independent judgment and discretion in matters of significance. • Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as vital. • Other duties and responsibilities as assigned.  • Understand our Operating Principles; make them the guidelines for how you do your job • Be responsible for the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services • Know your stuff - be enthusiastic learners, users and advocates of our groundbreaking technology, products and services, especially our digital tools and experiences • Win as a team - make big things happen by working together and being open to new insights • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers • Drive results and growth • Respect and promote inclusion and diversity • Do what's right for each other, our customers, investors and our communities  Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Comcast will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law, including the Los Angeles Fair Chance Initiative for Hiring Ordinance and the San Francisco Fair Chance Ordinance. Education \n Master's Degree, Master's Degree, Master's Degree, Master's Degree, Master's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 10 Years + Salary: \n Pay Range: This job can be performed in California with a Pay Range of $177,581.69 - $302,696.06 Comcast intends to offer the selected candidate base pay within this range, dependent on job-related, non-discriminatory factors such as experience. Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZlTAgGmdtIUzoKTi6fK6WvavChqo7e-wPqoTYHebK3uHVAgpfiEwa9nhapG_yrPfG_j5QJqm_uNv5kBz_0ObkdTCWfnziH2jbLKOw-ILGohZ3Yy1JEBIUpeURxmSYloJJfpLIWwkwnxH0-XR-I_niDk0jo7A7Em28DpSFn4DJLWLpnpOA5dPacn7t5RDqOCiP4_FQfeWpNHDVaw3YGtBDAxaUn3NV9--mfXCpFj8z4_J7RQ9lUMOwrxbJDL_06J4E2IKyubWnT2TCixRtLntQMEu6oQSq_OmCOqL0VDOFZo0TcF_4iqcRwXsaURl0BPtWCQh_7ZqM9YqXc1GWc90PA1OoNPDzyWFbk7I7MWQrpg8wHtSaqFTTHjozVf8fb0vbPfrJYXwqP6fW3h88-2SeBG-oZuHDg4W9R2kQrLwHKlM2wC4Z99T3mTuh5b8hgEO1MGPEPfwGhP1WxIOCcIZid9L-J130t9i9cxAhTaBqnIvtzmvdpNtBFu5piWN9k8zY5eTeluZmRyL1U-abHsJT_E2qPE1sfd9LrIUxjGovGnIrz5kIP0ioJQ3ROk4F3Vt_TrSZqwdYb2Yg6roGMEQVQcMCptSCW01-txcoM19aYT4krWAUxp-VyDFe1g9198t_6fLZ0McewiqNBU-yXFSGqEmIDBAYAxRkXDxs6-Q7F98vhbjKpm_G2sjzOcsqWgeQ87JCoyKpx4976-Tfp51XZxXTRqGUC12Pf5YryEfaXzoW0uzvXIu4kEmOCfX1G61YJeUKUIAt6brQLlY5LwNSU9tbsBAVoM1QS3ZFDKBWxE88CdlMsCdv-kC9HXZR0NvfNo5jv1uzVqG48XhXgEAaAHTXQQUWjVf4QJ5Z9EDpJgaV13fJK8fqcZOeH60O5QDxxHw8hbRAA2nTa6ExV_AZcdMd3l63E_rerQKQk__9DDAsiQa0qKSKHf_PuPqVIRvvsbzdIKLngz-x_Yhq3YMZtWHXTh8gFRJMavPyaXKD2Uql0_1ZBKfzG3CKp60-ohQH6qiBmbchyuv2kY4Gc8oIZ1eJpoytdqmk_HXXcMMLgJY7C6tED9d_HPqW8vCbvYRLxYceDHQ78ntdvrT6tHpss8-eqqA2wz375YojAlbf8X5lQYtgW00L8RtrrefZf-ytA9DAJy6_M8UO05Uw9myoRuzXAYglL82_irPy6zWKe-ky1TYg7SIjHHPl1LMqoOQl8h0xk-6V1UJefOMgDq6b9apSveAB2FKhFmzofEXu5uMp7t-5MFVTBVgVeeaodbErarujns4o3pX&xkcb=SoBs-_M3HKH3C9WeKh0JbzkdCdPP&p=2&fvj=0&vjs=3",
                "title": "Comcast Cybersecurity: ServiceNow Engineering 3",
                "company": "Comcast",
                "location": "Philadelphia, PA 19103",
                "salary": "Not Available",
                "description": "Job Summary \n Job Description Technical: • Understand ServiceNow platform and existing workflows, with focus on the CyberSecurity Modules • Building new workflows and modifying existing workflows based on user requirements. • Performing Platform code reviews from peer engineers • Understanding the ServiceNow data tables and solving technical efficiencies in the existing workflows. • Identify potential improvements in the core SNOW platform, network, and / or architecture and find creative solutions to resolve them. • Build in reliability and availability to the SNOW platform by creating and understanding metrics and measurements around the platform.  Non-Technical: • Identify Process gaps and areas for improvement to increase efficiencies in the Development process • Build and maintain a strong sense of team with the engineers by focusing on teamwork and collaboration.  Qualifications: • 3-4 years in a ServiceNow development role building new features and workflows. • 1+ years experience with ServiceNow platform operations • Knowledge with CyberSecurity SNOW Workflows (VR, Config Compliance, IRM) is a plus • Bachelor’s Degree in Computer Science or a related field, or relevant work experience • Excellent problem solving skills with a strong attention to detail • A sense of ownership, initiative, and drive  • Understand our Operating Principles; make them the guidelines for how you do your job. • Own the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services. • Know your stuff - be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences. • Win as a team - make big things happen by working together and being open to new ideas. • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers. • Drive results and growth. • Respect and promote inclusion & diversity. • Do what's right for each other, our customers, investors and our communities. • We are determined to create an environment where our employees feel valued, understand our business goals, and are motivated. • Here's a look at just some of the perks and benefits we make available to our US-based employees: • Medical & Dental • 401(k) Savings Plan • Generous paid time off • Life Milestones - from adoption assistance, childcare resources, pet insurance, and more, Comcast supports you at all life stages. • Courtesy Services - We offer all of our full-time employees in serviceable areas free digital TV and internet. • Discount tickets for Universal Resorts, including theme park tickets and onsite hotel rooms. • Learn more athttps://jobs.comcast.com/life-at-comcast/benefits(https://jobs.comcast.com/life-at-comcast/benefits) • We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive other benefits and privileges of employment. Please contact us to request accommodation. • This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications. • Comcast is an EOE/Veterans/Disabled/LGBT employer. Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Education \n Bachelor's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 5-7 Years Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DrIQzdPigR25kwLj80zWz2KU0_3wSTp9LhiWpg7CM6nWhJGkPIQVavKDNPiyxTmCYABnppcsBSjy5GinezxSs15j1-Rhkx-JEsMMB9roJXFXxjpGpISmB_ri1j2mnCU1s-MryAYpXU-chnOA5ZnuyFbDcfIMlU09apPcAUcjRPcQyKWlkB-ez74HepsOftCbt5gLq2CE9qhnDLfqnkuwLSESZ6ffiWDc59CjZ-beWJcpIy_s2FGT44teS-Xi7JUa_KPgTZy-npr9YvI-bqgZtPw3JPHZqnI11ZwGjOisLDMWHlXFyOjrRwQYTMwy_HYKEUdi69p3cQX-amYvBky-F-wn4VwmoNti3zkb5U2oqQyegr7AQu7wQViOZdwbvRF9mM_O7qnes9aHftMERKlwcdRI-3yI9R0EuiBbcdHfITvN4QtcvupaQLXyziwmfpHl7JiFI9BnNDd0J6EBSAInJdnDlz_Czl2rQXXMgACyoUKWJJorG263svj6AOj5erIvjCY1uYDFDDmY9OIohupfQc3_dTjICm5S4npyznTD8kCUXbiT8lKxQewLVF8Kz0SPHoHMVWn5llJFZTCV5IM3SgUniNPAYkjhcOVeAV3XR12A==&xkcb=SoDY-_M3HKH3C9WeKh0IbzkdCdPP&p=3&fvj=0&vjs=3",
                "title": "Senior Director, Identity and Access Services",
                "company": "CSL Behring",
                "location": "King of Prussia, PA 19406",
                "salary": "Not Available",
                "description": "CSL is accelerating its transition from traditional network boundaries to cloud-based services and aiming to update legacy identity and access management (IAM) solutions to ensure cloud-based services in a multi-tenant and dedicated cloud models with identity governance administration (IGA), access controls, and automation, including artificial intelligence. Reporting into the Vice President of Cybersecurity, Compliance & Risk, you will implement the Identity Governance and Administration (IGA) program and overseeing identity and user access management (IAM/UAM) for CSL. You will promote Identity trust in cloud-enabled ecosystem while ensuring compliance with regulations and policies, managing related risks and security threats, and ensuring business and digital innovation. You will build an AI-enabled automated, and self-service-driven strategy and related processes to enhance the productivity and user experience of the CSL workforce that aligns with the our goals and digital transformation goals for CSL.  Strategy and Guidance • Develop and implement an identity governance and administration strategy that aligns with CSL's goals, compliance requirements, and risk management goals. This includes defining architecture, policies, and related procedures for managing user identities and access rights across the enterprise. • Establish strategy, architecture, and process for granting, modifying, and revoking user access to different systems, and data resources. You will oversee user provisioning and deprovisioning, access requests, access reviews, and role-based access controls to ensure quality. • Provide operational oversight over the lifecycle of all user and privileged accounts from provisioning to deletion. Establish processes for managing the entire lifecycle of user identities within the organization and broader ecosystem. • Develop automated and AI enabled mechanisms to ensure accurate user provisioning and deprovisioning. • Lead a team of identity governance professionals who will implement the IGA strategy and delivering identity services. • Educate and influences business and application owners and other team members to accept, use, and communicate secure IGA practices. • Manage project budgets, business cases, and operational budget for the IGA/UAM services within Cybersecurity, Compliance, and Risk • Collaborate with different partners including technology teams, HR, external partners, and others to ensure understanding between identity governance plans.  Technical Expertise; Innovation and User Experience • Explores, selects, and implements, and provides operational oversight of technology-based tools and methodologies to provide an IGA program including provisioning of users to cloud applications and password reset functionality, user authentication, SSO and authorization supporting federation standards. • Lead responsible for program deliverables under the Seamless Access program that implements security, compliance technology to improve ease of access across enterprise services. • Evaluate complex business, technology risks, and influence of current decisions related to user access, data access, and information security. • Create an AI enabled automation and self-service program for appropriate access processes that improve user experience. • Oversee the development of related training materials and user manuals.  Information Security and Compliance • Identity access log monitoring and reporting. • Ensure all IGA technology and processes meet CSL security and quality standards, including GxP validation and testing. • Create an access cyber hygiene program, including SSO/multi-factor authentication, privileged access management and external collaboration access. • Work with threat intelligence team to use identity analytics technologies to monitor user activities, detect anomalies, and identify potential security threats or policy violations. • Work with incident response team to respond, understand, and reduce identity and access control related security incidents. • Produce regular reports to assess the effectiveness of identity governance controls and identify areas for improvement.  Service Provider Management • Oversight of Managed Service Provider to ensure service level management metrics for IGA are met.  Education • Bachelor's degree or equivalent; education preferably concentrated in IT, Engineering or Science; master's degree preferred. • Pharma/Biotech or similarly regulated environment experience preferred. • IT Security Industry certifications (CISM, CISSP, CISA, etc.) desirable.  Experience • Experience with identity and access management, with expert knowledge (15+ years) in identity governance and administration. • 10+ years' managerial experience and demonstrated leadership experience. • Experience leading teams through transformational programs for cloud-enabled ecosystems preferred. • Experience working with a managed service provider to improve outsourced IGA services. • IGA domain experience and technical background implementing SailPoint, CyberArk, Ping Technologies SSO/MFA, user accounts, security group memberships in Active Directory and Azure Directory. • Experience managing cloud technology deployments and integrations in AWS and Azure. Demonstrated experience with: • Web services integrations, SSO protocols such as SAML 2.0, OAuth, OIDC, Public Key Infrastructure (PKI) and other authentication/authorization protocols • SailPoint IdentityIQ configurations and workflow customizations. • PAM architectures  CSL employees that work at least 30 hours per week are eligible for benefits effective day 1. We are committed to the wellbeing of our employees and their loved ones. CSL offers resources and benefits, from health care to financial protection, so you can focus on doing work that matters. Our benefits are designed to support the needs of our employees at every stage of their life. Whether you are considering starting a family, need help paying for emergency back up care or summer camp, looking for mental health resources, planning for your financial future, or supporting your favorite charity with a matching contribution, CSL has many benefits to help achieve your goals.  Please take the time to review our benefits site to see what’s available to you as a CSL employee. CSL Behring is a global leader in developing and delivering high-quality medicines that treat people with rare and serious diseases. Our treatments offer promise for people in more than 100 countries living with conditions in the immunology, hematology, cardiovascular and metabolic, respiratory, and transplant therapeutic areas. Learn more about CSL Behring.  As a global organization with employees in 35+ countries, CSL embraces diversity and inclusion. Learn more about Diversity & Inclusion at CSL."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZlTAgGmdtIUzoKTi6fK6Wva8FuL4iVMyP7zk0Wgam1fSG__EpXYRYwah30PYO7L9jf7yzFC0lrDuhm9ooaZGOxC2v0fxFEWPNqNOXgsM5M6u6YUYZMa1mmz2SgFVEh12o3DtVDkeRaoHs3iLiWk1KoX8QuLenVzPoI5kBckmjGKAlGtg-qgmcQDSB6csjMrtVs8o-bJFVif6A2UPhLxOgjFYEc0C-hrVRFMztDgvnG6odQzdgLJjJ9Ui0VglKwmmGCs_1Z7MBy6oppkNPrINvRD7E5DvuPx1xnqX6uszANcCudGdJzBZ8V5Uq_0goybWFz8n52NLONQK3BnuMMduTf9uT8b6B-LjdFODs3X5ItGGcUFDOS9KAYu-08b5EAwtLLELqaBNrm7oHUfEW1TsQNNnTy_L4vbgoejKT3G4cDIH6fVjfWSGrp9sAYKgw7PAXvhHrGAvFy5LfkH01Khlysn4PJ3hN7a1HfLSCXX92iDFNVxm8FiZ-Db1BaLKwyo7MuPkdoNE7GFMpppbG1Z6OcAe3lkScRBYJgBKlL8nayj7RRJaRQ_XXKzmPeXAgvZnIPC2uLIeOS3wORpme-l1Rx2sgXTx19T6vqHeFUoJUPTlg-fcWQss5DP2WfzuA14upPceUAIftzRzdPgl5VbgpbR1l21b4sBuY8VgLk2Q9nsytRPpTpIpWLHAVdJuspNzroGDu2vghjl3W1oQOTU47AcdIYNdaERp4_efu2Xj5Qqb72M1UDX8ZK_80Ab2vI_sUl0MsgX19vxJXOEPMLYrdFYtuBZPGGtXPU3ftLHVo69mprbqaaO3WUstE_UCLrIYHhlmGm4owT5YwL1e4Rr3EyGeUrd4ZAjr58E-8um3UgomTAwJBUs0aQePRRnkYNh92QaR6taUYu68j9TRymbsmfPzeozd332RMAC_sF4CEIqEkGdWY2G_OZ4PDdiMTar39fnmf4k7sj1oZR-QVSxRfIF6jopdnUZ-XWjn0XFJNv995eJEqHiky_25eJc7qaTZ-x3-kxNCaWYi4Jwq-5zE7eT7_pKYDZhB3CCw7QJGQ3sJd2zmzZIu0fINjSvoVn7wnv24-85_SV4EUXWQyZdBfuZRLo73FUgZnISV7BBDD5FNPaFpGKma00SHTOMlJkbbKXBQD9-pHRxRmcXH6Q236nPTH1B81cdc7-48gwI6uc6JgEw4p9Cg6tG6PjOXaRBuIkK5SmicGOYw45hmpzTItJUu-tZ8UjYmC8dXcFdgGkDJ2dBwzZCRirB70qkdLse949FTvnJcCOIp6AoXflkeYPGz4TpPdLpG4A==&xkcb=SoBW-_M3HKH3C9WeKh0PbzkdCdPP&p=4&fvj=0&vjs=3",
                "title": "Comcast Cybersecurity: DevOps Security Engineer",
                "company": "Comcast",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Job Summary \n Job Description Core Responsibilities • Collaborates with project stakeholders to identify product and technical requirements. Conducts analysis to determine integration needs. • Designs new software and web applications, supports applications under development and customizes current applications. Assists with the software update process for existing applications and roll-outs of software releases. • Participates in training representatives and operations staff on internally developed software applications. • Researches, writes and edits documentation and technical requirements, including software designs, evaluation plans, test results, technical manuals and formal recommendations and reports. • Monitors and evaluates competitive applications and products. Reviews literature, patents and current practices relevant to the solution of assigned projects. • Provides technical leadership throughout the design process and guidance with regards to practices, procedures and techniques. Serves as a guide and mentor for junior-level Software Development Engineers. • Works with Quality Assurance team to determine if applications fit specification and technical requirements. • Displays in-depth knowledge of engineering methodologies, concepts, skills and their application in the area of specified engineering specialty. • Displays in-depth knowledge of and ability to apply, process design and redesign skills. Presents and defends architectural, design and technical choices to internal audiences. • Displays knowledge of and ability to apply, project management skills. • Consistent exercise of independent judgment and discretion in matters of significance. • Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) and overtime as necessary. • Other duties and responsibilities as assigned.  Employees at all levels are expected to:  • Understand our Operating Principles; make them the guidelines for how you do your job. • Own the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services. • Know your stuff - be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences. • Win as a team - make big things happen by working together and being open to new ideas. • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers. • Drive results and growth. • Respect and promote inclusion & diversity. • Do what's right for each other, our customers, investors and our communities.  Disclaimer:  • This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications.  Comcast is an EOE/Veterans/Disabled/LGBT employer.  Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Education \n Bachelor's Degree, Master's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 5-7 Years Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZlTAgGmdtIUzoKTi6fK6WvZbHww3cnld00x7PCG5e9oT43FCH27909V5YQPHkk0rIPUev5nuHK39f2GiLXsx5Tbc-9GPVKSGaqHrf5vEalDRFLPCQgzJL5zmeHFAOi8-wZDlzVVEm2EUl6hD3zTiP88dQ-19SKnsso3RWlpYTAmO1V7sk9pGna5Dl9WU3LMcP7p-tMSnr0Y-VS226QH6ayiGLctW7Ts9ABaix-koi0KF16gKStmnpeJgJA1qk3QZnMfH-1wwrcSlETUCVGYBPlDb8JhyL_X-Ttp18_gl6Z4p8qeX54gGrRHv3lByYrmR8u6n2KOL6UTxSGGkTXqR_T-TpJqI-JYPRBynvEbTT2RSiVoz7iZM7bw6WUuVkKOuroW2-_xc5pUQdeuzrnVEXzMCEjUX1676qBAICZr_BdiVyVenuY9yg0YS5H0rPXWSc9r8vPeuLgqrn-z8_2b9Fk2L4eVaM_pkKH7MVStYtS_bDWMANDuri7mRSNLX2ddBYVIijAUpGcYO0ihWE_QgIoG5UvhUPoRPaEd9wX_MPqfXESqbfKxW4T3Jh06m3DYHxABShrXVShuT9jr5nPI_u4urfpvB73kzK3h-UTbr8IGjzkJ2VLIlNERhhRDPoV9oFtqHPoAvNbM4wJsrOS1mSC1cJEPt3neawanGlJDxrWGaPVvsSNk3pBzjWKqwi3SU9Knw_fmbkQ-pntCDoqrV6QTGMpYBXgTIxZXQZq3XuDr8-AtRFWzV9kUdXgetCJyZfbJRZegthTg80Rf1Qr_eIo-Ur_tDG_k02rapip5n4ndA4POO23avi1QmP-ef-y61ToLbfuyYcCQ0kkikMclkLkYhp6Ej6L7A6zwSx2rb0ORm9OVC4U0zE5RCFsFMy4LMse_ZnT2REym1vqbjFgp93h-q3W6eny5Mk999x0jLP3ViII2hTstOYM2m4Fu-nSl_nGLyrQ_FzJTplgvUAyY1NdImhV6VWkaI1Qls-DLbafah-GLP-7dydqR2LDGXUH2YxmAeeihQfnfaRUz0CScXbv1ELtS7We5wgrPhfylbv5W__DM9JP2nt9if40UOgEdbYifboVzjOMdPZklVo3sfRCxeTEMuHyKsGF9wajV5_B2irVs1eoxmtfzDvnHhjPmbforGPerx_9WLB-AIyt68Mo1janlTC4ZH21eenn6LhKZ4b_20mWgUAKWWCyZNGinJlwAenNy6jQhaRBSGto2YLKUK9IfwPPTQF2S-_LGC-m-a2WoqbAvCyG6YZcZ1qVbacIi-r7_Sf-rEGxW3PAjxfsGhbgpyM5JCJcrq-5ElCqUJCwYE6anGy8I=&xkcb=SoDi-_M3HKH3C9WeKh0ObzkdCdPP&p=5&fvj=0&vjs=3",
                "title": "Comcast Cybersecurity: Senior Penetration Testing Engineer",
                "company": "Comcast",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Job Summary \n Job Description  This role will work primarily in performing offensive security assessments (application, network, mobile, Wi-Fi penetration testing, red teaming, specialty security assessments) and support ongoing offensive operations and infrastructure.Primary responsibilities include: Perform application penetration tests. Application pen tests often include thick client, API, mobile SDK, and web applications from open, and closed box perspectives. Perform network penetration tests. External, internal, and wifi network penetration testing. Capable of penetrating multiple platforms in enterprise environments. Contribute towards team tool kit, lab, and attack infrastructure. Become regular contributor to team wiki and git repositories. Follow primary source cyber security feeds, publications, and articles to remain current on trade craft and vulnerabilities. Interface with team members and stakeholders with professionalism and an overall positive attitude. A variety of problems will arise and will be dealt with, but senior staff will pro-actively construct solutions.  WHO YOU ARE/ WHAT YOU BRING:  The person that takes this role will first and foremost be deeply technical, able to oversee and execute high quality penetration tests. We believe that there are no “rock stars” or “ninjas” on our team – we collaborate to be the best we can collectively be at breaking into networks and applications. • Strong spear-phishing skills (both credential harvesting and remote code execution), ability to customize an attack. ·· Experience in at least 3 of the following: Use of vulnerability management and Penetration Testing tools such as Burp Suite, Nmap, Metasploit, Nessus, Sqlmap, etc. • Experience at Senior/Principal level with one or more public cloud platforms: AWS, GCP or Azure. • Mobile app security testing a plus • Understanding of the CVSS scoring system. • Scripting using one or more of the following: Python, Ruby, Bash, C/C++, C#, or Java. Establishing/improving PenTest policies, procedures, exceptions and operations. • Senior level experience with enterprise penetration testing. Must be strong at network and application testing for this position. • Seniority with Linux and Windows. Must have strong practical experience in both environments. • Senior level network experience. IPv4/IPv6, PCAP interpretation and parsing, understanding of all layers of the network stack. • Strong with pivoting and tunneling to traverse network segments and chains of compromise. • Leading or participating in cross functional efforts for managing organization wide risks. • Collecting, analyzing, reporting, and briefing discovered vulnerabilities. • Experience in penetration testing simulations (e.g., Hack the Box, Capture the Flag)  REQUIRED: Bachelor’s degree, preferably in Computer Science or Information Security or equivalent experience. 7 years of related experience either on the job or in demonstrable projects.  Employees at all levels are expected to:  • Understand our Operating Principles; make them the guidelines for how you do your job. Understand our Operating Principles; make them the guidelines for how you do your job. • Own the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services. Own the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services. • Know your stuff - be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences. Know your stuff - be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences. • Win as a team - make big things happen by working together and being open to new ideas. Win as a team - make big things happen by working together and being open to new ideas. • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers. Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers. • Drive results and growth. Drive results and growth. • Respect and promote inclusion & diversity. Respect and promote inclusion & diversity. • Do what's right for each other, our customers, investors and our communities. Do what's right for each other, our customers, investors and our communities.  Disclaimer:  • This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications. This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications.  Comcast is an EOE/Veterans/Disabled/LGBT employer.  Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Education \n Bachelor's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 7-10 Years Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=82cde4e5ee1fda05&fccid=4d297a7bcd1c7be4&vjs=3",
                "title": "Security Incident Response",
                "company": "Lincoln Financial Group",
                "location": "Radnor, PA",
                "salary": "$90,000 - $175,000 a year",
                "description": "Date: Nov 20, 2023 Primary Location: Radnor, PA, US Company: Lincoln Financial \n \n \n \n \n \n \n • Monitor, defend and protect perimeter interface for malicious network traffic. • Responding to host based alerts • Performing network analysis of egress and ingress traffic. • Conduct real-time analysis using the SIEM and other security analytics tools. • Responsible for correlation and initial triage of security events and indicators generated by security monitoring tools. • Perform triage and response activities related to suspected phishing emails. • Identifies and recommends process improvements that significantly reduce workloads or improve quality for his/her assigned area(s) of responsibility. • Maintains knowledge on current and emerging developments/trends for assigned area(s) of responsibility, assesses the impact, and collaborates with management to incorporate new trends and developments in current and future solutions. • Administer more complex requests and questions received via phone, e-mail, or an internal ticketing system in a timely and detail-oriented fashion in order to resolve a multitude of cyber security related situations. • Maintain availability of security technologies, such as IDS/IPS, Web Application Firewall, DLP, syslog, vulnerability scanners \n • 3 - 5+ Years Experience with one or more of the following technologies: IPS, DLP, WAF, Content Filtering, Malware Detection, Vulnerability Management. • 2 - 5+ Years Information Security related experience, in areas such as: security operations, incident analysis, incident handling, and vulnerability management or testing, system patching, log analysis, intrusion detection, or firewall administration. • 4 Year/Bachelor's degree or equivalent work experience \n \n • A clearly defined career framework to help you successfully manage your career • Leadership development and virtual training opportunities • PTO/parental leave • Competitive 401K and employee benefits • Free financial counseling, health coaching and employee assistance program • Tuition assistance program • A leadership team that prioritizes your health and well-being; offering a remote work environment and flexible work hybrid situations • Effective productivity/technology tools and training"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=33a6dcae2d81fb38&fccid=aeb15e43a6800b9d&vjs=3",
                "title": "Cyber Security Engineer",
                "company": "Lockheed Martin",
                "location": "King of Prussia, PA",
                "salary": "Not Available",
                "description": "JOB ID: 656570BR Date posted: Nov. 27, 2023 Program: Death Valley \n Description: \n \n What does this role look like? \n \n \n \n \n \n Benefits of Employment: \n \n \n \n \n \n \n \n • Medical {many choices of plans; some LM locations have on-site medical} • Dental • 401k {with generous matching} • Generous Paid time off • Work/life balance, family-friendly environment … we have a 4*10 schedule which means: Three-day weekends • Work/life balance, family-friendly environment \n • Career development, career-growth, and lots of learning opportunities for aspiring minds • Fun, talented and witty teammates • Knowledgeable, supportive and engaged leadership • Diverse, inclusive and community-minded organization • Mentorship opportunities • Rewards & recognition • Generous Tuition Reimbursement \n \n Basic Qualifications: \n • Familiarity with Linux and Windows operating systems • Technical curiosity to learn new skills and are ready to help across the team • Experience with vulnerability scanning and/or patching • Security+ • Active TS/SCI Security Clearance is required • Base understanding of Risk Management Framework, (RMF) NIST SP 800-53 Desired Skills: \n • Active DoD Secret or Top Secret Clearance (with investigation within 5 years) • Possess an approved DoD 8570 baseline certification for IAT Level II (CISSP, CAP, etc.). • Strong understanding of System Security Engineering (SSE) principals and process. • Advanced Understanding of Risk Management Frame Work (RMF) NIST SP 800-53 • Knowledge of Windows Server Operating Systems (i.e., 2008 R2/2012/2016/2018) • Knowledge of Linux Administration (RH7.x, RH8.x) • Familiarity of cloud based services • Docker/Rancher, Kubernetes, API’s, Jenkins, Github and Gitlab • Jira and Confluence Security Clearance Statement: \n Clearance Level: \n Other Important Information You Should Know \n Expression of Interest: \n Ability to Work Remotely: \n Work Schedules: \n Schedule for this Position: \n Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. \n \n \n \n Experience Level: \n Business Unit: \n Relocation Available: \n Career Area: \n Type: \n Shift: \n Lockheed Martin is the leader of cyber security defense, cyber operations and sensitive data protection. We employ the world's best cyber minds from diverse fields – people who are passionate about and empowered by our customers' missions. Lockheed Martin's best-in-cyber teams are experts in thinking like the enemy – identifying adversary activity and anticipating advanced persistent threats to strengthen platform defenses, inside and out of our networks. Our Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer:"
            },
            {
                "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Ad1FFWZOsBBwBZDGouyCcICeLSd3pQct3wJ1q5dPO7JK97v8vsS6it-TWI1yGcNwJEw-_92hmN43fvT9n7rxrSvImtQD8Np0tKAS1FWXZ8vQ-ZRfLZNdk-N0V3wb-C_Xw3F0ElpYB1SDpI_FAwinXUJlth1hRTo-EPG7QgxX138Wha3bv7ytXb4pjDabH2oZ1oCl1eK42XHlFKjbECm6CRSkrUDVe0zH8x6pYJL4POalpiPEed4iwgbC7cUnTutz9cIdkcZI4rTJlOeTxGSqcEAPzdTQe44aGtqkv93YcR8RbfUZC4elcdUTk9G8sVMnNt85pYSfkok_elFakhBim-_2P9e8u4TWd1J79t2fVmzEYbdX8l_RkXHe8FIkyB_mFNxSIunNV8yK_iIWoI5BXl5Q5RmRza6akOW8tN85Xzq4ajDwammo-idou_eVsvyBMnzpBYH7LOQmvnxaM54OHv86WjTQTwXfXh7K2ySNL7Ur5AqA5atZMi5IBo95wx1qRen8scgvDLirHfkfNWC9J12FPwwFO7ETSMgu4VvQ_T24BpEreZgCbV6U8VLh3XH1gIsD15NAgVZWr_IdDW4GOJblmCVsGJivXS9z-7MwikXjGgPAd1kPQo9rSsGyKaLIe0-MMjdiO6QSNQxJ3JHFF9sTc2I9eQbe0-5HvXaBHpMqqI80-mxMw2uSWNCSdsPCwTYChjVExmc-uHb7NVPyJXzZCggMvJMYiL6o_ioCwuWWdjXXz9mIJsR9nXQCOGfVk9KiIhGfhI2_mnfzKHzp4FoHiQG6zaD1rXu8vxOYUziaYA8Sk4Z0Z1fmmiuUYlLUiuNgoVUkXFW2v0ubaikKa_Gg-7Grdaw_4sTjonlqtgo_5OWNHZiEpPhRCsJ81zpVqbiVgpC3UDyD0RMfRezdAHDkL5loeoHqNkb-EVZGmwVjZ9afQtDyuZk9UX2M756y9hwwcw7GsGOlop5ex5rsQHVRA-eWFD_kuDpE7DOgCjY34bEZDA3GrCA4kjSIixLt9LF5muBQFS30KFCTYnVSxapTP82jS1TJRThj_RMNNWNGy6P4rmxyrFDWHnTK5_vJXtRj0QMxJs8T9tXzQFOd-aszUo3HdjIV5BGKRwBYMio1kXls_T6a49DU5uLt37qE-0zWN30ahFsJ4524HLNoe9Varsl6oubVnjXKK7m_KRF76HFw73a-gOqp0f8fdTpDlRc_7hM4zAPwqNB0_zc6TwzXwG_xUkbk-GsNyX385cuZ8UYNYHARhFu-8f4dGbTfboE0nkHejFsG4q9qkYv0x3&xkcb=SoAi-_M3HKH3C9WeKh0DbzkdCdPP&p=8&fvj=0&vjs=3",
                "title": "Platinion Senior Consultant, Cybersecurity",
                "company": "Boston Consulting Group",
                "location": "1735 Market Street, Philadelphia, PA 19103",
                "salary": "$140,000 a year",
                "description": "BCG Platinion launched in Germany in 2000 to add deep technical expertise to the Boston Consulting Group’s existing capabilities. Today, our presence spans across the globe, with offices in Asia, Europe, and South and North America. Our New York-based North American team began in 2014 and in 2017 acquired MAYA Design, a Pittsburgh-based digital design and innovation lab, to grow our capabilities around technology and design. \n We support our clients’ total digital transformation through technology, design, cybersecurity, and risk management & financial engineering capabilities. And together with BCG, BCG Platinion’s interdisciplinary team of technical experts enable customized technical solutions and accelerate delivery value through new business platforms, application consolidations, and major system implementations.  \n \n  \n \n \n \n \n \n \n • Developing tailored, customized cyber and privacy solutions to address our clients challenges • Implementing cybersecurity and privacy program transformation and culture change initiatives • Conducting cybersecurity assessments including gap analysis and roadmap development in multiple contexts, including organizations, product development, and cloud security • Developing cybersecurity strategies, policies, processes, and procedures to protect clients’ internal infrastructure and their customers • Collaborating with cross-functional teams to seamlessly integrate cybersecurity measures into GenAI solutions, ensuring the protection of sensitive data and the resilience of systems against evolving threats • Understanding and application of digital, IT, cloud computing and data strategy best practices to enhance cybersecurity and privacy • Developing cybersecurity and privacy business strategies for technology product vendors that are integrated in the organizations overall business strategy and increase revenue and profits • Working with leadership teams, including facilitating board and senior management cybersecurity and privacy awareness workshops • Integrating security and privacy by design into software, systems, and architectures through shifting left and designing appropriate processes, procedures, methods, and techniques • Quantifying progress through cybersecurity and privacy measurement and risk quantification \n \n \n • 4+ years of professional experience in the execution and management of technology (Prior experience at a consulting organization is highly preferred) • BS in mathematics, natural sciences, information technology, business management, or similar degree • CISSP, CIPP/E, CIPP/US preferred • Hands-on experience with, or extensive knowledge of some of the following: • Developing cybersecurity strategies or policies • Managing cybersecurity risk • Leading security assessments • Designing, transforming, implementing, and running cybersecurity programs • Developing security architectures • Integrating security into system development lifecycle • Cyber supply chain risk management/third party risk management • Designing / implementing identity and access management • Developing cybersecurity workforce • Delivering cybersecurity culture change, awareness, and training • Performing continuous monitoring activities such as using SIEM tools, APT hunting, implementing UBA, etc. • Designing / implementing vulnerability management, including conducting vulnerability assessments • Ability to navigate and advise on complex, evolving privacy regulatory landscape, especially new laws • Working on data privacy projects that span across requirements engineering, design, technical implementation, and/or technical program management is required • Broad knowledge of cybersecurity technologies throughout organizational and acquisition lifecycle • Working knowledge of at least two different cybersecurity frameworks: • NIST Cybersecurity Framework • NIST Privacy Framework • ISO/IEC 27000 family of standards, etc. • C2M2 • NIST SP 800-53 and companion publications • Cloud Security Alliance CCM • The CRI Profile • Knowledge and experience with major digital risk and technology regulatory environments • Business and technical fluency in major data protection laws (e.g., GDPR, CCPA, CPRA) • Team-oriented attitude • Strong communication and presentation skills • Outstanding analytical and conceptual skills • Results-orientated mindset • Confidence and persuasiveness • Business-fluent written and spoken English language skills • Willingness to travel around the globe to work with clients and BCG teams. At times, this role involves significant travel to client sites. The amount of travel will depend on client needs and nature of projects \n • An opportunity to work organically across disciplines and across BCG, we offer a unified and unrivaled opportunity that combines strategic thinking with hands-on applications. • A unique experience to work alongside a team of passionate and driven problem-solvers with a mission to deliver innovative and valuable digital solutions in a supportive environment. BCG pioneered strategy consulting more than 50 years ago, and we continue to innovate and redefine the industry. We offer multiple career paths for the world’s best talent to have a real impact on business and society. As part of our team, you will benefit from the breadth and diversity of what we are doing today and where we are headed next. We count on your authenticity, exceptional work, and strong integrity. In return we are committed to supporting you in discovering the most fulfilling career journey possible—and unlocking your potential to advance the world. \n \n The first year base compensation for this role is $140,000 in USD. \n  In addition to your base salary, you will also be eligible for an annual discretionary performance bonus and BCG’s Profit Sharing and Retirement Fund (PSRF) contribution. BCG also provides a market leading benefits package described below. \n  At BCG, we are committed to offering a comprehensive benefit program that includes everything our employees and their families need to be well and live life to the fullest. We pay the full cost of medical, dental, and vision coverage for employees – and their eligible family members.* That’s zero dollars in premiums taken from employee paychecks. All our plans provide best in class coverage: \n • Zero dollar ($0) health insurance premiums for BCG employees, spouses, and children • Low copays for trips to the doctor, urgent care visits and prescriptions for generic drugs • Dental coverage, including up to $5,000 (USD) in orthodontia benefits • Vision insurance with coverage for both glasses and contact lenses annually • Reimbursement for gym memberships and other fitness activities • Fully vested retirement contributions made annually, whether you contribute or not • Generous paid time off including vacation, holidays, and annual office closure between Christmas and New Years • Paid Parental Leave and other family benefits such as elective egg freezing, surrogacy, and adoption reimbursement • Employees, spouses, and children are covered at no cost. Employees share in the cost of domestic partner coverage. To learn more about our employee benefit please check our Benefits page."
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=8d51e6a541e4e108&fccid=6b4d8589813ead16&vjs=3",
                "title": "Cyber Security Operations Analyst",
                "company": "Brown Brothers Harriman",
                "location": "Philadelphia, PA",
                "salary": "Not Available",
                "description": "• Day to day operations of BBH’s Cyber Intelligence Monitoring and Threat analysis. • Provide log analysis, real-time intrusion analysis, incident response, and security monitoring using a wide array of industry leading tools and technologies. • Investigating suspicious activities, alerts, and events detected by the security tools or reported by users and containing and preventing any potential incidents. • Analyzing and reporting on any information security issues, emerging trends, threats, and vulnerabilities affecting the organization or its industry. • Respond and perform analysis and risk assessment of all security events and incidents. • Provide related documentation in support of BBH regulatory guidelines (FFIEC, SOC2, NYDFS, etc.) and auditing initiatives. • Bi-weekly and Monthly reporting. • Maintain a working relationship with a 24x7 external cyber intelligence and threat monitoring service (MSSP) in support of our team. • Engage in security investigations and use tools to identify and report the outcomes of incidents to senior management. • Participate in discussions around security events and activities with various non-technical and technical parties. • Collaborate with various teams to manage security investigations and provide prevention solutions for cyber threats. • Follow the firm’s project management, SDLC disciplines to insure structured effectiveness in implementation and operations. • Responsibilities in working with tools in for identifying the firm’s security vulnerabilities. • Troubleshoot and work with vendors in identifying security vulnerabilities. • Collaborate with application and operation system teams to remediate any security vulnerability findings. • Recommend, and apply best practices for addressing ongoing threats. • Help support security tools that monitor the firm’s security configuration, changes, health, and baselines, such as SIEM, Anti-Virus and other cyber tools. • Respond to Endpoint protection and malware detection tools alerts following response templates. • Makes suggestions on tuning alert volumes. • Makes sure responses are remediated within SLA. • Bachelor’s Degree (or equivalent) or advanced degree highly desired. • 3+ years of Cyber Security experience. • Relevant or similar work experience in some of the following areas:\nSecurity Incident Response\nSecurity Operations management and maintaining IT general controls\nMalware analysis and remediation / Data Analysis\nDesigning and Operating enterprise security controls\nVulnerability & Patch management • Security Incident Response • Security Operations management and maintaining IT general controls • Malware analysis and remediation / Data Analysis • Designing and Operating enterprise security controls • Vulnerability & Patch management • Expertise with security assessment methodologies. • Some knowledge of networking protocols and related equipment. • Interest in packet analysis and forensic tools. • Familiar with Firewalls, IDS/IPS, Web Firewalls, Sandboxing, and other security tool terminology. • Interested in scripting with Bash, Batch, Perl, or Python. • Data Analysis using Excel. • Interest in Unix/Linux & Windows operating systems and privilege access. • Data analysis of various security logs. • Interest in security trends and threat intelligence. • SIEM technologies and correlation. • Familiarity in cyber security forensics is a plus. • Some rotating, 24 x 7 on-call responsibility."
            },
            {
                "url": "https://www.indeed.com/company/Mullen-Coughlin-LLC/jobs/Administrative-Assistant-6eaf555b80ef9f4a?fccid=7e6bb98fc2637353&vjs=3",
                "title": "Administrative Assistant - Cybersecurity Law (Hybrid)",
                "company": "Mullen Coughlin LLC",
                "location": "Mullen Coughlin LLC in Devon, PA 19333",
                "salary": "From $22.50 an hour",
                "description": "Mullen Coughlin is a highly successful, fast growing niche law firm focused exclusively on counseling organizations in the context of data privacy, including incident response, regulatory investigation, single-plaintiff and class action litigation compliance. Committed to rapid incident response to incoming client calls, we thrive in a high energy, close-knit, and upbeat office culture. The Firm pays very competitively in the market and offers a full benefit package, including accrued time off, paid maternity and paternity leave, and a generous 401(k) program. At its new office, located at 426 West Lancaster Avenue, Devon, PA, Mullen Coughlin’s home office is over fifty-six thousand square feet, boasting the latest in technology and security, accommodating the projected continued growth of the firm, and providing all Mullen Coughlin employees access to amenities and resources to further their professional careers, as well as their health and well-being. The Administrative Assistant will work as part of a cohesive administrative team to support Partner and Associate Attorneys in our data privacy practice. This is a full-time position eligible for benefits with a daily schedule of 9:00am to 6:00pm (including a 1-hour lunch break) with initial training onsite and the potential to work from home up to 3 days per week following a 6 month review. Responsibilities • Maintain complex calendars. • Directly communicate with internal and external customers. • Intake new cases, open and close files. • Critical, deadline driven management of case work. • Draft and finalize deadline driven responses to regulatory agencies. • Draft and finalize professional correspondence. • Triage email communications. • Electronic filing of documents and electronic communications. • Collaborate and support the team to provide responsive customer service. • Coordinate travel arrangements. • Prepare expense reimbursement reports for submission. • Perform other administrative tasks as assigned. Skills & Qualifications • Ability to perform multiple tasks simultaneously with demanding time frames in an interrupt-driven work environment. • Working understanding of databases. • Strong, accurate typing and formatting skills. • Must be highly organized with a desire to learn and apply new concepts/skills on a continual basis. • Ability to communicate effectively, both orally and in writing. • Effective time management skills to balance workload of partner and associate attorneys, efficiently prioritizing requests. • Strong interpersonal skills. • Ability to work independently or collaboratively with team members. • Good analytical skills. • Ability to resolve issues quickly and efficiently. • Strong organizational skills and attention to detail. • ProLaw experience, a plus. • Demonstrated proficiency in computer software applications, including MS Office (Word, Excel, and PowerPoint); Outlook for calendaring meetings, events, etc. Ability to learn and use other applications, such as ProLaw. • Ability to adhere to standardized inter-department processes efficiently and accurately. • Ability to represent a positive and professional image. • Must have highest integrity, including the ability to treat confidential information appropriately. To Apply\nSubmit a cover letter and resume through our applicant tracking system by using the following link: https://www.mullen.law/careers/?gnk=job&gni=8a7887ac7c19529d017c55f24137493b&gns=Indeed \n Mullen Coughlin is an Equal Opportunity Employer and believes in strength in diversity.\nMullen Coughlin is not accepting resumes from search firms for this position.\nRelocation assistance is not provided for this position.\nApplicant must be authorized to work in the United States of America. \n \n \n Job Type: Full-time Pay: From $22.50 per hour Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Parental leave • Referral program • Vision insurance Schedule: • 8 hour shift • Day shift • Monday to Friday • Overtime Supplemental pay types: • Bonus opportunities Work Location: In person"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=6a165e498e7cf998&fccid=de4ab728247839e7&vjs=3",
                "title": "Security Analyst",
                "company": "Energage",
                "location": "Exton, PA",
                "salary": "Not Available",
                "description": "Your Mission as a Security Analyst is to assure security and privacy at Energage and its employees. This mission is achieved through constantly improving controls and procedures based on the policies we adhere to. The Security Analyst is vital to improving information security and privacy at Energage, and in turn this helps the company achieve business growth and success. Energage has employees in 17 states and has an office in Exton PA. This is a flexible hybrid role. The Security Analyst should be able to come to the office as needed to provide support to our business operations and to collaborate with other team members. They will not be expected to come on a set number of days per week or specific days regularly but need to be within a commutable distance. Out of region candidates will not be considered for this role. Accountability & Impact:\nIn this role, you'll... \n • Provisioning new users, by onboarding and offboarding employees. • Participate and troubleshoot privileged Identity and access management • Support and troubleshoot Security software issues on Windows and Apple endpoints • Assist in development and implementation information security policies, standards, guidelines, and best practices • Participate and develop security improvements in Cloud infrastructure • Conduct internal risk management analysis of security and privacy compliances against such standards as NIST, ISO and GDPR • Perform weekly operational tasks, • Participate in developing and promoting positive security awareness training • Participate in vulnerability assessment and patch management program • Perform vendor risk assessments and respond to client risk assessments • Monitor and respond to security events alerts from security and information event monitoring • Participate in developing and promoting positive security awareness training • Administration of endpoint security solutions, such as Anti-Virus and MDM Solutions • Participate in incident response plan and procedures, from investigating suspicious events to help running annual drills • Review Energage current and future security controls for validating compliance controls related to NIST, ISO and GDPR • Managing the office 365 suite of solutions, including Active Directory and Domain server (DNS) What You Bring to the Role: • 3+ years IT security-related experience • Information Security related experience, in areas such as: SOC, vulnerability management and patch management, incident handling, log analysis, intrusion detection, or firewall administration. • Experience in administering endpoint security solutions • Implementing security controls within endpoints to network and cloud infrastructure. • Collaborator and contributing on selection security solutions • Experience in successfully managing multiple competing priorities • Effective communications skills to collaborate on new and existing security programs with various departments Preferred/Nice to have: • Security+, Network+ and CISSP certification • Technical experience in Cloud technologies Benefits of Working at Energage: • 3+ weeks paid time off • Flexibility to balance work and life • Company pays portion of health care premium • Option to participate in a company-sponsored 401(k) with match • Training and education • Professional Coaching Benefit available to all employees • Financial Wellness and Coaching • Free Subscription to the CALM app • Tuition reimbursement program • Opportunity to work for a purpose-driven organization using business as a force for good (https://www.bcorporation.net/) \n  About Energage: Energage is a purpose-driven company, and founding B Corporation, that helps organizations turn employee feedback into useful business intelligence and credible employer recognition through Top Workplaces. Built on 17 years of culture research and the results from 23 million employees surveyed across more than 70,000 organizations, Energage delivers the most accurate competitive benchmark available. With access to a unique combination of patented analytic tools and expert guidance, Energage customers lead the competition with an engaged workforce and an opportunity to gain recognition for their people-first approach to culture. For more information or to nominate your organization, visit energage.com or topworkplaces.com. Energage is committed to fostering a diverse and inclusive environment. We are proud to be an equal opportunity employer. Energage encourages all qualified candidates to apply, including those of any race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=91489a85510148f0&fccid=aeb15e43a6800b9d&vjs=3",
                "title": "Information Systems Security Officer, Classified Cybersecurity ISSO",
                "company": "Lockheed Martin Corporation",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "JOB ID: 657323BR Date posted: Nov. 21, 2023 \n Description: This position requires a TS/SCI clearance prior to start and the ability to obtain a Polygraph. \n \n \n \n \n \n \n • You will have a direct impact to national security, ultimately contributing to protecting your loved ones – this is dynamic, gratifying and impactful work! • You will have the opportunity to engage in all aspects of the cyber discipline • You can enjoy a work-life balance that allows for flex hours and a family-first culture • You get to be a part of a company widely recognized as a top employer for women, people of color and veterans – a highly inclusive culture and ranked #11 in Forbes 2022 \"World's Best Employers\" \n \n • Oversee day-to-day information system security operations including hardware and software implementations. • Carry out technical administration of IS in accordance with internal LM and customer security requirements, primarily Risk Management Framework (RMF). • Upkeep, monitor, analyze, and respond to network and security events. • Document compliance actions within the approved automated compliance tracking system or develop a plan of actions and milestones (POA&M) with the Information Systems Security Manager (ISSM) to address non-compliance in the allotted time frame. • Ensure systems are operated, maintained, and disposed of in accordance with internal security policies and practices outlined in the security plan. • Balance competing priorities amongst multiple customers and programs. • Auditing is a large part of this role’s responsibility. \n Candidate will typically have a Bachelor's Degree and 5+ years of experience. \n Basic Qualifications: \n • Current TS/SCI with ability to obtain a Polygraph • DoD 8570 IAT Level II certification or ability to obtain within 6 months of hire • Information Systems auditing experience • Knowledgeable of operating system security requirements • Hands on experience with industry standard Information Assurance tools Desired Skills: \n • Experience with RMF • Experience with Security Directives, Policies, Publications and Regulations Security Clearance Statement: \n Clearance Level: \n Other Important Information You Should Know \n Expression of Interest: \n Ability to Work Remotely: \n Work Schedules: \n Schedule for this Position: \n Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. \n \n \n \n \n \n Experience Level: \n Business Unit: \n Relocation Available: \n Career Area: \n Type: \n Shift: \n At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer:"
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=8774acc9a3779c48&fccid=510aa29fcf8f87d9&vjs=3",
                "title": "Cloud Security Engineer, Specialist",
                "company": "Vanguard",
                "location": "Location Not Found",
                "salary": "Not Available",
                "description": "Global Risk and Security (GR&S) at Vanguard enables business strategy, protects client and Vanguard interests (e.g., assets and data), and stewards a strong risk culture. Our teams leverage enterprise-wide insights, deep expertise, and trusted advice so that across Vanguard leaders and crew drive faster, stronger, risk-informed decisions.  Within GR&S, the Enterprise Security and Fraud (ES&F) sub-division is responsible for the global protection of Vanguard crew, property, data, and client assets. We are the trusted advisors that protect the pride of Vanguard with state-of-the-art security and fraud capabilities. We are a world-class destination of highly-engaged, passionate, and diverse talent expected to continuously learn and develop in an ever-changing security landscape.  Do you have an interest in building solutions that will continue to further strengthen Vanguard’s security fingerprint, while simplifying and improving the end user experience? If so, Cloud Security Engineering is currently seeking a Full Stack, Front End focused, AWS Cloud Engineer with sound knowledge or a growing curiosity for AWS, security tools and assurance processes. As a Security Developer within the Cloud Security Engineering, you will have the opportunity to engineer (i.e., plan, develop, release) Global Authentication Services (i.e., Federations, OKTA SSO, 2-Factor Authentication), both on premise and as part of a Cloud offering. Security is without doubt a critical factor for market success and is an exciting field. This is an excellent opportunity for you to grow in your career, provide influence and extend your skills. \n \n  The ideal candidate will have the following knowledge: • Lean principles, including Shift left, DevOps, CloudOps, continuous delivery; experience with Maven, Bitbucket, Cucumber testing, Bamboo, GIT, etc. is highly preferred. • Knowledge of TomCat Server and Apache • Experience working with various Database systems (e.g., Oracle, SQL, RDS) • Experience working with either Encryption (i.e., Data encryption) or Federation (i.e., SAML 2.0, OpenID Connect, etc...) services and/or a willingness to learn • Large program experience, specifically with implementation of a packaged system  In this role, you will: • Implement, and deploy security cloud platforms to support and mitigate security threats, risks and technology vulnerabilities. Identifies and recommends opportunities for improvement and performance issue solutions. • Provide intermediate level technical support and monitors security technologies efficiency through the use of monitoring tools and applications. Maintains comprehensive technical knowledge of cloud software and infrastructure platforms. • Develop technical standards, testing, log analysis and vulnerability assessments; evaluating and recommending on procedures used to mitigate risks. • Train and mentor staff and IT project teams, providing guidance and consultation as required. Update, write, and maintain documentation for the department. • Administer systems by actively managing patching, routine maintenance and backups to include the scheduling and execution of related tasks. Evaluating system performance and capacity in a large distributed infrastructure environment • . Participate in special projects and performs other duties as assigned.  What it takes: • Minimum of three years related work experience. • Undergraduate degree in a related field or the equivalent combination of training and experience. • Strong written and oral communication skills • Strong analysis and problem solving skills • Strong planning and organizational skills  Special Factors: • Weekday coverage: Regularly scheduled 5-day week, Mon. - Fri., normal business hours. Weekday coverage: Regularly scheduled 5-day week, Mon. - Fri., normal business hours. • On call and remote support off hours when needed. On call and remote support off hours when needed. • Vanguard is not offering visa sponsorship for this position. Vanguard is not offering visa sponsorship for this position.  Special Factors Sponsorship  About Vanguard We are Vanguard. Together, we’re changing the way the world invests.  For us, investing doesn’t just end in value. It starts with values. Because when you invest with courage, when you invest with clarity, and when you invest with care, you can get so much more in return. We invest with purpose – and that’s how we’ve become a global market leader. Here, we grow by doing the right thing for the people we serve. And so can you.  We want to make success accessible to everyone. This is our opportunity. Let’s make it count.  Inclusion Statement Vanguard’s continued commitment to diversity and inclusion is firmly rooted in our culture. Every decision we make to best serve our clients, crew (internally employees are referred to as crew), and communities is guided by one simple statement: “Do the right thing.”  We believe that a critical aspect of doing the right thing requires building diverse, inclusive, and highly effective teams of individuals who are as unique as the clients they serve. We empower our crew to contribute their distinct strengths to achieving Vanguard’s core purpose through our values.  When all crew members feel valued and included, our ability to collaborate and innovate is amplified, and we are united in delivering on Vanguard's core purpose.  Our core purpose: To take a stand for all investors, to treat them fairly, and to give them the best chance for investment success.  How We Work Vanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
            },
            {
                "url": "https://www.indeed.com/rc/clk?jk=8ef0ab19f6dd080f&fccid=289e75237f4c1edd&vjs=3",
                "title": "Cyber Security Engineer II",
                "company": "AmeriHealth Caritas",
                "location": "Philadelphia, PA 19103",
                "salary": "Not Available",
                "description": "Your career starts now. We’re looking for the next generation of health care leaders. At AmeriHealth Caritas, we’re passionate about helping people get care, stay well and build healthy communities. As one of the nation's leaders in health care solutions, we offer our associates the opportunity to impact the lives of millions of people through our national footprint of products, services and award-winning programs. AmeriHealth Caritas is seeking talented, passionate individuals to join our team. Together we can build healthier communities. If you want to make a difference, we’d like to hear from you. Headquartered in Newtown Square, AmeriHealth Caritas is a mission-driven organization with more than 30 years of experience. We deliver comprehensive, outcomes-driven care to those who need it most. We offer integrated managed care products, pharmaceutical benefit management and specialty pharmacy services, behavioral health services, and other administrative services. Discover more about us at www.amerihealthcaritas.com.  We are seeking candidates that are comfortable working in a rapid response environment addressing cyber incidents such as malware infections, phishing campaigns and network intrusions. The ideal candidate will be passionate about protecting information systems from cyber threats and be up-to-date with the latest developments and trends in cybersecurity. A successful candidate will be responsible for utilizing our industries best in class security platforms to identify, contain and eradicate risk. Responsibilities: • Perform critical event correlation based on information from the company’s information security systems. • Monitors the company’s proxy and content filtering solution for policy violations. • Measures effectiveness of defense-in-depth architecture against known vulnerabilities. • Plans and conducts technical risk assessments across all information technology applications and systems to identify security related issues for the organization’s computing environment. • Collaborates with Human Resources and Legal Departments to identify and confirm employee misconduct. • Collaborates with the Human Resources and Legal Departments to coordinate data preservation and examination for internal investigations and/or litigation. • In concert with the computer incident response team (CIRT), responds to network intrusions by identifying the source of the intrusion and associated attack vector(s). Develops and implements a remediation plan. • Maintains current knowledge in the best practices and technological developments concerning information technology risk management, to include network and system security as well as computer forensics. Qualifications / Requirements: • Three (3) to five (5) years of Cyber Security or Information Security experience. • Ability to learn quickly and adapt to new and changing ideas/concepts. • Experience with security tools and technologies such as endpoint detection and response, SEIM, SOAR, email gateways, and asset tracking systems. • Develop, maintain and strengthen partnerships with other departments to provide information support and collaboration of ideas, standards and goals. • Must have excellent oral and written communication skills with attention to detail. • Ability to solve complex problems. • Perform duties with minimal management oversight. • Some travel may be required for seminars and training. • Must be willing/able to provide an occasional 24 x 7 On-call support on a rotating schedule throughout the year. • BA/BS Degree in Computer Science, Information Security or related field."
            }
        ],
        "metadata": {
            "source": "https://www.indeed.com/jobs?q=Cybersecurity&l=Philadelphia",
            "timestamp": "2023-11-28T00:56:07.356688"
        }
    }
]