{
    "domain": "cybersecurity",
    "url": "https://www.indeed.com/jobs?q=cybersecurity&l=Philadelphia",
    "data": [
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZkFBy4Qr63BQKSyytxWB3ShPhLRyFkEHC_ouaWBu8rx-SBjqS8s9tmfY-GxOStErf2sfkvHKh1CDB3LRjI91A-fFkv1E_s1RTfikgPttU-CV5tjSe1zpPEjPci4UEFroANdMSnr62xG9BToBaDrMGGm-Rc4SChVDvampvdgFlUCPrREZ5V94I3MncS_VM18tzdpezZqP5PjeSNnKgVRUNymvgtlTpWwFYImIyiqdzOGaV5ClPBw8iscCgx1fmb6D0DyrvYRc1b6WGK57QQgqq9AuzWtZ7T6iCRGcsJcUIhnfSp9LFCS-RpM4OHd8os21580UL-PE4ifTa2Z6L1McpeFPBZhVSqKmoRT1k0vgmK4Ef7JdeTgELm_BoEJn-hgc33MalgFb41_A3mLtuZW-SbnJyBzmqcR2sRjmTomZOqqrVDFNbKc732NqqSD_ABgH7_lFX-QXhQ_yAnERWR4XKexw1sEacpFgpb1Hn-3NwSKzAQRujDjk1OksLoZNdyhqpramT_Bs80tqiiB1_LM9aLcMrfBx5uBG2XALlKU39FxW10txbp6ihaKo9MuUrdSqiAYuCoBP5Pzs2D4yR_hqPynuIbej289bMcTXMqN43uFLML8yUzQKO1zn4Gb0i7NoaX2OfBfJyaG1luX7GaPMOuGXm8eFXY10J3YgnScxJSM_3zTiYS3vIdk0C8ZIOj4CdGBGKN65V_Ln-yTNDfdXeFM5GTUP3p6VQ1fBh_E9xxpGKEL-JZ6gbJCwIZum_6s9ZgMtx4oEyvMb-__b9C7ESohPphZWb7e9ggLfd-9Vl3jJfZoWlUvo1Hu3CnYh4Se0FFpYRFkVvgbvdTIl0p3q_LEKxJvCLNVKAb2Xh74k8I9U7lmIYCRIFZCExFhcQM2oE5SiCGvxASNlVWUIb9cjbMsro25Ygu00-BX0H9fn_MHnobU6Ee1zEbmEdkiq_ET9T90SYWDa30U6P9ZH71ju15BOpVUfWyPBofenOZ9FYlPeLitEmFoE1-_NAoInGUy4uybCqrXMK-_aQ2CH8rnygG8hoM6sF_PpvPyTfiUqasFqYaYSn-Mtvr-2TcT1DV9E6SHKgjqHkfErGG-LBnsQelfUjBzbl-9Gfy0HfXF8NufeMjd4y6VRgzypRYpfdChHf6Gv9rh3kDM-h-u036N6nPeqaAMDlVBfTD8OpXs2KpUzkarsE__ND2ngm-qmiQX2M-6ZlGMTw6DzNkzLrsunqhHfYFBhfmsgvkyfwC1v1WEKQgvboRaJ24l7DI2ukHgFOKgmc-rnI7ieCTjnj_Tk7CQDmIGQpFign6UWiP5olxz5CAU-9EaLXfo=&xkcb=SoAu-_M3HJjL3f2aix0LbzkdCdPP&p=0&fvj=0&vjs=3",
            "title": "Comcast Cybersecurity: Executive Director, Cyber Security Engineering",
            "company": "Comcast",
            "location": "Philadelphia, PA 19103",
            "salary": "$177,581.69 - $302,696.06 a year",
            "description": "Job Summary Job Description • Reviews and presents operating and capital budgets including forecasts of operations, development, testing and any specialized needs to senior management. • Supervises operations and ensures business strategies and objectives are being met in a structured and concise manner. Delivers strategies and objectives within the department and across the organization. • Evaluates overall work processes and standard procedures to ensure performance is to company and industry standards. • Continuously develops staff through ongoing training programs, operational procedures and policies and develops staff organizational and technical skills etc. • Sets the reporting standards and then works with the Manager of Engineering to analyze reports for such issues as schedule completions for testing, spend levels for NRE costs, yearly license costs etc. • Stays knowledgeable of competition and important new technologies and standards. • Applies background and understanding of Network protocols at all layers, Secure Routing, DNS/DNSSEC, Network Device Security for a broad spectrum of vendors and devices, experience with SDN and automation, understanding and expert ability to fix network issues and network stacks of different platforms, e.g. TCP tuning, queue management for various OSs, Experience with operations at scale, H/A architecture and strategies. • Consistent exercise of independent judgment and discretion in matters of significance. • Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as vital. • Other duties and responsibilities as assigned.  • Understand our Operating Principles; make them the guidelines for how you do your job • Be responsible for the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services • Know your stuff - be enthusiastic learners, users and advocates of our groundbreaking technology, products and services, especially our digital tools and experiences • Win as a team - make big things happen by working together and being open to new insights • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers • Drive results and growth • Respect and promote inclusion and diversity • Do what's right for each other, our customers, investors and our communities  Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Comcast will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law, including the Los Angeles Fair Chance Initiative for Hiring Ordinance and the San Francisco Fair Chance Ordinance. Education Master's Degree, Master's Degree, Master's Degree, Master's Degree, Master's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 10 Years + Salary: Pay Range: This job can be performed in California with a Pay Range of $177,581.69 - $302,696.06 Comcast intends to offer the selected candidate base pay within this range, dependent on job-related, non-discriminatory factors such as experience. Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=82cde4e5ee1fda05&fccid=4d297a7bcd1c7be4&vjs=3",
            "title": "Security Incident Response",
            "company": "Lincoln Financial",
            "location": "Radnor, PA",
            "salary": "$90,000 - $175,000 a year",
            "description": " Date: Nov 20, 2023 Primary Location: Radnor, PA, US Company: Lincoln Financial • Monitor, defend and protect perimeter interface for malicious network traffic. • Responding to host based alerts • Performing network analysis of egress and ingress traffic. • Conduct real-time analysis using the SIEM and other security analytics tools. • Responsible for correlation and initial triage of security events and indicators generated by security monitoring tools. • Perform triage and response activities related to suspected phishing emails. • Identifies and recommends process improvements that significantly reduce workloads or improve quality for his/her assigned area(s) of responsibility. • Maintains knowledge on current and emerging developments/trends for assigned area(s) of responsibility, assesses the impact, and collaborates with management to incorporate new trends and developments in current and future solutions. • Administer more complex requests and questions received via phone, e-mail, or an internal ticketing system in a timely and detail-oriented fashion in order to resolve a multitude of cyber security related situations. • Maintain availability of security technologies, such as IDS/IPS, Web Application Firewall, DLP, syslog, vulnerability scanners • 3 - 5+ Years Experience with one or more of the following technologies: IPS, DLP, WAF, Content Filtering, Malware Detection, Vulnerability Management. • 2 - 5+ Years Information Security related experience, in areas such as: security operations, incident analysis, incident handling, and vulnerability management or testing, system patching, log analysis, intrusion detection, or firewall administration. • 4 Year/Bachelor's degree or equivalent work experience • A clearly defined career framework to help you successfully manage your career • Leadership development and virtual training opportunities • PTO/parental leave • Competitive 401K and employee benefits • Free financial counseling, health coaching and employee assistance program • Tuition assistance program • A leadership team that prioritizes your health and well-being; offering a remote work environment and flexible work hybrid situations • Effective productivity/technology tools and training "
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Bm6HJxcY0Tqjaa3n41Rv68Ym0q5XegBsUyML2tebqrB52ZzFs-BVLiFXAGOR5TT4dI581z49sjS_vmFMzXjg4HQkD2izlNoomc2Fehwjp8ZXRQ6kmQqNc6G72kHxl4ytFCVUBk5364IWgfNZPypVJ99Vlu_AjJRGKO1ugqIUQTZjOYIlUg-7C1bCCHkhOFRhc_cviUcholq08nGOxKDgWppjFNzAi91FZWB5kUtfmYs_iM471cwBKjFeLj88MEqSDNvAwxB_Nfv6unXuG0hoixLLycfV7sOXPgVQ5JxmWtwS2WnbWGu4e_-TB0x3RQ1F1KWX9jv5BK_H8Eq86C9bBuU7Yf-ekq8Z19MzujTfxNGV11t5tPqK9I4DQOAY4xl3ErY_vi7tdg0ylZrK_U6bMhRaGRtk49vvoiocMeNlisPr0J-Vcz6FjiNkctNj7ekgj5aqq12IUsJg1HRiWkbaSol0VF5E0OsVUUsHd3gudtgIqR8pcTxR5RtEgW_7JOBA-WAcd_dPfq8jLgNU0PmxULV_WEy_-8SMG-TYZS4_CYZ8jWlojOQOd29dQtm0Sv8M-PVebrGl50U54VbtYqNmUkBPHyCZ1JCLQFRqqJXqIqtmSJsRbQJdjCqqVdlRDOnUMUgySV4Oq6EmngqP6sUETXAU3494-WXEndULgDhDQyEmYGXjMy9uO5QDuWCDmOPqvSY0b7pGatM0iiYY5bgRmS&xkcb=SoAH-_M3HJjL3f2aix0JbzkdCdPP&p=2&fvj=0&vjs=3",
            "title": "Cybersecurity/Data Privacy Incident Response Attorney (Remote)",
            "company": "Latitude",
            "location": "Philadelphia, PA",
            "salary": "Salary Not Available",
            "description": "• Work in a highly collaborative, team environment to provide legal counsel to organizations investigating and responding to data privacy and cybersecurity incidents • Collect information needed to understand the issue and scope of each situation, engage and direct experts needed to appropriately investigate and respond to the event, and communicate to regulatory bodies, law enforcement agencies, and other third-parties as needed while advising clients throughout the investigation • Due to the unpredictable nature of cybersecurity events, all partners and associates participate in a rotating on-call schedule to provide crisis management support to client • 3-5 years of legal experience; cybersecurity experience is preferred but would consider someone with willingness to learn/be trained in cyber law • Licensed to practice in any U.S. state • J.D. from an accredited law school • Exceptional analytical, written, communication, and preparation skills, plus focused attention to detail are key to performing well in this highly responsive environment • Initiative and the ability to independently maintain your own caseload • Ability to thrive in a fast-paced, professional law firm setting • Excellent written and oral advocacy skills • Type of Role: Permanent • Schedule: Full-time • Location: Remote or Hybrid (Suburbs of Philadelphia, PA) • Follow Latitude on LinkedIn • See More Latitude Jobs • See Complimentary Latitude Resources • Find a Great Attorney or Other Legal Professional for your Legal Team"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=f817189588c8714a&fccid=dc3a418540402632&vjs=3",
            "title": "Cybersecurity Specialist (100% Remote)",
            "company": "MEDLOGIX, LLC",
            "location": "Lansdale, PA 19446",
            "salary": "Salary Not Available",
            "description": "Medlogix delivers innovative medical claims solutions through a seamless collaboration of our Medlogix® technology, our highly skilled staff, access to our premier health care provider networks, and our commitment to keeping our clients’ needs as our top priority. Medlogix has a powerful mix of medical expertise, proven processes and innovative technology that delivers a more efficient, disciplined insurance claims process. The result is lower expenses and increased productivity for the auto insurance and workers’ compensation insurance carriers; third party administrators (TPAs); and government entities we serve. This is a 100% remote opportunity. Job Summary: As a Cybersecurity Specialist at Medlogix, you will play a pivotal role in identifying, designing, and implementing technical security controls to protect business data. You will work closely with IT and Information Security leaders to understand the cybersecurity roadmap and collaborate with them to successfully implement improvements on an ongoing basis.  Responsibilities: Administration of Microsoft 365 Security: Configure, monitor, and manage Microsoft 365 security features, such as Conditional Access, Multi-Factor Authentication (MFA), Data Loss Prevention (DLP), and Azure Information Protection (AIP). Implement best practices to enhance the organization's security posture. Antivirus and Antimalware Solutions: Oversee the deployment, configuration, and maintenance of antivirus and antimalware tools across the network in conjunction with the Managed Security Services Provider. Antispam Solution Management: Administer the antispam/anti-phishing system, ensuring effective filtering and blocking of malicious emails and spam content. Stay updated with emerging spam and phishing techniques to continuously improve the solution's effectiveness. Security Incident Response: Understand and contribute to development of incident response plans for security events, including malware outbreaks, phishing attacks, and unauthorized access attempts. Act swiftly to contain, investigate, and remediate security incidents in partnership with the full Information Security Team. Security Patch Management: Collaborate with the IT team and Vulnerability Management Process to ensure timely and consistent application of security patches and updates on all systems, software, and security tools. User Education and Training: In conjunction with Managed Security Services Provider, participate in the delivery of simulated phishing campaigns and cybersecurity training sessions for employees, raising awareness about best practices, social engineering threats, and data security guidelines. Review “reported phish” alerts for legitimacy. Stay Current: Continuously monitor cybersecurity industry trends, emerging threats, and best practices. Improve your knowledge and share it with the IT & Security teams. Collaboration and Support: Work closely with the IT team to provide security-related support. Assist with the troubleshooting of security issues. Collaborate with other IT professionals to ensure smooth operations across all aspects of the organization's IT environment.  Qualifications: • Bachelor's degree in computer science, Information Security, or a related field (relevant certifications can be considered in lieu of a degree). • Certifications such as CompTIA Security+, Certified Information Systems Security Professional (CISSP), Certified Ethical Hacker (CEH), or Microsoft 365 Security Administrator Associate will be advantageous. • Proven experience as a Systems Administrator, IT Helpdesk, Project Engineer or similar role with hands-on experience in administering IT and/or Cybersecurity Operations. • Proficiency administering enterprise security solutions including:\nFirewalls\nMicrosoft 365\nAntispam / Anti-phishing tools\nAntivirus / Anti Malware tools\nWindows Servers and Workstations • Firewalls • Microsoft 365 • Antispam / Anti-phishing tools • Antivirus / Anti Malware tools • Windows Servers and Workstations • Familiarity with security frameworks and concepts (e.g., CIS, NIST, ISO 27001) and their application in private, for-profit business environments. • Excellent problem-solving skills, analytical thinking, and attention to detail. • Strong communication and interpersonal skills to interact effectively with team members and end-users. • Ability to work remotely and independently, manage multiple tasks, and meet deadlines in a fast-paced environment.  Medlogix provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=bab8767b0bbf8946&fccid=510aa29fcf8f87d9&vjs=3",
            "title": "Cloud Security Operations Analyst (remote)",
            "company": "Vanguard",
            "location": "Malvern, PA",
            "salary": "$90,000 - $150,000 a year",
            "description": " Global Risk and Security enables business strategy, protects client and Vanguard interests (e.g., assets and data), and stewards a strong risk culture. Our teams leverage enterprise-wide insights, deep expertise, and trusted advice so that across Vanguard leaders and crew drive faster, stronger, risk-informed decisions.\n\nWithin GR&S, the Enterprise Security and Fraud (ES&F) sub-division is responsible for the global protection of Vanguard crew, property, data, and client assets. We are the trusted advisors that protect the pride of Vanguard with state-of-the-art security and fraud capabilities. We are a world-class destination of highly-engaged, passionate, and diverse talent expected to continuously learn and develop in an ever-changing security landscape.\n\nDo you have prior experience either developing and/or implementing/engineering solutions on a cloud platform? Do you have some previous experience in a Security Operations Center? Do you want to take your current technical acumen to the next level? As a Cloud Security Operations Analyst, you will work closely with the team leads to help implement/design newly developed process and controls to further increase our cloud security posture using native and/or 3rd party mechanisms.  In this role, you will: • Provide senior level cyber security services to prevent, detect, respond to, and remediate threats. Coordinate with external and internal resources to develop and deliver new security solutions. • Utilize existing security controls to improve security posture, and research emerging threats relevant to operations. • Continually develop cloud architecture and security knowledge. Create Standard Operating Procedures (SOPs) for incident response triage. • Assist with the design and implementation of cyber security and operations procedures, tasks, and reports. Assist with automation of redundant processes. • Provide incident response triage support to other Cyber Security Operations teams. • Participate in special projects and performs other duties as assigned.  What it takes: • Minimum of three years related work experience, with two years of Cyber Security experience. • Undergraduate degree in Computer science, Management of Information Systems Security, or equivalent combination of training and experience. • CISSP, AWS Cloud Practitioner, or other cloud or cloud platform equivalent required. Special Factors Sponsorship About Vanguard We are Vanguard. Together, we’re changing the way the world invests.  For us, investing doesn’t just end in value. It starts with values. Because when you invest with courage, when you invest with clarity, and when you invest with care, you can get so much more in return. We invest with purpose – and that’s how we’ve become a global market leader. Here, we grow by doing the right thing for the people we serve. And so can you.  We want to make success accessible to everyone. This is our opportunity. Let’s make it count.  Inclusion Statement Vanguard’s continued commitment to diversity and inclusion is firmly rooted in our culture. Every decision we make to best serve our clients, crew (internally employees are referred to as crew), and communities is guided by one simple statement: “Do the right thing.”  We believe that a critical aspect of doing the right thing requires building diverse, inclusive, and highly effective teams of individuals who are as unique as the clients they serve. We empower our crew to contribute their distinct strengths to achieving Vanguard’s core purpose through our values.  When all crew members feel valued and included, our ability to collaborate and innovate is amplified, and we are united in delivering on Vanguard's core purpose.  Our core purpose: To take a stand for all investors, to treat them fairly, and to give them the best chance for investment success.  Future of Work During the pandemic, we transitioned to a work from home model for the majority of our crew and we continue to interview, hire, and on-board future crew remotely.  As we have developed the path forward, we have taken a thoughtful approach that both maximizes the advantages of working remotely and the many benefits of coming together and collaborating in a shared workspace. We believe that in-person interactions among our crew are important for preserving our unique culture and advantageous for the personal development of our crew.  When our Crew return to the office, many will work in our hybrid model. A smaller proportion of our crew will operate in the Work from Home work model (for example, field sales crew); or in the Work from Office model (for example, portfolio managers).  The working model that your role falls into will be communicated to you in the interview process – please do ask if you are unsure. We encourage you to make the decision regarding your job interview and offer knowing which model your role will fall into. We will test and learn as our ways of working evolve and will continue to evaluate working models along the way.  Salary Range:"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=7d8bb00623dcbe56&fccid=4cd66e5617f038d8&vjs=3",
            "title": "Network Security Associate",
            "company": "Susquehanna International Group",
            "location": "Bala-Cynwyd, PA",
            "salary": "Salary Not Available",
            "description": "• Bachelor’s degree in Information Security, Information Technology, Networking & Systems Administration or a similar technical discipline required • Strong grasp of TCP/IP, networking, operating systems fundamentals is required • Coding skills are required, Python, Perl, Bash or PowerShell are preferred • Experience in a network, security and/or systems administration function, or a similar role is preferred • Visa sponsorship is available for this position."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=e446ca6a8bb84b31&fccid=4cd66e5617f038d8&vjs=3",
            "title": "Security Engineer - Data Protection",
            "company": "Susquehanna International Group",
            "location": "Bala-Cynwyd, PA",
            "salary": "Salary Not Available",
            "description": "• Develop and engineer new solutions to improve existing data classification and protection technologies across the organization. • Work with teams within Security and across the organization internationally to understand and protect business critical data. • Design and execute on diverse projects to improve the data protection infrastructure and increase efficiency and detection rates. • Have the freedom and autonomy to dive deeply into related technologies, understanding how they work and their application to SIG, and how they could be a component in our next solution. • No two days are the same. Security challenges are best solved through a comprehensive multi-disciplinary approach, facilitating collaboration and exposure to high-end security technologies without having to silo your skills or career into artificially constrained buckets. • We encourage curiosity and knowledge sharing. You’ll be working with engineers who are always pushing each other to be better, ensuring they’re always learning, always teaching and always on the cutting edge of developments and trends within Information Security. • We take a proactive risk-based approach to solving security problems. Engineers are empowered to identify and remediate risks in our environment, tailoring solutions to our specific needs. • Take your ideas from inception to completion. Researching and designing innovative solutions to security problems, implementing them in a global technology environment, and supporting and adapting them to keep up with our fast paced ever changing business and security needs. • Bachelor’s degree in Information Security, Information Technology, Networking & Systems Administration, Computer Science or a similar technical discipline required • Strong technical understanding of information security concepts, common attacks and mitigation techniques, and ability to make risk-based decisions • Good understanding of operating systems internals and security practices • Good understanding of common network protocols • Python, PowerShell, or similar programming experience"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DiagSgEqvcBzWjNpUcJTXeVGLF-A6-a5JjYciP9DHoeSxL5tPqeSYgNUukWyYgXXr76wALgyfxPiA5TAPsNZjIe6nygwXUaYrFTZsv4jIQc5JXq86g3sBYTyKLl14txE92VB6O4-SCcjTdxPl_3HwmX09qiw-xoT55qkaU97F20BtfNZtHrKrdBQaT5mM2sLwdUnSugwgRMEZ1N0_70n-2Xjz8cfp3t_NjH4NpdJZIBDYGjzYmsmAsFPGnnUx0FGY7K8vcvDJYaW_VqJIEgrz0FnKLUdFndQF6hFqgnmWn3wEuIOs8x9iZFBhSJi9zMmGcdtZUuvFOI8r34j-T0wHoKQCcOozn7_MGNisDesqm6GgvAfVQjzzqnDn0UhJIaK4H0v36spdtjuTK2rahe6Iv6hstHaHn8yxOWOsiPSVfHNu3LLE5JFRcxAZaFXxBn-z2e3FWLy5DYDsIZBDnZ1IDWw4kSGLHR_vXsyW3ZP7RTeDuc_PAP1_q6EzW37UEMd8kZuhcFbA9prSR59l6W4_4rAd8k82f8yfb9-Y_iB6p2gCqxhoLCOyLNxhQflqaVxnqr8bqgW9Hz97kZbHdSAnMX4333_J8qZPA7MEKmCgfNM3gXVjsCGOm&xkcb=SoCg-_M3HJjL3f2aix0MbzkdCdPP&p=7&fvj=0&vjs=3",
            "title": "Information System Security Manager",
            "company": "Alutiiq",
            "location": "Philadelphia, PA 19112",
            "salary": "Salary Not Available",
            "description": "The Information Systems Security Manager will support an active Naval Surface Warfare Center Philadelphia Division (NSWCPD) contract in Philadelphia, PA. Under direct supervision, will assist in the implementation and maintenance of databases tracking inventory, product life cycle, preventive maintenance schedule, and customer service requests. Candidate will continuously monitor database performance and identify improvements. Support and supervise documentation of configuration change management procedures. • Complies with the responsibilities established in Section 2.6 of DoDEA Administrative • Instruction 8500.01 and Section 2.c.(2)(d) of Enclosure 4 of DoD Instruction 8510.01. • Maintains and reports IT/PIT assessment and authorization status and issues • Provides oversight of ISSOs to ensure that they are following established cybersecurity policies and procedures, in accordance with DoD Instruction 8500.01. • Monitors compliance with cybersecurity policy, as appropriate, and reviews the results of such monitoring. • Supports the ISO on the continuous monitoring security control assessment procedures to complete security responsibilities. • Ensures annual security control assessments are performed and the results entered into eMASS. • Ensures all users have the requisite security clearances and access authorization, and are aware of their cybersecurity responsibilities for DoD IS under their purview before being granted access to those systems. • Ensures that cybersecurity inspections, tests, and reviews are synchronized and coordinated with affected parties and organizations. • Acts as the primary cybersecurity technical advisor to the AO for DoD IT/ PIT systems under their purview. • Ensure CM policies and procedures for authorizing the use of hardware/software on an IS are followed. Any additions, changes or modifications to hardware, software, or firmware must be coordinated with the appropriate AO prior to the addition, change or modification. • Maintain a working knowledge of system functions, security policies, technical security safeguards, and operational security measures. • Manage, maintain, and execute the information security continuous monitoring plan. • Ensure a record is maintained of all security-related vulnerabilities and ensure serious or unresolved violations are reported to the AO/DAO; and Assess changes to the system, its environment, and operational needs that could affect the security authorization. • Develop concept of operations for new systems. • Develop and maintain a formal IS security program and policies for their assigned area of responsibility. • Provide technical and procedural Information System (IS) Security advice to government and industrial teams. • Develop and oversee operational information systems security implementation policy and guidelines. • Bachelor’s degree from Accredited University. • Four (4) years professional experience in computer systems analysis. • CNSSI 4012 or 4013 or 4014 or 4015 or 4016 Certificate or NDU CISO certificate or CCNA or CAP or Security + (CE), ENSA or DoD 8570 IAM II certification. • Active Department of Defense SECRET clearance required. • Pursuant to the Government Contract, you must be a U.S. Citizen."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=91489a85510148f0&fccid=aeb15e43a6800b9d&vjs=3",
            "title": "Information Systems Security Officer, Classified Cybersecurity ISSO",
            "company": "Lockheed Martin Corporation",
            "location": "King of Prussia, PA",
            "salary": "Salary Not Available",
            "description": "JOB ID: 657323BR Date posted: Nov. 21, 2023 Description: This position requires a TS/SCI clearance prior to start and the ability to obtain a Polygraph. • You will have a direct impact to national security, ultimately contributing to protecting your loved ones – this is dynamic, gratifying and impactful work! • You will have the opportunity to engage in all aspects of the cyber discipline • You can enjoy a work-life balance that allows for flex hours and a family-first culture • You get to be a part of a company widely recognized as a top employer for women, people of color and veterans – a highly inclusive culture and ranked #11 in Forbes 2022 \"World's Best Employers\" • Oversee day-to-day information system security operations including hardware and software implementations. • Carry out technical administration of IS in accordance with internal LM and customer security requirements, primarily Risk Management Framework (RMF). • Upkeep, monitor, analyze, and respond to network and security events. • Document compliance actions within the approved automated compliance tracking system or develop a plan of actions and milestones (POA&M) with the Information Systems Security Manager (ISSM) to address non-compliance in the allotted time frame. • Ensure systems are operated, maintained, and disposed of in accordance with internal security policies and practices outlined in the security plan. • Balance competing priorities amongst multiple customers and programs. • Auditing is a large part of this role’s responsibility. Candidate will typically have a Bachelor's Degree and 5+ years of experience. Basic Qualifications: • Current TS/SCI with ability to obtain a Polygraph • DoD 8570 IAT Level II certification or ability to obtain within 6 months of hire • Information Systems auditing experience • Knowledgeable of operating system security requirements • Hands on experience with industry standard Information Assurance tools Desired Skills: • Experience with RMF • Experience with Security Directives, Policies, Publications and Regulations Security Clearance Statement: Clearance Level: Other Important Information You Should Know Expression of Interest: Ability to Work Remotely: Work Schedules: Schedule for this Position: Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Experience Level: Business Unit: Relocation Available: Career Area: Type: Shift: At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer:"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=d7ff267da4d218b5&fccid=105cc25c3f5819cd&vjs=3",
            "title": "CYBERSECURITY ARCHITECT",
            "company": "Temple University Health System",
            "location": "2450 W Hunting Park Ave, Philadelphia, PA 19129",
            "salary": "Salary Not Available",
            "description": "CYBERSECURITY ARCHITECT  Your Tomorrow is Here! Temple Health is a dynamic network of outstanding hospitals, specialty centers, and physician practices that is advancing the fight against disease, pushing the boundaries of medical science, and educating future healthcare professionals. Temple Health consists of Temple University Hospital (TUH), Fox Chase Cancer Center, TUH-Jeanes Campus, TUH-Episcopal Campus, TUH-Northeastern Campus, Temple Physicians, Inc., and Temple Transport Team. Temple Health is proudly affiliated with the Lewis Katz School of Medicine at Temple University.  To support this mission, Temple Health is continuously recruiting top talent to join its diverse, 10,000 strong workforce that fosters a healthy, safe and productive environment for its patients, visitors, students and colleagues alike. At Temple Health, your tomorrow is here! Equal Opportunity Employer/Veterans/Disabled An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.  Your Tomorrow is Here! Temple Health is committed to setting new standards for preventing, diagnosing and treating major diseases in our community and across the nation. Achieving that goal means investing in our employees' success through staff and leadership development. Our recruitment strategy is to attract and retain a diverse, high performing workforce that fosters a healthy, safe and productive environment for our patients and colleagues alike. "
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=cf7187e5f19247fe&fccid=098f028fec64b983&vjs=3",
            "title": "Software Engineer III – Cybersecurity",
            "company": "RELX",
            "location": "Horsham, PA",
            "salary": "Salary Not Available",
            "description": "• You must be a U.S. citizen to apply for this position. • You must successfully pass a background investigation and achieve Public Trust security clearance. • ******REMOTE POSITION*******PREFERENCE for Candidates in the Eastern Time Zone • Collaborate with teams across Information Security and wider technology to define solution requirements by understanding moderately complex product requirements and translating into software designs • Demonstrate strong secure development processes, coding best practices and code reviews, while adhering to company policies and standards • Implement and support threat modeling, as required for the secure software development lifecycle for tools and systems • Support strong QA/ security testing processes in line with industry best practice and company policy • Participate in an iterative development process, such as within stand ups, backlog refinement, sprint planning and team demos • Report progress metrics on a regular basis • All other duties as assigned • Expertise in development/scripting languages, specifically C#, .NET, and SQL. Others are nice-2-have, such as Python, Javascript, PowerShell, etc. • Solid research skills with knowledge of industry software development best practices • Ability to interface competently, and effectively collaborate with internal and external technical personnel, team members and resources for finalizing requirements and other development-related activities • Ability to work independently and within small teams • Proficient in data manipulation languages, data modelling principles, normalization and data storage subsystems & optimization techniques • Solid ability to write and review portions of detailed specifications for the development of system components of moderate complexity • Good problem-solving experience with ability to solve moderately complex bug fixes • Good oral and written communications skills"
        },
        {
            "url": "https://www.indeed.com/company/Mullen-Coughlin-LLC/jobs/Administrative-Assistant-6eaf555b80ef9f4a?fccid=7e6bb98fc2637353&vjs=3",
            "title": "Administrative Assistant - Cybersecurity Law (Hybrid)",
            "company": "Mullen Coughlin LLC",
            "location": "Mullen Coughlin LLC in Devon, PA 19333",
            "salary": "From $22.50 an hour",
            "description": "Mullen Coughlin is a highly successful, fast growing niche law firm focused exclusively on counseling organizations in the context of data privacy, including incident response, regulatory investigation, single-plaintiff and class action litigation compliance. Committed to rapid incident response to incoming client calls, we thrive in a high energy, close-knit, and upbeat office culture. The Firm pays very competitively in the market and offers a full benefit package, including accrued time off, paid maternity and paternity leave, and a generous 401(k) program. At its new office, located at 426 West Lancaster Avenue, Devon, PA, Mullen Coughlin’s home office is over fifty-six thousand square feet, boasting the latest in technology and security, accommodating the projected continued growth of the firm, and providing all Mullen Coughlin employees access to amenities and resources to further their professional careers, as well as their health and well-being. The Administrative Assistant will work as part of a cohesive administrative team to support Partner and Associate Attorneys in our data privacy practice. This is a full-time position eligible for benefits with a daily schedule of 9:00am to 6:00pm (including a 1-hour lunch break) with initial training onsite and the potential to work from home up to 3 days per week following a 6 month review. Responsibilities • Maintain complex calendars. • Directly communicate with internal and external customers. • Intake new cases, open and close files. • Critical, deadline driven management of case work. • Draft and finalize deadline driven responses to regulatory agencies. • Draft and finalize professional correspondence. • Triage email communications. • Electronic filing of documents and electronic communications. • Collaborate and support the team to provide responsive customer service. • Coordinate travel arrangements. • Prepare expense reimbursement reports for submission. • Perform other administrative tasks as assigned. Skills & Qualifications • Ability to perform multiple tasks simultaneously with demanding time frames in an interrupt-driven work environment. • Working understanding of databases. • Strong, accurate typing and formatting skills. • Must be highly organized with a desire to learn and apply new concepts/skills on a continual basis. • Ability to communicate effectively, both orally and in writing. • Effective time management skills to balance workload of partner and associate attorneys, efficiently prioritizing requests. • Strong interpersonal skills. • Ability to work independently or collaboratively with team members. • Good analytical skills. • Ability to resolve issues quickly and efficiently. • Strong organizational skills and attention to detail. • ProLaw experience, a plus. • Demonstrated proficiency in computer software applications, including MS Office (Word, Excel, and PowerPoint); Outlook for calendaring meetings, events, etc. Ability to learn and use other applications, such as ProLaw. • Ability to adhere to standardized inter-department processes efficiently and accurately. • Ability to represent a positive and professional image. • Must have highest integrity, including the ability to treat confidential information appropriately. To Apply\nSubmit a cover letter and resume through our applicant tracking system by using the following link: https://www.mullen.law/careers/?gnk=job&gni=8a7887ac7c19529d017c55f24137493b&gns=Indeed Mullen Coughlin is an Equal Opportunity Employer and believes in strength in diversity.\nMullen Coughlin is not accepting resumes from search firms for this position.\nRelocation assistance is not provided for this position.\nApplicant must be authorized to work in the United States of America. Job Type: Full-time Pay: From $22.50 per hour Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Parental leave • Referral program • Vision insurance Schedule: • 8 hour shift • Day shift • Monday to Friday • Overtime Supplemental pay types: • Bonus opportunities Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=2018baefe5740ccf&fccid=6b4d8589813ead16&vjs=3",
            "title": "Python Developer (Cyber Security)",
            "company": "Brown Brothers Harriman",
            "location": "Philadelphia, PA",
            "salary": "Salary Not Available",
            "description": "• As a Python Software Engineer, you will be responsible for developing and maintaining software systems using Python, Django, SQL, Bash, Javascript, and other related technologies. • As a Python developer, you will be working on expanding and maintaining our Django web application, building and maintaining Plotly Dash-based visualizations, building and maintaining Python-based ETL applications, researching emerging technologies, and helping us manage our server infrastructure. • You will work closely with other engineers, product managers, and stakeholders to deliver high-quality software solutions that meet the needs of internal clients • You will write clean, efficient, and well-documented code that adheres to industry best practices and standards while utilizing development standards like version control and well-documented testing. • You will continuously review our software systems and identify areas for improvement, implementing new features, and optimizing performance; you will also leverage your experience to suggest processes to automate. • You will stay up to date with emerging technologies and industry trends and apply them to software systems as appropriate. • 5+ years of experience in software development using Python (including Django and Plotly Dash) and SQL. Familiarity and experience with object-oriented design a big plus. • Strong understanding of software development principles and best practices, including Agile methodologies, version control, and testing. • Strong problem-solving skills and ability to troubleshoot complex software systems. • Experience with front-end technologies (like JavaScript and HTML5) used in conjunction with Django and Plotly Dash. • Experience working with Linux-based infrastructure and services in a corporate setting. • Experience with secure coding principles and security best practices. • Excellent communication skills and ability to work collaboratively in a team environment or independently and manage multiple priorities and deadlines."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=8d51e6a541e4e108&fccid=6b4d8589813ead16&vjs=3",
            "title": "Cyber Security Operations Analyst",
            "company": "Brown Brothers Harriman",
            "location": "Philadelphia, PA",
            "salary": "Salary Not Available",
            "description": "• Day to day operations of BBH’s Cyber Intelligence Monitoring and Threat analysis. • Provide log analysis, real-time intrusion analysis, incident response, and security monitoring using a wide array of industry leading tools and technologies. • Investigating suspicious activities, alerts, and events detected by the security tools or reported by users and containing and preventing any potential incidents. • Analyzing and reporting on any information security issues, emerging trends, threats, and vulnerabilities affecting the organization or its industry. • Respond and perform analysis and risk assessment of all security events and incidents. • Provide related documentation in support of BBH regulatory guidelines (FFIEC, SOC2, NYDFS, etc.) and auditing initiatives. • Bi-weekly and Monthly reporting. • Maintain a working relationship with a 24x7 external cyber intelligence and threat monitoring service (MSSP) in support of our team. • Engage in security investigations and use tools to identify and report the outcomes of incidents to senior management. • Participate in discussions around security events and activities with various non-technical and technical parties. • Collaborate with various teams to manage security investigations and provide prevention solutions for cyber threats. • Follow the firm’s project management, SDLC disciplines to insure structured effectiveness in implementation and operations. • Responsibilities in working with tools in for identifying the firm’s security vulnerabilities. • Troubleshoot and work with vendors in identifying security vulnerabilities. • Collaborate with application and operation system teams to remediate any security vulnerability findings. • Recommend, and apply best practices for addressing ongoing threats. • Help support security tools that monitor the firm’s security configuration, changes, health, and baselines, such as SIEM, Anti-Virus and other cyber tools. • Respond to Endpoint protection and malware detection tools alerts following response templates. • Makes suggestions on tuning alert volumes. • Makes sure responses are remediated within SLA. • Bachelor’s Degree (or equivalent) or advanced degree highly desired. • 3+ years of Cyber Security experience. • Relevant or similar work experience in some of the following areas:\nSecurity Incident Response\nSecurity Operations management and maintaining IT general controls\nMalware analysis and remediation / Data Analysis\nDesigning and Operating enterprise security controls\nVulnerability & Patch management • Security Incident Response • Security Operations management and maintaining IT general controls • Malware analysis and remediation / Data Analysis • Designing and Operating enterprise security controls • Vulnerability & Patch management • Expertise with security assessment methodologies. • Some knowledge of networking protocols and related equipment. • Interest in packet analysis and forensic tools. • Familiar with Firewalls, IDS/IPS, Web Firewalls, Sandboxing, and other security tool terminology. • Interested in scripting with Bash, Batch, Perl, or Python. • Data Analysis using Excel. • Interest in Unix/Linux & Windows operating systems and privilege access. • Data analysis of various security logs. • Interest in security trends and threat intelligence. • SIEM technologies and correlation. • Familiarity in cyber security forensics is a plus. • Some rotating, 24 x 7 on-call responsibility."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=6a8b9cb511bf1dad&fccid=cce48ad42816872f&vjs=3",
            "title": "Cyber Security Analyst II",
            "company": "Jefferson - Center City, Philadelphia, PA",
            "location": "Philadelphia, PA 19107",
            "salary": "Salary Not Available",
            "description": "PRIMARY FUNCTION: The Cyber Security Analyst is responsible for maintaining the integrity and security of enterprise-wide systems, network and applications at Jefferson. Supports cyber security initiatives through predictive and reactive analysis, articulating emerging trends to leadership and staff. Be an active player during enterprise incident response efforts, driving incidents to timely and complete resolution. Reviews threat data from various sources and develops detection and response capabilities, correlates actionable security events into Security Event and Incident Management platform. Utilizes understanding of attack signatures, tactics, techniques and procedures associated with advanced cyber security threats. Develops analytical products and process fusing enterprise and all-source intelligence.  ESSENTIAL FUNCTIONS: • Develop and carry out information security policies and standards • Develop or implement cyber security tool set to assist in detection, prevention and analysis of security threats. • Develops security strategies to respond to and recover from a security breach with strong understanding of Security Operation Center (SOC) operations both on premise and managed. • Awareness training of the workforce on cyber security standards, polices and best practices • Experience using Windows / Unix / Linux / iOS systems in server and workstation environments. Strong understanding of hardware / software and cloud environments. • Expert in analyzing and investigating network and system intrusions, malware attacks and recommend / implement prevention methods. • Experience with Data Loss Prevention (DLP) systems, implementation and process in on premise and cloud environment. • Experience in cyber security incident response and breach investigations including forensic investigations. • Take ownership of multiple security products thru lifecycle e.g. DLP, Vulnerability Management, SIEM etc., • Must be able to co-ordinate project management and drive adoption of new capabilities. • Must mentor junior members in the team for success of their individual ownership • Must demonstrate 5+ years of successful security project & product delivery. • Reviews IT systems and business processes to identify information security risks and regulatory non-compliance, and guide remedy of issues noted. • Designs and delivers training on various Cyber Security initiatives. • Maintains familiarity with HIPAA / PCI-DSS and other Information Security regulations. • Interacts with co-workers, visitors, and other staff consistent with the iSCORE values of Jefferson. OTHER FUNCTIONS AND COMPETENCIES: • Active team player in cyber security projects at Jefferson. • Conducts various cyber security assessment including risk assessments, DLP assessments, Vulnerability assessment and remediation and reporting • Generates information security metrics by collecting and reporting on data from various systems and methods. • Supports other information security operations as required Bachelor’s degree in an information technology field preferred At least one information security certification, such as a SSCP, GSEC, or professional certificate required. CISSP or CISM preferred _________________________________________________________________________ At least five years of experience in an information security function, ability to multi-task, a keen eye for detail, strong organizational skills, the ability to thrive in fast-paced, high-stress situations, ability to communicate cyber security issues to peers and management. 3+ years solid understanding of Cyber Security & IT controls, network / systems / application penetration testing and vulnerability assessments. Experience with NIST and ISO frameworks. Solid knowledge of HIPAA, HITECH, and other IT security governing bodies. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        }
    ],
    "metadata": {
        "source": "https://www.indeed.com/jobs?q=cybersecurity&l=Philadelphia",
        "timestamp": "2023-11-27T19:35:08.825105"
    }
}