{
    "domain": "Healthcare",
    "url": "https://www.indeed.com/jobs?q=Healthcare&l=Philadelphia",
    "data": [
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DAIiH2EvOf24L-YGMWQQgB8-fJqqLMqTBAk__gwXG5rGPsmcOHbp0ImcaJGJ9cA3dR3FEXMQSuKYaR5o2fOEEeu1UKNAWF16L2_iXUzqvy3WkrBWl6VECano-3avPubiWo574HATz9rAQKcyXtR_UbH0sGYGG7QdNVz5_O8W52-ygLMgtKsniwW9CbOXzqvTQsJv30XwWMR4lYar3eJv_uwQCydb6jNbldX2L2WznrDsU3vTDHG4eJUhirk0zSIUimhoPY9LaE680g4QPv4KFC_MNqZ2B_e24I9EmMxTa3HYeAhcZfLNMRCvnL7gN_u_tA2Na7rWDuoNBoinBJcPKptzdeBQSkUZ_wF36qEK21B57PSzs7nhSPXAbNdEC_DSp-Lv_5EbPG4u56U--ue4OHrRKKcjNYuflEkUaVrCLEvgJUpnxpRh9kqJ7vHMS9I7PewEwIOw_lhInsLwunx_gFEq8hsHkpdso8658-JqNdih6LA0EqB8BZ36ibS-6cuxjmIOuiaOv-3qxGNrUYAwtr0bC-KRnQhASJPJqnIZLspSQAFXog0Igs3EESBVaJ1sQ5kbw7p6jGTz1h8y-H7hQw5wqbd624Iz4V0XlN3HAAfIE9tJGbH2Eh&xkcb=SoDv-_M3HKCHxKzOpJ0LbzkdCdPP&p=0&fvj=1&vjs=3",
            "title": "Speech and Language Pathologist",
            "company": "Sankofa Freedom Academy Charter School",
            "location": "Location Not Found",
            "salary": "$76,101 - $81,371 a year",
            "description": "About us Sankofa Freedom Academy Charter School is a small business in EDUCATION in Philadelphia, PA. We are professional, agile and professional. Our work environment includes: • Modern office setting • Food provided Responsibilities: - Evaluate and diagnose speech, language, communication, and swallowing disorders in patients of all ages\n- Develop and implement individualized treatment plans to address patients' specific needs\n- Provide therapy sessions to improve speech, language, and communication skills\n- Collaborate with other healthcare professionals to coordinate patient care and ensure optimal outcomes\n- Educate patients and their families on strategies to improve communication and swallowing abilities\n- Keep detailed records of patient progress and adjust treatment plans as necessary\n- Stay up-to-date with advancements in the field of speech-language pathology \n \n \n \n \n \n Skills: - Experience working in an ICU or critical care setting\n- Strong patient care skills, particularly in acute care or hospital settings\n- Proficiency in conducting speech therapy sessions and utilizing appropriate techniques and tools\n- Knowledge of medical terminology related to speech-language pathology\n- Ability to conduct comprehensive patient assessments and develop appropriate treatment plans\n- Understanding of anatomy as it relates to speech production and swallowing function\n- Experience working with pediatric patients is a plus \n \n \n \n \n \n We are seeking a highly skilled Speech Language Pathologist who is passionate about helping patients improve their communication abilities. The successful candidate will have experience working in an ICU or critical care setting, providing speech therapy services to patients of all ages. Strong patient care skills, knowledge of medical terminology, and the ability to conduct thorough assessments are essential for this role. If you are dedicated to making a difference in the lives of individuals with speech, language, and swallowing disorders, we invite you to apply for this position. Job Type: Full-time Pay: $76,101.00 - $81,371.00 per year Benefits: • Dental insurance • Disability insurance • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Retirement plan • Tuition reimbursement • Vision insurance Schedule: • 8 hour shift Work setting: • In-person • School Ability to commute/relocate: • Philadelphia, PA 19125: Reliably commute or planning to relocate before starting work (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BlzvAt2nwF6UTWovZRHdbBk8iq3i-CxqkawuLwmy-bjFp4CzAEtopsc_dwdaOrcMejWOreaBsE3NYZdJ0w7IfQcCQ8O1p-TpVeuuhtxGLghS2PMqaRYqh9alJXDjiM4p_pe_6hmooEC5QXVOS4MhAUmoGiusShVq5uAskcKkLsaVpfaeJQUz7M94dkik7q5LQ6DFk4JQc9_vVKIcveid1yfpA3Bc_JXnGMB-qKJ1KH_-tlf0_tifaB5oMS9ffLGCH4Ewbr0Q2B6vsHCfNm56ZocYwxLgGEKbpWcoA8_7x3jsvEUrrgCsCO7V7vHqMEb1LCf93125j3HrF5xIfuO7ZwunYpGQr2HY02_2HvS3lrl_Uf9JvrkFMb7M0-00jj39lQJzvTg4fxopwYRjApaa8aNEplPO2DiGKkwvAFSozYGd068Dri4xkQHjHsPm9rMwqMfpARG12ALiK0hvuHwEGROVAw1ZpbcbpiRNf_SdcbQ8M2xtVUZzsW8emiQOqh5fci0rYKKoGiK1S1_4kX3a5R0l_eWcNg_L4zQ64bCoNM5UvBV2O8KcBeAgoO-EYiby4-0VX62T5MC0zInkbEkpCVY9IJiKZ5DkepjPvmmkudIdf4zSRWhlM0&xkcb=SoBb-_M3HKCHxKzOpJ0KbzkdCdPP&p=1&fvj=1&vjs=3",
            "title": "Registered Dental Hygienist",
            "company": "New Concept Dental",
            "location": "Philadelphia, PA",
            "salary": "Not Available",
            "description": "New Concept Dental is hiring immediately for a Dental Hygienist. One year of prior experience preferred but new grads are highly welcomed! We are looking for a self starter with a strong passion for Dentistry. Ideal candidate should be hands on and be able to identify the needs of the patient. We are a culture focused practice, where elevated patient care is supported by advanced technology, proactive leadership and superior clinical skills. We have a successful periodontal program in place where each patient is cared for on an individual basis. If you are looking to join a dynamic team of dedicated dental professionals, we encourage you to apply today! Duties and Responsibilities • Screening patients during checkups • Reviewing a patient’s dental history • Recommending care to improve a patient’s oral health • Teaching patients about proper teeth cleaning techniques • Performing preventive dental care • Applying fluoride treatments • Taking x-rays and reviewing them for signs of dental diseases Skills and Qualifications • Verbal and written communication skills • Problem-solving skills • Interpersonal skills • The ability to convey complex health information in a simple way • The ability to interact with young and old patients • Excellent critical-thinking skills • Drive to stay up to date on latest dental tools and methods Job Type: Full-time Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee discount • Health insurance • Professional development assistance • Referral program • Retirement plan Schedule: • No weekends Ability to commute/relocate: • Philadelphia, PA: Reliably commute or planning to relocate before starting work (Required) License/Certification: • Registered Dental Hygienist License (Required) • X-Ray Certification (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CnCfuNvTdAzuudpiL5Gp0cQSi9w3td6p9UU6qiZRZ_9YdcLwa7TjEmd5wBX6e7ij_Kwvtrqa-OeAh18zl1NbIBwMZri7xwtbiH9VWJhfNnYMocVmB1-5GCGR5LWoLCAdIAlO-_1iss670lmwIhxfdvLE3mgOSrdK-SBQ3AcBkMXvaTsvS_wf__Y1UO5OHDRghbZNhVZpOrBMFnFwC3MkuayBYBXPPL03MIodSrfaeokECJvX7e9rcBgEPgQVxuKCO698yq2ndlnhCUbmXpK2DZtZvlkZGCYlIcnoGSRAx2bFmw12vzvwhDGNJnV_25UuNvUWUXL8LdyKzyXT0DKGk0a0Cx7d5CAT-GQ1FGxWmnjozkQpZgdDdxsD3fUT4ipNfHG0dfUlcd5O-WOFCP_KC0kE7hcThxrQUDaKcjzh9Zhb9dmMfgyXZVC3w9Zv7CiFFp3IcRN2oXPuUCXchAqmOG0CwzOszO4E-aYIUEYlqCCvvD9fo5a-VDV0Zx71m2KSUBiVRsMH8PHZ8AiyF21-HbSUo8z0juklyOEoDs75lX8VgeDIP5RwkPed1xWH34xM4Tj0eM_k_IZyNPngTgdOE301sQUc_svxo=&xkcb=SoDG-_M3HKCHxKzOpJ0JbzkdCdPP&p=2&fvj=1&vjs=3",
            "title": "Dental Hygienist",
            "company": "usmile dental group",
            "location": "Location Not Found",
            "salary": "$43 - $50 an hour",
            "description": "Responsibilities:\n- Perform dental hygiene procedures, including cleaning, scaling, and polishing teeth\n- Take and develop dental x-rays\n- Educate patients on proper oral hygiene techniques and provide personalized oral care instructions\n- Conduct thorough dental assessments and screenings for oral diseases and conditions\n- Administer local anesthesia\n- Maintain accurate patient records using Open Dental dental software systems \n \n \n \n \n \n Qualifications:\n- Valid state dental hygiene license\n- Graduation from an accredited dental hygiene program\n- Knowledge of medical coding for dental procedures\n- Excellent communication and interpersonal skills\n- Strong attention to detail and ability to maintain accurate records \n \n \n \n \n Please note that this job description is not exhaustive and additional duties may be assigned as needed. Job Type: Part-time Pay: $43.00 - $50.00 per hour Expected hours: 30 per week Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=50b42542e45854f8&fccid=cce48ad42816872f&vjs=3",
            "title": "Scheduler",
            "company": "Jefferson - Center City, Philadelphia, PA",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "• Screens patient calls and implements protocols for appropriateness of appointment. Confers with physician or allied health practitioner to determine if patient can be seen by physician. • Completes a full registration to secure a medical record number. Completes registration with complete accuracy to assure proper reimbursement to physician and Aria Health. • Takes messages and triages calls and directs to correct physician, allied health practitioner or department. • nstructs patients with correct information for appointment requirements such as labs, x-rays, location of appointment, insurance, referrals, directions and parking. • Manages a physician’s appointment scheduling, assuring maximum operational efficiencies. • Answers all calls for appointments, questions and other messages before the end of each business day for physicians and allied health practitioners. • Maintain and keep up all physician and AHP daily schedule changes. • Maintains confidentiality of information according to the policies and procedures of the Practice and Aria Health. • Performs other duties as assigned to assure patient satisfaction, quality patient care and efficient Practice operations. Education: High school diploma or GED.  Experience: At least two years of experience in a healthcare setting, preferably in a physician practice with a thorough knowledge of third party insurance, billing and reimbursement especially managed care. Proven knowledge of appointment scheduling and electronic registration. Two years experience in a physician practice is preferred. \n Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CoszEL89OHmmBh4OhnvxY52fuNqrSsIqVVALzWn9wEolk9ImJT6nzaLoPbWPEXXqZrYYoJuZbuBCKjCkH1luePGe7hV_GKF2FPC4WbnrFS-3H09ZLaCIe6SPnq3EDOau1SukqNAKDLaJKX9FXn1FPIbrP9Ils9UJ9cTDKS0oBpGS1W1lHoPJI7k1nwxCpJ5J4pWNEU8lZtSFsMGeeEgrXXjsljpmJLwYureNTufxa-00pjN2gKjtQ6k-mQt81YSRQUcNC7mA2POq87LJ4suCvfZQLfIhXLxfXVHpzYlbOyEJ7V56LTsHSFG9OiA1y9DscnbmNIkB8hhrxnhF1yeK4HiCrZOiWBOuE-5OvGQ8Eita09K-6tMLrbYcP7T9hFiw5D0yYTngykh8MoIuN-1eMwAbVaTjApNW-w0VGneu5pKaAOEy_iktP25hi56QF8E-Gm21tKuVQM63WQxeQQyl7262e-oNFUFE6M7_d-MbmVzPRMXh-4tw7i1j94c3-ghc-EOEWpAShX-DWMt8rqhU_Rnnod57ZDba_rlVU0FuhgfjYjGoSpzv5BfiSeGca6Rzto9GHy1xoWPdGM66NxsR2NcP7Bxqb5MpzcIyW9kuxZGLuLDjZWrVLr&xkcb=SoD8-_M3HKCHxKzOpJ0PbzkdCdPP&p=4&fvj=1&vjs=3",
            "title": "Pediatric Physical Therapist",
            "company": "JayCare Therapy",
            "location": "Location Not Found",
            "salary": "$90 - $100 an hour",
            "description": "JayCare Therapy is the leading provider of home-based early intervention services in Philadelphia County, PA The primary role of a Physical Therapist at JayCare is to help improve a child’s gross motor skills and enhancing their balance, mobility, coordination and strength. The care provided by a pediatric physical therapist is fundamental to promoting mobility in young children and improving their quality of life. The most important years for physical growth in children are ages birth to five. Brain development is most crucial during these years, so a developmentally-delayed child will benefit the most from early intervention physical therapist. As a Physical Therapist at JayCare, you should expect to: • Follow Individualized Family Service Plan (IFSP) and develop methodologies for reaching each child’s specific developmental goals. • Provide various strategies to family members or caregivers and facilitate active involvement to carry-over in day-to-day activity. • Provide services in different settings such as homes, daycares, centers, or other community settings. • Ensure that progress is evident and that family members or caregivers are active participants in early intervention through addressing specific goals and communicating with the entire team. Requirements: • Philadelphia Physical Therapy (PT) license • Strong Clinical & Interpersonal Skills • Excellent Written & Oral Communication Skills Pay: $90.00 - $100.00 per hour JayCare Therapy is currently offering Physical Therapists an additional $10 per hour for all bilingual cases. We will build your caseload according to your areas and times of availability. We are looking for full time, part time, or even just one day a week. We will customize your caseload to meet your geographic and scheduling preferences. We are open to hiring Physical Therapists' with little or no experience in the field, as we provide comprehensive, hands-on training. This is a wonderful opportunity with room for growth within the organization. Immediate caseloads available! Keywords: PT, DPT, Physical Therapist Job Type: Part-time Pay: $90.00 - $100.00 per hour Benefits: • Flexible schedule • Health insurance • Referral program Healthcare setting: • Outpatient Medical specialties: • Home Health • Pediatrics License/Certification: • Physical Therapy License (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0APToHrk7ILONyRglvlT3LJMO76dZGJsKlG8WQjsY8CqxhvB9ubf_PeUOuif9R_i6yr-S4Ch4EarbmWPEeWQUVOgm5e51pLZFCgKgRa-F0WaUfef5QLoSngE_prqgWdiYXlo_I4NviUhliYSngVEpaHoMxs3eQ8SJTE0TFN6nehwG_r17IrGLmaIL3-ILxzfMir3vsx3p5wzCHYX7BJxiOxwdka7kN3Hk0NFSE9BeivmRKqQVcaVnI3-5pxeC0USaJYntoxWUA7ceXCqgEk2E9m0Tmoa0KIgSk-XrlYZeIckml44uxLgsXKgvQJfmKsDUNXKkKxmMqvIzoTihiGVx2C0RkbdjKGpDufc-DPRSJoKv7eW1FcnCBQaR3fz881aHkPlfcf07Ei85Hc2rjCpeqyKIFHftuswLqwAv_KN5HDPa-Sgg5T5ljkjQYmXhczQpVpoS2_lRxZzCqjTITI3v3lmwDY2dYRutz7N_SOb-5NwdWkumy3bXKqEtuJEvXXCVT4gX5eF8fhnS1o6hZ9tyUtkAF-uxmEVHy4YzF4SaEqChhrEFf7SlxXzBRxwUIj2gyZDvoP3JTm_AdmMyq-oUaFhtv85l86uNm_AVYTvgbEw-WsUf24UIEOWtuGutPOwdw=&xkcb=SoBI-_M3HKCHxKzOpJ0ObzkdCdPP&p=5&fvj=1&vjs=3",
            "title": "Veterinary Technician- Internal Medicine",
            "company": "Philadelphia Animal Specialty & Emergency (PASE)",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Philadelphia Animal Specialty and Emergency (PASE) is seeking a skilled and experienced veterinary technician pursuing a role in an exceptional hospital environment fostering continued growth and development. PASE is the manifestation of our project to bring together a cohesive group of clinical staff with the pursuit of not only delivering the highest caliber of patient care and client satisfaction, but also prioritizing job satisfaction. We are growing our vision by promoting a model for sustainability, quality of life, and promotion of innovative, and progressive medicine outside the confines of a large corporate system. An Internal Medicine Technician will work with other veterinary technicians, veterinary assistants, veterinarians, and board-certified veterinarians in small animal internal medicine to provide exceptional care for small animal patients within a multidisciplinary specialty hospital. Responsibilities to include, but are not limited to: • Facilitate appointments by obtaining history, facilitating patient evaluation, filling medications, optimizing scheduling, assisting with and performing diagnostics and procedures. • Demonstrate proficiency in various technical skills including venipuncture and catheter placement, constant rate infusions (CRI) calculations and other advanced medical calculations. • Perform anesthesia including developing protocols, ensuring patient monitoring and appropriate recovery. • Facilitate patient intake, discharge, medical record completion and appropriate sample submissions. • Safely restrain dogs and cats for examination and brief procedures. • Prepare, organize, and maintain exam rooms as well as clinical and procedure spaces. • Set up and assist with various endoscopic procedures. • Maintain efficiency and organization in a fast paced environment • Exhibit professional written and verbal communications skills in all aspects of client interactions. • Demonstrate willingness and ability to train and coach new and developing team members. • Demonstrate commitment to further education and growth within a teaching environment. • Exhibit responsibility and autonomy when executing technical skills, prioritizing and using sound clinical judgment while multi-tasking, and maintaining excellent communication skills with a positive attitude working both independently and within a cohesive team. Job Type: Full-time Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Employee discount • Health insurance • Life insurance • Paid time off • Parental leave • Professional development assistance • Referral program • Retirement plan • Tuition reimbursement • Vision insurance Schedule: • 10 hour shift • 12 hour shift • Day shift Ability to commute/relocate: • Philadelphia, PA 19146: Reliably commute or planning to relocate before starting work (Required) Experience: • Veterinary technician: 3 years (Required) License/Certification: • Veterinary Technician Certification (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BuVxjzrRKxFIxkSd-eDXfW7bkGlF2tt1P3Nv2ojP2gzZQwwr8d8uXUQvKlQu2-zcbP2wu2sEVZ-AILk9bMbzIVLu2VuLKWH3EvyCw4_jglu4URGBA1AXVatBlBIUpznAm-0sclk3GO2sywxykLuRQxyO8_ZhjP_Z5XkRe1c1jT4BvGEj8Lv3-aaPHJlPyspf0zmUc99PkWtLtw07ich6kV2mB7rLSU9Ce0SmW9tvqJn5uSQSSIfkSSTeqzVzpAnbuFV9VRwyQPDXRvAr6D0HN6AWhtOyuP5rYoJM-XJaZ-bLbJAsjhkkHwmU2_sK9KCDUtLHtpv35P1ZPNWmzbFyOJi5MrMjRlCEfvGYMyCP2trcIz-sHRbtZNPPGbXKa0Ym9VqMffjRo9UwVsd3S-YHtYDEoa1kLGZg224L-R7adV4jWtuHsIwrWNPlWLqHLXAOvGGHkEs4AKiEF6VgBhVaueqtzSpGdxxq14aaGuhyG6FGazQuFhCJ4moHFeR8wR00G498TT-EoMi1ytJ8ynV8M_qy7c0xPAXQfdryY1VlLNqOhKOiuPfWJ-0n2zGALXFKjDg8FOF9JXFkHI5e3gkVto2pijBmW1Uu9qvKeyAMq2JrKwfibceVS6&xkcb=SoDV-_M3HKCHxKzOpJ0NbzkdCdPP&p=6&fvj=1&vjs=3",
            "title": "Dental Office Receptionist and Scheduler",
            "company": "Philadelphia Dentistry",
            "location": "1601 Walnut Street, Philadelphia, PA 19102",
            "salary": "$20 an hour",
            "description": "Welcome to your new work family! Can you greet two people at the same time and answer a phone call all while smiling? Love chatting to perfect strangers ? Have dental experience but feel under-appreciated? Philadelphia Dentistry in Center City, Philadelphia is seeking an awesome receptionist / scheduler to work with us in our dental office! We are looking for an exceptional candidate seeking a better work environment, looking to be challenged and a long-term position with promotions and growth available. Recent renovations and expansion have caused a need for this position. Turn Ons: hard work, attention to detail, cleanliness, punctuality. Great communicators who are organized and love work for work's sake is what we are seeking. Best matches are people with personality who appreciate health and wellness and who love people, and who will bring something positive to our office each and every day. If this is you, we've been waiting for you to join us. A little more about us: We are a well-established, award-winning dental office known for our excellence in delivering the best dental care in the Philadelphia area. We are friendly and have a staff of 20 employees in a new, clean office environment in a high-rise medical building at 1601 Walnut Street. We are seeking to work with with an individual who wants to constantly improve, is up for a challenge and will enjoy the support that we have to offer. We have a positive work environment and work toward monthly goals. If you are not familiar with Dr. Ken Cirka, Dr. Mimi Jeon, Dr. Evan Ridge and Philadelphia Dentistry, we encourage you to review our website while applying at www.PhillyDentistry.com. Requirements: Health conscious, clean appearance, on-time and hardworking. A positive attitude is what you need-we will train. No dental office experience is necessary, but it is helpful. Compensation includes a solid pay including benefits such as 401K with matching, health benefits, dental care, time off, and paid vacation. Please no phone calls. We will review your resume and contact you if we are interested in working with you quickly upon receiving your application. Job Type: Full-time Salary: $20.00 /hour plus benefits. Job Type: Full-time Pay: $20.00 per hour Expected hours: 36 – 42 per week Benefits: • 401(k) matching • Dental insurance • Health insurance • Paid time off Healthcare setting: • Private practice Schedule: • Monday to Friday • No weekends Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=c59d5ce11428de9c&fccid=36b76cf613fccb72&vjs=3",
            "title": "Storekeeper",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n Summary: \n \n • Maintain storeroom(s) in a neat and orderly fashion while placing stock in appropriate locations. Responsible for the distribution of medical supplies throughout the Hospital. The accurate and timely restocking of assigned areas. Maintains an orderly work environment. Accurate and timely recording of inventory issues and communication of problems to management.  Responsibilities: \n • Restocks assigned areas with med/surg supplies in an accurate and timely manner.Accurately picks, distributes, and charges out inventory supplies using a PAR level, or exchange cart system in the Lawson.Answers phone and field messages in a timely manner.Develops and maintains accurate Inventory records to include dates and product usage.Fills and distributes requisitions and purchase receipts from departments according to established schedules, or after receiving telephone/beeper requests.Rotates stock items according to department policy in all stock locations; including storerooms, omnicells and supply carts.Re-stock code cartsPrint labels and update hand held scanners as required.Participates in product evaluation/ in service process.Maintains continuity of services in emergency situations (i.e. may be required to continue staffing in disaster codes and other emergencies).Notify appropriate management if unable to deliver supply or service.Establishes and maintains a professional rapport with all internal and external customers.May be required to work in the Periop storeroom, main storeroom, mailroom or receiving, based on daily workload requirements.IV Solution management to include insuring IV fluids are secure and locked in all areas of hospital including par locations, storeroom and receiving area.Ensures that all work areas are kept clean, clutter free and organized as per department procedure/policyProperly dispose of all cardboard and packing material.Responds to requests, for supplies in a timely manner.Notify appropriate management if unable to deliver supply or service.Participate in department meetings/action planningMaintain all hospital HIPPA requirementsParticipates in Entity and Department wide initiatives for Patient/Employee safetyDemonstrates an awareness of patient/ employee safety when carrying out daily responsibilities of their position.Must follow all infection control policies and procedures. (example: scrubs, masks where appropriate, PPE) and follow all hand washing guidelinesMust maintain a safe work area in compliance with all healthcare regulatory entities.  Credentials:  Education or Equivalent Experience: \n \n  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Ci08TvZpHgC_A1XsBv2Gkgru6aLYKOZTlFQa_DtGFf4QWdYnl9RbS4xcjHUjf5CbxnCIQLsTXdzdy1bifdDufjLujk-y9-IlH7WzDnBkH4bfBZormnMjRGsVN1Femx3WF1mSUVDdZzLuagEJvj7gaMMoCjr6GSMxRHs64AR6UVol69Sx57AfXWfnC9Psld8XliblrlSBieDu50XJSmZWd87__jIOWbqr8w5K2Uud62NL7CsrtEbveTHNr_iGj6we61FGDl6MAizrlim3YgNG2EJhmDZewSeDtYKH0bn7OXSp-FKTM8_PTt6uBQ2u3V8NeUUV0h_djMEop2l5Zyed0Pfr4eahEjoqP6apk9DGEu2A9sJw9qvB7B1zIwJwmBUgapHN9QWUzNMlTaf57A9GZDi8oXDn6vSLNlJKmV9a4s_WLpmn9GfG1Ywp67VLcXMkdvzL_B0Z4AGWEHzQX_0kU8accM86JfnAP8etIQEiJtaSuwIHP7ecutryWfDOxL8U6BTptQPlc1G5FcMi_UgZu9_1jIJtM1w7y8Qntv4U4IjejTKpwAkLapXg42b8QQMQQvl6r_G7u-CjBE3nrqE-MZrdJb8TDrJ8UTExPeRIqlA8URx8xD_ekcT7XdJQeCV8HtFEquhfgi9ye5IU-BrZMifeZM_owS2e8Fn2jBtGd6uwARS3cQHIQ9WqfjSDLgCJn3Qsq8ErJ9bpkLPQ9GZzcCzQrHHl_-Y6a1acaBgs8bv3JzFsrVAx0jvv-eztcLcfbMHAnu5XfuwtMN4nY_X0qxEW1x9csYWGeNc5HkfaOoTJmTXhXQA0AX-X4bUDt4vC9IMzMOMT4Ntrjb4gr8TVBvE3DiVzrddUCNiIdkgyQ8LhxSCDQxFrhjSVeolUuyhGWvtNd4TzTFde1-HaoENXWZC5wOiXDuucfS4Z3liXV1DA==&xkcb=SoCI-_M3HKCHxKzOpJ0DbzkdCdPP&p=8&fvj=0&vjs=3",
            "title": "Board Certified Behavior Analyst (BCBA) - Abington, PA",
            "company": "Helping Hands Family",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "• Develop and supervise a meaningful care plan with personalized goals and programming to address the needs of each patien • Conduct detailed assessments and reassessments • Provide supervision, coaching, and mentoring to RBTs • Develop and monitor data collection • Provide parent training • Maintain a positive working relationship with patients families and respond to questions in a timely manner • Conduct Functional Behavioral Assessments • Communicate with the Clinical Director on a regular basis • Provide a weekly update email or facilitate team meetings • Uphold regular treatment integrity checks • Adhere to the relevant CPT codes \n  \n ✔ Meet licensing requirements for your state of employment ✔ Experience in the field of ABA (experience as an RBT will count for newly certified BCBAs) ✔ Confident verbal and strong written communication skills ✔ Must pass internal competency within 90 days of hire ✔ Ability to lift 50 pounds. ✔ Ability to perform physical tasks, including prolonged periods of walking, running, standing, bending, kneeling, squatting, climbing, and stooping. \n • Quarterly performance-based bonus \n • Onsite Clinical Directors • Medical, dental, vision benefits • 401k match • Short & long term disability • PTO, Paid holidays, and paid family leave • Bonus incentive program for employee referrals \n • Career advancement and growth opportunities \n • Ethical corporate team and business support • Access to free trainings and CEU library • Healthy work/life balance • CEU stipend • Clinics are clinician owned • Hybrid work schedule • Manageable caseload • Training based company with opportunities for continued education • Training opportunities for new BCBA hires • Team oriented company culture"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cs0rmy8NcKuMwjZ33B3MwJia_5S8TV5Xj4dHNx35rR_XUpn4JqVkD4uTs24jSG895V1VKq6tl-hB-if0wPnH674EH-lbs8fCY53gYea_5Pyu7atrlRaUY1qjKVG8-lQTa7gRNl2vkEHo1n0tGmNSLkKVTU5ISu3d-ITuyhV9D0J8Clu2CfLbeCV0L8taUAih0EBS_qmOez1_Q0guwHaOk8kovkVXV0srvqmNADjSZucAZIyJukveQpEW27utHtnEqDB8T8jO9MUKFMCIzSxo_XwuwBn3LSLPUxp9it3kpYlNpsSTEZxDbg3awoFBf8yJWqW6ia5ZJYzdtRGrmlgtk0StukS18hXKR_csZxY9OyYP8Kccunv3KjKJueXB-MV_ZY2rCI1e0mjoh9gMsO6nlOvRV7qjUnVgky1Dhhmriid0wj53WVSvnqoDurmFHBzH5-5ibWNe_g4o1QUElIydLxsNEh9gQdMRpOrMJXdbGi0I8rLnNMbeZ5vwcLFqJnSS48XRz_sK0UxsjDwbga1Un6nAhya6J5mYtDxtBgm-iyZOeNBSk9Sr1UbnJEXQ_zLnTa4_pRb_38dzujM9-sMc7s6yE1oKxIiWdtptAlnEvLoX0N-MzZ1ho7&xkcb=SoA8-_M3HKCHxKzOpJ0CbzkdCdPP&p=9&fvj=1&vjs=3",
            "title": "Patient Representative",
            "company": "Bryn Mawr Medical Specialists Association",
            "location": "Location Not Found",
            "salary": "$18 - $20 an hour",
            "description": "About us Our physicians in the BMMSA Gastroenterology department diagnose and treat diseases of the gastrointestinal tract, which includes the esophagus, stomach, small intestine, colon, liver, pancreas, gallbladder and bile ducts. Specific disorders/conditions that we diagnose and treat include: • Reflux/Gerd • Irritable bowel syndrome • Crohn’s disease • Colitis • Celiac disease • Swallowing disorders • Barretts esophagus • Chronic diarrhea • Hepatitis • Fatty liver disease • Pancreatitis • Gallstones • Gastrointestinal cancers We should also mention that we have an infusion unit to treat IBD with the most advanced biologic therapies. Procedures should include ERCP and wireless capsule “camera” studies of the small intestine. We are looking for a full-time Patient Representative to join our growing team. Our ideal candidate is organized, dedicated, and passionate about patient care. Medical office experience is preferred but not necessary for this position. If you are looking to work in a fast-paced medical office with a strong team, apply here! Responsibilities:\n- Greet and check-in patients as they arrive at the medical office\n- Collect and update patient information, including medical history and insurance details\n- Schedule appointments for patients and assist with rescheduling as needed\n- Answer phone calls and respond to patient inquiries in a professional and courteous manner\n- Verify insurance coverage and process insurance claims\n- Maintain patient records and ensure accuracy of information\n- Assist with medical administrative support tasks, such as filing, scanning, and data entry\n- Collaborate with healthcare providers and other staff members to ensure smooth operations \n \n \n \n \n \n \n \n Experience:\n- Previous experience working in a medical office is preferred but not required\n- Familiarity with medical terminology and procedures is a plus\n- Strong communication skills, both verbal and written\n- Excellent customer service skills and ability to interact with patients in a compassionate manner\n- Proficient in using computer systems for scheduling, data entry, and record keeping\n- Attention to detail and ability to multitask in a fast-paced environment \n \n \n \n \n \n We offer a competitive compensation and benefits package for qualified candidates. If you are looking for an opportunity to work in a dynamic healthcare setting and provide essential support to patients, please apply now. For questions or concerns, please contact Ali Gorson at 484-272-3270 ext. 3026 or agorsonmarrow@bmmsa.com. Job Type: Full-time Pay: $18.00 - $20.00 per hour Benefits: • 401(k) • Dental insurance • Disability insurance • Employee discount • Flexible spending account • Health insurance • Life insurance • Paid sick time • Paid time off • Retirement plan • Vision insurance Schedule: • Monday to Friday • No nights • No weekends Work setting: • In-person • Office • Private practice Experience: • Customer service: 1 year (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/company/Bryn-Mawr-Medical-Specialists-Association/jobs/Call-Center-Representative-a28ecb382f7e16e7?fccid=d47d4800bf4e4fa7&vjs=3",
            "title": "Call Center Representative",
            "company": "Bryn Mawr Medical Specialists Association",
            "location": "Location Not Found",
            "salary": "$16 - $17 an hour",
            "description": "Our Cardiology practice provides exceptional cardiac care, including disorders of the heart and blood vessels. We offer diagnostic, preventative, clinical and rehabilitative cardiac care and perform a number of both non-invasive and invasive procedures. The office is located in a main line suburban setting and is privately owned. We have a team-oriented approach and a work culture designed to create an excellent patient experience. We are looking for 2 full-time Call Center Reps to join our growing team! This person will be responsible for patient scheduling, new patient information, and general patient inquiries. Our ideal candidate has excellent communication skills and attention to detail. Job Title: Call Center Representative Duties:\n- Answer incoming calls and respond to patient inquiries in a professional and timely manner\n- Provide accurate information to patients\n- Handle patient complaints and resolve issues effectively and efficiently\n- Maintain a high level of patient satisfaction through excellent service and follow-up\n- Input patient information into the system accurately and efficiently\n- Follow call center scripts when handling different types of calls\n- Collaborate with team members to achieve individual and team goals \n \n \n \n \n \n \n Skills:\n- Excellent verbal communication skills with the ability to actively listen and understand customer needs\n- Strong problem-solving skills to address customer concerns and find appropriate solutions\n- Ability to multitask and navigate computer systems while speaking with customers on the phone\n- Attention to detail to accurately record customer information and update records as necessary\n- Ability to work in a fast-paced environment and adapt to changes quickly\n- Strong time management skills to prioritize tasks effectively \n \n \n \n \n \n For questions, please call 484-272-3270 ext. 3026. or email agorsonmarrow@bmmsa.com Job Type: Full-time Pay: $16.00 - $17.00 per hour Benefits: • 401(k) • Dental insurance • Disability insurance • Flexible schedule • Flexible spending account • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • Monday to Friday Experience: • Call center: 1 year (Preferred) • Customer service: 1 year (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=5407181b7f3195af&fccid=e65a7f54f32082bd&vjs=3",
            "title": "Surgery Scheduler",
            "company": "Main Line Health",
            "location": "Wynnewood, PA",
            "salary": "Not Available",
            "description": "Description:\nCould you be our next Surgery Scheduler at Lankenau Medical Center?\n\nWhy work as a Surgery Scheduler with Main Line HealthCare? \n \n \n \n • Make an Impact! Are you compassionate, comfortable on the phone, and a good listener? Communication is key as the Surgery Scheduler: you will be interacting with patients to schedule office procedures (both inpatient and outpatient), follow up appointments, and any testing required by the doctor. Attention to detail is paramount to ensure all patient demographics are correct, insurance is verified prior to procedures as well as pre-certifications are acquired. You will also use your keen attention to detail to review necessary medical preps for day of surgery, as well as discuss follow-up with the patients. \n • Develop and Grow your Career! Invest in furthering your education through seeking certifications or advanced degrees by taking advantage of our Tuition Reimbursement! This position is eligible for up to $6,000 per year based upon your Full or Part Time status. \n • Join the Team! Like our patients, the Main Line Health Family encompasses a wide range of backgrounds and abilities. Just as each of our patients requires a personalized care plan, each of our employees, physicians, and volunteers, bring distinctive talents to Main Line Health. Regardless of our unique design, we all share a purpose: providing superior service and care. \n • Position-Specific Benefits include: You are eligible for up to120 hours of paid time off per year based on your Full or Part Time status. We also offer a number of employee discounts to various activities, services, and vendors... And employee parking is always free! Position: Surgery Scheduler Position Responsibilities: • Acts on a consistent basis to support the Mission, Vision and Values of MLHC. • Schedules inpatient and outpatient procedures with the operating room, surgicenter, etc. • Verifies and updates insurance coverage for procedures; precertifies procedure when necessary. • Coordinates preadmission testing, medical clearance, EKG studies, etc. • Communicates regularly with patients regarding status of procedure and instructions for day of procedure or any other patient issues that may arise. Discuss with surgeon as necessary. • Discusses any necessary medical preps for day of procedure. • Ensures that all necessary information is in admission, OR, etc. before day of procedure. • Prepares chart for the day of surgery for physician; coordinating films, consents, lab work, etc. • Schedules post-operative visit. • Makes arrangements for all medical supplies that will be needed after surgery. • Review daily OR schedule, physician meeting and on-call call schedule. Distribute as necessary. • Review daily inpatient census and distribute as necessary. • Answer telephones and schedule appointments as necessary. Check-in and check-out patients during office hours. Often acts as receptionist or is back-up for receptionist. • Contact physician regarding requests for inpatient consultations. • Assist with office hours as necessary. • Responsibility for filing, copying, mail, etc. as per office procedures. • Attends meetings as required • Maintains patient confidentiality. • Performs other duties as assigned by practice providers and/or practice management. Shift: Full Time, Day Shift\n\nExperience:\n1. Three years of experience in a specialty physician's office with strong knowledge of managed care payors required.\n2. Knowledge of medical terminology and hospital procedures preferred.\nScheduling experience is preferred.\n\nEducation:\nHigh school diploma or equivalent.\n\nLicensures/Certifications:\nN/A"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=c7f55ea2d1682d6e&fccid=cce48ad42816872f&vjs=3",
            "title": "Unit Secretary Part Time Night Mom Baby Jefferson Einstein",
            "company": "Jefferson - Philadelphia, PA",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Join the mission of Improving Lives as a Unit Secretary Clerk at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.  Unit Secretary Clerks are responsible for the following: \n  • Provides support to the nurse manager with reports, data, and special assignments. Provides support to the nurse manager with reports, data, and special assignments. \n • Transcribes physician orders for medications, diets, treatments, etc. Transcribes physician orders for medications, diets, treatments, etc. • Runs errands as directed/necessary Runs errands as directed/necessary  Reporting to the Nurse Manager, the Unit Secretary Clerk will perform various clerical responsibilities on nursing units including preparing, compiling, and maintaining patient records. \n Qualifications for this position include: \n \n  • High School Diploma or equivalent High School Diploma or equivalent \n • Six (6) months of clerical experience Six (6) months of clerical experience • Knowledge of medical terminology preferred Knowledge of medical terminology preferred  Benefits include, but are not limited to: \n  • Comprehensive Medical, Dental, & Vision Plans Comprehensive Medical, Dental, & Vision Plans \n • Retirement Plans Retirement Plans • Tuition Reimbursement Tuition Reimbursement • Health Coaching, Commuter Discounts, Day Care Services, etc. Health Coaching, Commuter Discounts, Day Care Services, etc. Since this position will require the selected candidate to engage in regular contact with children in the form of care, guidance, supervision or training, you will be required to meet the requirements of the Child Protective Services Act, including the Pennsylvania State Police criminal background check, the Pennsylvania Department of Welfare child abuse criminal background clearance, and an FBI finger print based federal criminal records check. The selected candidate will not be allowed to commence working until all three (3) are completed satisfactorily. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        },
        {
            "url": "https://www.indeed.com/company/AVA-Counsulting/jobs/Receptionist-bb03e0d595e7aca0?fccid=5bc80e514d3e86a1&vjs=3",
            "title": "Hospital Receptionist",
            "company": "USTSOL",
            "location": "USTSOL in Philadelphia, PA 19104",
            "salary": "$18 - $21 an hour",
            "description": "Title: Inpatient Hospitality Coordinator\nLocation: Philadelphia PA 19104\nDuration - 5 + months (Possible extension) \n \n Description:\nInpatient Hospitality Coordinator serves as a liaison for patients and families in their assigned area. They\npromote a gracious welcome, willingness to problem solve and assist families, as well as ensure that all families\nfeel welcome, cared for, and valued. As an expert in family facing amenities, the Inpatient Hospitality\nCoordinator will proactively engage patient families to ensure that families are aware of hospital information,\ntechnology, and resources available to them, as well as support them in leveraging those resources. They will\nestablish meaningful relationships with patients, families, and staff and work collaboratively to ensure that \n \n \n \n \n \n Job Type: Contract Salary: $18.00 - $21.00 per hour Expected hours: No less than 40 per week Healthcare setting: • Children's hospital Medical specialties: • Cardiology • Critical & Intensive Care • Hospital Medicine Schedule: • Monday to Friday COVID-19 considerations:\nYes \n Ability to commute/relocate: • Philadelphia, PA 19104: Reliably commute or planning to relocate before starting work (Required) Education: • High school or equivalent (Preferred) Experience: • Front desk: 3 years (Preferred) • Hospital: 3 years (Preferred) • customer service: 3 years (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CoaJ7C2lsi2k2gNgvLcN_aSmEzL_E2opWAf5Z9WvxazFw7ohc8APc17hyzoeo2GbRDJf_Xt1UOn3ydiZ6hlwtVl19t0Yr6IBJh2Fjnr8i1XH1AHBxz7KcMBpD0DnkuH4kpEzf4hyk0oAX0QTlIa8Gn_EsLPc2W-acxXydZvXsP0DkI9BqQZD_6fG02E5v0CyaEyThCFy05FRUzTiJN6oDo8DyDyq9JIOjHlL6bOSfu0RvHq593Qh5eV0v7cmXufdEfHlMFtIG3InwDtJxVMcNCv4TJBR6WzPmKFghjyDk1vtgx_5143OY9tlcoMNum1oUZ5W1jMeEWXQsAADk1AT3vkB8q4oLATri6g3F14hPpHSh-DLk205pDd7CEQxAVboBhFOM8Y3S8smpnFQKYhy8a77ITTYcCaMT-mxLcq74o_yahIC2FfBmXAOGSjOSr7Yw5_n2DdUemX9LyXnWmxn9W4LwojT6BjKrIECedzOryWmff6oSZEaRIUVnhl1AaNRfpVVlDuD6dKwBxg_KPMEJQ3fHMXNZfJbofPbXcCduqJNaXmpWKmFeM96cEhleRcSAPWoMkinsgBjY7C7Rs-nie&xkcb=SoCy-_M3HKCHxKzOpJ0FbzkdCdPP&p=14&fvj=1&vjs=3",
            "title": "Home Care Coordinator",
            "company": "NCA",
            "location": "Location Not Found",
            "salary": "$20 - $25 an hour",
            "description": "Home Care Coordinator\nJob Responsibilities: \n • Responsible for scheduling & coordination of services. • Supervise caregiver performance & ensure a high level of care for the participants. • Responsible for proper documentation of cases. Skills: • Prior customer service experience in a healthcare setting is preferred. • Excellent communication and customer service skills. • Strong computer skills including knowledge of HHAeXchange . Requirements: • High School Diploma • Bilingual English/Spanish. • Experience as a Home/Health Care Coordinator preferred. Compensation based on experience and performance. We are an equal opportunity employer and do not discriminate based upon race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, or disability status. Job Type: Full-time Pay: $20.00 - $25.00 per hour Expected hours: 40 per week Benefits: • 401(k) • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • 8 hour shift • Monday to Friday Work setting: • In-person • Office Experience: • Home/Health Coordinator: 1 year (Required) Language: • Spanish (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CoaJ7C2lsi2k2gNgvLcN_aSmEzL_E2opWAf5Z9WvxazFw7ohc8APc17hyzoeo2GbRDJf_Xt1UOn3ydiZ6hlwtVl19t0Yr6IBJh2Fjnr8i1XH1AHBxz7KcMBpD0DnkuH4kpEzf4hyk0oAX0QTlIa8Gn_EsLPc2W-acxXydZvXsP0DkI9BqQZD_6GlxkWAqmOMPZlqpPsqq6LUkw2Sn08TQmPAbk5mMgNFxSlSzuKanti-77WzHG3unwgiFny2n85zTSX_gEV-ZP_pQFfyevIfqA3WCT5rGvOfJxGhoTGYCbYQ10Rnojo2rK7tpH4j4OFmwSH6ss5xYR17Uc6XM3Wz8PPMhfCPhNJyP8cpfiXPFYD60nywGC1Fddh7Jpp-cLYVdcGX1lnVKhAKwch_VkMRjvjSfQcdhWMqeuOGeo1CDI8n07Vb-JjkUehyt9aLKQjBTGBHAwPj8WSYqQJsgFt1p4DUenjVqVDdMhgwD9133-hxywgaHwE5NNNAvBVXhA24h2yOzUt9Wvf17gDohz1AaajXdQ4GlKesc-9HY0VWFCO9ZewsUaTSWfQA55btVrcquaO30i1Rou_zBpf3yUjePY&xkcb=SoAT-_M3HKCHnr2aix0LbzkdCdPP&p=0&fvj=1&vjs=3",
            "title": "Home Care Coordinator",
            "company": "NCA",
            "location": "2442 S Broad St, Philadelphia, PA 19145",
            "salary": "$20 - $25 an hour",
            "description": "Home Care Coordinator\nJob Responsibilities: \n • Responsible for scheduling & coordination of services. • Supervise caregiver performance & ensure a high level of care for the participants. • Responsible for proper documentation of cases. Skills: • Prior customer service experience in a healthcare setting is preferred. • Excellent communication and customer service skills. • Strong computer skills including knowledge of HHAeXchange . Requirements: • High School Diploma • Bilingual English/Spanish. • Experience as a Home/Health Care Coordinator preferred. Compensation based on experience and performance. We are an equal opportunity employer and do not discriminate based upon race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, or disability status. Job Type: Full-time Pay: $20.00 - $25.00 per hour Expected hours: 40 per week Benefits: • 401(k) • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • 8 hour shift • Monday to Friday Work setting: • In-person • Office Experience: • Home/Health Coordinator: 1 year (Required) Language: • Spanish (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CkR7uF-r91tgTdUBcV6xDgRxjDt1xQIwl7tGBoukNtai5kd7d5Hp1mJmPz5Fm6qsDagEf48j6ZMgIROVhgQDvCadYY9kG_LoWsHTtmlfXBe2cMv5IJ2EAGiFJomnmhyUEJSm4eSMjDyL7RZIjLWv9KHR42CLjGqlE5AFz2X8qcl072RLqrPzWdMP5UpAm7_9FKkLZ85Ze0sy1zc_reaLis8AvHxcYtOpbBpzva8RbGkbt2jHsbDN4lWKHGLBmZETd-DdANYdsSd18uFMXM2u_HZ9GSq-nO2s1_oh2vd8O0t15g1AkZ__dqOB7rAqZZ-YiwbbKfGQo_kVMlAkTAsEcJfIFkcyW0KiUcZKoy6Gl7Ld8uyNJ1rK_9YL13EBIcr5wwrdZvX9IDtOlMlAlWz45sIvndAlOl8w9QVuEJ9e69hOmBO3JCOfUdTcZMUFnMoSOlRjQblmpw7yhoENCqv22YNM3srgMahgpF0mS2Ta_3eEcMpTlHQvxykQ-T-vMh7ZMtVzNq76fSCE0l0w4L38I82mT919e905skmex7cw7jtHiC0YM0hUAdbGlKaK0rBaQSJgBZk-n5yIxM8P3H3jDO1XAnqxwChjlxkOpyf02Sdl0Jwl4aC-EaZVzeYKbeHmTFfKmARb5jacolblpcK0ji_39UJk3vy22v8dqGJU4-1BsVxRmVcPnmZ0BqCuF7yibHPWYQqYZ0u9B0pBhGme9nKdK06Bkkug0=&xkcb=SoCn-_M3HKCHnr2aix0KbzkdCdPP&p=1&fvj=0&vjs=3",
            "title": "RN Unit Manager",
            "company": "Care Pavilion Nursing and Rehab",
            "location": "6212 Walnut St, Philadelphia, PA 19139",
            "salary": "$48 an hour",
            "description": "Job Description: The RN Manager assumes 24-hour responsibility and accountability for the nursing care of all residents on an assigned unit. Responsibilities: • Supervises licensed nurses and other nursing personnel in the delivery of care and services according to each resident’s comprehensive resident assessment and plan of care. • Manages unit in accord with facility philosophy, in compliance with standards of professional nursing practice, and with all state and federal laws and regulations. • Utilizes resources in an efficient and economic manner to ensure that each resident achieves the highest practicable physical, mental and psycho-social well-being. • Makes daily rounds on unit to supervise, observe, examine, interview residents, to evaluate staffing needs, to monitor regulatory compliance, to achieve the care environment and to evaluate staff interactions and clinical skills competency. • Audits 24 hour report as completed by Charge Nurses and reviews clinical records to identify problems, to ensure timely responses to residents' needs, to evaluate documentation skills of unit nursing staff, and to evaluate regulatory compliance with documentation requirements. • Listens to verbal shift report making special note to follow up on significant changes in condition, admissions, transfers, discharges, initiation or use of physical or chemical restraints, unnecessary use of any drug, incidents, unexplained injuries, medication errors, loss of resident property or evidence of resident or family dissatisfaction. • Analyzes data gathered from rounds and record reviews and acts promptly to resolve problems and to continuously improve quality. • Participates in formal quality assessment and assurance activities as directed by the Quality Assurance Committee. • As the nurse with responsibility for the residents on the unit, conducts or coordinates the resident assessment process including accurate completion of the state-approved Resident Assessment Instrument. For more information about Bedrock Care and our facilities, please visit our website: https://bedrockcare.com/. Like us on Facebook at: facebook.com/BedrockCare/. We are an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. \n  IND123"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CXSfrO6qVmRhVFqZQ0sNexTsyZFTcYQFnSZGAjcfuK6ZA5BzH3SI5tGlkWACCdeHJOhe64-5MkbzMYSvO9YSb3hIBf700Y0qX8ovshI2JMr1q2TkKiSLUGGW12x4lbU6nAbXNCt_5gZIv2DBqfUyvdLqRrB-S-fZd02ZLQk4LEDA28MfG0ReKklLc6OTwtQeGFpruMj-b0ydZ3rhPkfolDSqBrCGranW6XUVQ39rugLrbzcseZ4syuUrIsnAoeOmOcM2krey7m5sor1JcjN_xYXbpTW33A1JZfVlkcSWBvWUEFy_f0liRP2FV_oJr253BM2vq8YSAFSSeaYVlsYun9UAhHXcd_KaecDs5MN4Rvld5q_dm5DA6nbZbHDJEm6agWF-bIRAVFx1gGru_zfPlLbycvmpiDmzrPomSb4NV8V17PuaaOKfP5KgpVzgL2MyjxlXwL0zDjKcG2ndVyNApltbcMGge1PviJwl9GLXNbSSxpq42V9EgH-oZa5-CB4m-rVADbNijTW04deY-fnvHNPznnSkMq_4KfxL1sngDU33Dk9zQWpp2-zr6smv9FbTlpim4_46xVHOUA11BquWkxshmQVkwlMcI=&xkcb=SoA6-_M3HKCHnr2aix0JbzkdCdPP&p=2&fvj=1&vjs=3",
            "title": "Physician Assistant",
            "company": "Merion Health Partners",
            "location": "2231 Bryn Mawr Ave, Philadelphia, PA 19131",
            "salary": "Not Available",
            "description": "Urgent Care physician assistant/NP posting. Basic Urgent Care skills required such as simple suturing, splinting, I&D. Should be able to see all ages. Should be a team player. Job Type: Full-time Ability to commute/relocate: • Philadelphia, PA 19131: Reliably commute or planning to relocate before starting work (Required) Experience: • Urgent care: 1 year (Required) License/Certification: • Certified Nurse Practitioner (Preferred) • PA-C (Required) • Physician Assistant License (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B-T0AMlfaQQD3TUR8j7PnWvL0Zt-z7Hg1S1fZCOUtr_1sidagr6Qq15Kc5aafawARHdESS_KPA-vtOHkUOJbaVnLK5rHUeiuZdzVOppc-LCXzIkNvCEg9mq45chkpwUdLnAy01lvf7EPWE6XwhPNTqxxUYHzvJsGzHEkcoWnVEsfikL4aV4kx4vC3lv3KGKyux9vYx7YGw1h4KXzogrrw4dpsNn-Hns5iRaATWZPPenS--y5CHznYW3znfKlskBGZ64MbVvVDcZ0NNXiNlOY6Fi04H0rfVvirQFAifvXTJk7i0e6XlKJES0MtB-Lc29rZ1rP4GXdDEOR4_qhel6FpRsm2AbVJ3e69QB30jQPeHfz-yDsJivXr3nI4Y1cFee6YIPTvBsyhdstjSo8ogKSe3ruGO1WlLykY-neh4ptZkne5DiN_g5T9xT96bLXP7lt2ZDbJSyWRJoeIe6a66GC-xLiL6smBjdikNWxMetq8QtabfeL1wm4lSDDEoAm2pu6-sPwv5UwTzi5b5ddclikSitvHAF6wRxpI49VZKguu8vsl8NUTSwp3j2RgH3ZXsn4pMtYEM0oagseM5cw-3AdK_&xkcb=SoCO-_M3HKCHnr2aix0IbzkdCdPP&p=3&fvj=1&vjs=3",
            "title": "Chiropractor",
            "company": "Align Chiropractic",
            "location": "Location Not Found",
            "salary": "$75,000 - $100,000 a year",
            "description": "We are looking for an adjusting doctor to join our team and help serve our community. At Align Chiropractic, we focus on structural corrective care, utilizing diversified, drop table, and arthrostym adjusting. We are a busy, high volume office, so we are looking for a doctor who can deliver great adjustments while helping to keep the office running efficiently and keep wait times short for patients. The ideal candidate is a detail-oriented clinician who is sincere, friendly, easily approachable, and good with people. The doctor we hire will need to do exams and go over recommendations on occasion, but will, for the most part, only be responsible for adjusting. We are passionate about serving families, so being comfortable adjusting (or learning how to adjust) children and pregnant patients is a must. The office is open Monday-Thursday, and a short Saturday morning shift. The associate we hire will be responsible for working two Saturdays per month. Community highlights: Align Chiropractic is located on the \"Main Line\" of Philadelphia. If you like to live \"in town\", then there are four great town centers tchooseo from (West Chester, Malvern, Phoenixville, and Downingtown). If you like rural living, there are plenty of locations near the office to choose from with clean air, rolling hills, and horse farms. Job Type: Full-time Pay: $75,000.00 - $100,000.00 per year Benefits: • 401(k) • 401(k) matching • Employee discount • Paid time off Supplemental pay types: • Bonus opportunities Ability to commute/relocate: • Malvern, PA 19355: Reliably commute or planning to relocate before starting work (Required) License/Certification: • Chiropractic License (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/company/AVA-Counsulting/jobs/Receptionist-bb03e0d595e7aca0?fccid=5bc80e514d3e86a1&vjs=3",
            "title": "Hospital Receptionist",
            "company": "Company Not Found",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Title: Inpatient Hospitality Coordinator\nLocation: Philadelphia PA 19104\nDuration - 5 + months (Possible extension) \n \n Description:\nInpatient Hospitality Coordinator serves as a liaison for patients and families in their assigned area. They\npromote a gracious welcome, willingness to problem solve and assist families, as well as ensure that all families\nfeel welcome, cared for, and valued. As an expert in family facing amenities, the Inpatient Hospitality\nCoordinator will proactively engage patient families to ensure that families are aware of hospital information,\ntechnology, and resources available to them, as well as support them in leveraging those resources. They will\nestablish meaningful relationships with patients, families, and staff and work collaboratively to ensure that \n \n \n \n \n \n Job Type: Contract Salary: $18.00 - $21.00 per hour Expected hours: No less than 40 per week Healthcare setting: • Children's hospital Medical specialties: • Cardiology • Critical & Intensive Care • Hospital Medicine Schedule: • Monday to Friday COVID-19 considerations:\nYes \n Ability to commute/relocate: • Philadelphia, PA 19104: Reliably commute or planning to relocate before starting work (Required) Education: • High school or equivalent (Preferred) Experience: • Front desk: 3 years (Preferred) • Hospital: 3 years (Preferred) • customer service: 3 years (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=e93642fc4bea01e0&fccid=36b76cf613fccb72&vjs=3",
            "title": "New Patient Coordinator",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n Job Title: New Patient Coordinator\nDepartment: Radiation Oncology\nLocation: Hospital of the University of Pennsylvania - 3400 Spruce St\nHours: Full Time First Shift \n \n \n \n Summary: \n • This position is responsible to provide optimal new patient coordination in an integrated, multi-disciplinary environment. Care will be coordinated across multiples specialties and ancillary departments within UPHS. Employee will ensure that all new patients are well prepared for their first visit by making certain patients are being seen by the appropriate physician and specialty and that patients arrive for their appointment with all pertinent information to ensure optimal care coordination (medical records, test results, referrals, copays). In addition, patients will be provided information on directions, parking and building navigation. • The position requires that the individual convey a positive image of UPHS through excellent communication and customer service skills in support of patients/families and to ensure an ideal patient experience. Responsibilities: \n • Act as point of contact for all new patients for department. • Serve as specialty expert of nuances of care coordination so that patients are seen by the appropriate physician and specialty. • Schedule new patient appointments with appropriate physician and/or group with emphasis on working with providers on a regular basis to ensure that the right diagnosis and patient is scheduled with appropriate provider. • Coordinate new patient appointments as needed with Patient Facilitated Services and Penn Health Referral. • Follows new patient coordination protocols to ensure that patients are coordinated and prepared for visit in an organized, consistent and seamless manner. • Coordinate/organize all facets of new patient appointment – scheduling, coordination of medical records, test results, pathology results – all information needed to ensure an optimal level of care coordination. • Coordinates the scheduling of diagnostic tests, other evaluations and review of necessary information prior to new patient appointment. • Responds to patient inquiries or problems. Answer questions regarding practice, procedures, tests, directions etc. • Coordinate the retrieval and flow of outside medical records to ensure receipt and appropriation (review by provider, scanning, etc.) of records for visit. • Ensures appropriate retrieval, processing and returning of patient radiology films, CDs, slides and other related items. • Manages physician new patient IDX schedules, ensures appropriate preparation of new patient charts and information 48 hours prior to date of new patient visit or services. • Reschedules new patient appointments appropriately. • Ensures optimal patient experience through coordination and communication. • Follows Health System and Department Protocols for Epic Messaging. • Communicates issues effecting flow with managers and providers as necessary. Keeps manager aware of potential issues or problems as they arise. • As required, maintains compliance with all federal, state and local regulatory standards and requirements, including TJC, Department of Health, funding agencies, FDA, HIPPA, HCFA, DPW, LCGME, SCGME, department specific guidelines and other. • Ensures patients have been properly registered and referred to Financial Counseling. Makes sure new patients arrive for new patient appointment with referral and copays, as appropriate. • Maintains an excellent understanding of managed care plans and protocols for referrals, co-payments, and pre-certification. • Readily adopts and is engaged in practice operation changes • Is proficient in the use of all system applications necessary for practice operations, including, but not limited to: • IDX (and its applications) • ONTRAC • EPIC • MEDVIEW • NAVICARE • CHART ONE • Other \n • H.S. Diploma/GED (Required) • 5+ years experience in a medical office setting or Customer Service experience. (Required) • Advanced degree (Associate's, Bachelor's, Master's) preferred and may be considered in lieu of some experience • College-level coursework in business, accounting, or health care administration strongly preferred. • Specific knowledge of precertification requirements, CMS medical necessity required, and third party billing knowledge is ideal. • Experience with spreadsheet and word processing software preferred. • Knowledge of medical terminology and office procedures. \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AGMMs3akvhTvtbje7SZCJZQ1YNNWM_nliTuMEeUE1Z3CmsgJmr0XuXT547fHVkM1b8686K-iEGlqolnWfEXRUrwm1k8vZNjf_Uh4Lpw21kMbBrK0pgCMxwlB-veRKyPjsFrY99vF1smnm_cTFY19I0k6T2i6pT_c1g1WKQ1MoMFNeadgXOVNtKRTdBKJQx2meJ3L1x633En4lUXuChduc1NfYibVUwgb0BSbrJO6a7BQNGnlPWS3p4t_U8sDfVIxLMkGp9hcL_MhcswUrJDj5SDIisNQgitpOKa8TtxNQtr8nVu7wwy_cole63fYxuK_OekRpAyyGHmU6aL7oW1wRD9-wrRipVWavpxQgP7tz6PmSt9WxmQ531Zt_ERblEZpTV7_TbxwDWlRn07uiAU7Ul5T7C9md66b_36GDoewQ_Aakv5sWaJWhgIiEDFomL-RdqUgfbc5iqROZrONg-FtM9A2gVMMF7n0X_BGx7AnRWNS_eqgrBBCjMwwyVN9krg4qjdMsMlLHJZANeNLv98eoDSn5oLnEA8KDXTxQue9ryaD8PhE5kAwGL47KgJvD5TREjp_-_U-QlzwFp7Vo8EGvycrfrAeYnptsKmQmyi3wBwQ==&xkcb=SoAp-_M3HKCHnr2aix0NbzkdCdPP&p=6&fvj=1&vjs=3",
            "title": "Unit Clerk - Outpatient Services",
            "company": "Belmont Behavioral Health System",
            "location": "4200 Monument Road, Philadelphia, PA 19131",
            "salary": "Not Available",
            "description": "Belmont Behavioral Hospital currently has an opening for a Unit Clerk, in our Nursing Department. The Unit Clerk is responsible for general communications on the nursing units, including telephone and written communication. Maintain patient records and administrative reports. The Unit Clerk will: • Assemble patient charts for admissions / transfers / discharges per facility policy. • Distribute mail and announcements and post memos. • Dispatch messages to and from other departments. • Deliver mail (incoming / outgoing) for units. • Ensure adequate supply of forms and supplies. • Obtain lab, x-ray, and consult reports. • Identify and report equipment or environmental problems promptly for correction. The ideal candidate will: • High School diploma or equivalent required. • Experience in healthcare setting preferred. • Administrative/clerical work experience required. Job Type: Full-time Benefits: • 401(k) • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Healthcare setting: • Inpatient • JCAHO accredited facility Medical specialties: • Psychiatry Schedule: • 8 hour shift • Monday to Friday Ability to commute/relocate: • Philadelphia, PA 19131: Reliably commute or planning to relocate before starting work (Required) Experience: • Customer service: 1 year (Preferred) • dministrative/clerical work: 1 year (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=d28174f931189739&fccid=36b76cf613fccb72&vjs=3",
            "title": "Telehealth Coordinator",
            "company": "Penn Medicine",
            "location": "1800 Lombard Street, Philadelphia, PA 19146",
            "salary": "Not Available",
            "description": "Description \n \n Entity: Penn Primary Care and Specialty Practices \n Department: Center for Connected Care Location: Philadelphia, PA (On-Site)  Hours: Day Shift- 6:30am-7:00pm; (3, 12-hour shifts) Summary: • Serves as the primary source of contact in coordinating telemedicine/telehealth activities at Penn Medicine Center for Connected Care. Responsible for supporting the day-to-day operations of the telemedicine/telehealth activities and/or telemedicine/telehealth initiatives occurring at the Center for Connected Care. Contributes to continuous improvement in patient care and population management. Collaborates in coordinating patient care management across enterprise wide cross-functional departments, supporting telemedicine/telehealth services and telemedicine/telehealth best practices. • Assists in the management of clinical data: retrieval, entry, aggregation, analysis, and reporting. Tracks and analyzes trends on the data relating to the quality, safety, utilization, and satisfaction of telemedicine/telehealth services to evaluate the Center's clinical effectiveness and potential areas of improvement. Responsible for thorough and accurate documentation to include patient training and patient troubleshooting for the proper use of telemedicine/telehealth equipment. Must be confident, composed, responsive, and approachable when interacting with patients, families, and clinicians via telemedicine/telehealth devices including two-way camera technology.  Responsibilities: \n • Maintain confidentiality, exercise discretion, use independent and mature judgment, work independently without supervision with a commitment to clinical excellence • Operate a computer with proficiency in utilizing clinical applications, telemedicine/telehealth applications and office programs such as Excel, Word, Outlook, Skype, etc. Maintain basic IT troubleshooting skills for computer applications and telemedicine/telehealth peripherals. • Prioritize workload and meet deadlines, develop and carry-out assignments in an efficient and timely manner, provide accurate and succinct documentation of activities. • Be flexible and amicable to efficiently manage multiple tasks in a fast-paced work environment. • Communicate effectively with patients and clinical staff members including nurses, doctors, providers, social workers, etc. Support telemedicine/telehealth activities with internal and external stakeholders. • Exercise tact, courtesy and diplomacy when dealing with individuals at any level. Engage, support, and educate stakeholders within telemedicine/telehealth programs using age & developmentally appropriate tactics. • Triage incoming telephone calls and appropriately manage each call by obtaining adequate information to make a proper telemedicine/telehealth referral and scheduled teleconsultation when appropriate • Schedule appointments, set-up and test equipment for telemedicine/telehealth engagement, reconcile telemedicine/telehealth applications to maintain accuracy across electronic medical record.  Education or Equivalent Experience: • H.S. Diploma/GED (Required) • 3+ years' experience in a medical environment preferred and experience with patient teaching a plus.  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BUPDbJAQAve-3lpcKY-eKGf7j80cWlLCFez2pYkKOVjvaK55vj8TsnSJvJd-CcIUy7lT_nSSSaCLbVamBHYiqUj1wUzvXcwTJAuYIbtCjhfDvhMj0vQBtf1TedaIikxLcyy_eLw6J0agB9GA2uA06z7tMEoaQOd4uplPTuZqoqIXm6WWsvwuFi0vivDa4402XmwC8jsGEJ4JJOhYHlA0hq0ECsJMoZ0bmC5_f1ouRjmfLR664PntjBYGRcgXHuRDGQS9cv-p67tFSUfoqSIWGqJ9pTEqFGzhXFNvqcSgmdt1FwC0RYHkiN0fvCDRK9qurle3Y3vfsz5Xp_1UhLTSdiVkrj5vNsvYdpgKLX0t2AIjweSkTjRXc8bnYS4K651kCDCQRjPCwXL3X5hh1UQ1NfOpxKswaMhUO6sFChWSeJjdLNMufXBPLsFUUW30hBHl0IZk-pb5zC8Lpytx0HaXbx4kiJ0asKc-mT3RGgUK-gZjHGqgkR2xAjpoOva33DQwTqrai_lIMtNT5lqqBhtRJRPQEMTGwd08rAQWifRcz3kLu1VDdoqGi8DJupZm3cZ42yL6agBF7lCMedtfA5bBlhXmVskd4qxlx7mixSGNhnxsfXTgLGrZvBVVYMTZoo6-b8QJQ_n_sg6r8_3fhtl9goKOoq10f-uoaayDmnYPqf51mcFF3I4roxy-EZZx9KohVN61LOVKH5G8Qi9Dezsf6NwaH1ZAJ8IvlOATz6WJtELMnaZjJN1LiUobcxDvETMSoC06KH5Y3PzD_NVWcZWmeEE4oT0Ae9pegbQWzVVl6bLHZ4wDgXwQAQ2vGRQij6bQppChf45OxKPbCLBFOV5nmwgrM7qjkNPC0Xs6hgEXo3Op0FsfA-hIrZzbTp-_voKzj0xYuQC-YzCCeSRt0Puq2vlpbTsOFfVF9lCXVKhhgBoEk-hCwGrlSBs2Gep-9I7Ue6b1naQdOb4DS0OKrCND5eLicgSQKI7GJ4a1nbM3UbhUbW0eBvznlJztmmcdHa1BXoz2fampS5XnebZdggRkyyLOCTCK9z03hD6rLJ9gGySexZJ7PY93dxlMawpqZ5gEKbixghF6KIqfkhEQYrYWwSl1rqzdMMGaVQAjo0oXla4g==&xkcb=SoB0-_M3HKCHnr2aix0DbzkdCdPP&p=8&fvj=0&vjs=3",
            "title": "Locum | Physician Pediatrics",
            "company": "Weatherby Healthcare",
            "location": "Location Not Found",
            "salary": "$90 - $110 an hour",
            "description": "• Must have active state license • BC or BE required • Days • BLS required • 21 patients per day • Well/sick visits • Credentialing not needed • DEA needed • Paid malpractice insurance; pre-paid travel and housing expenses • Assignment details and time entry in online portal • Competitive compensation • 24-hour access to your Weatherby Healthcare consultant • Charter member of NALTO Ranges shown should be used as an estimate and are affected by many factors including the critical need of the position, your overall experience and qualifications, and other considerations. Please reach out to your consultant for more information."
        },
        {
            "url": "https://www.indeed.com/company/Bryn-Mawr-Medical-Specialists-Association/jobs/Patient-Representative-3f46616753010ca3?fccid=d47d4800bf4e4fa7&vjs=3",
            "title": "Patient Representative",
            "company": "Bryn Mawr Medical Specialists Association",
            "location": "Bryn Mawr, PA",
            "salary": "$18 - $20 an hour",
            "description": "About us Our physicians in the BMMSA Gastroenterology department diagnose and treat diseases of the gastrointestinal tract, which includes the esophagus, stomach, small intestine, colon, liver, pancreas, gallbladder and bile ducts. Specific disorders/conditions that we diagnose and treat include: • Reflux/Gerd • Irritable bowel syndrome • Crohn’s disease • Colitis • Celiac disease • Swallowing disorders • Barretts esophagus • Chronic diarrhea • Hepatitis • Fatty liver disease • Pancreatitis • Gallstones • Gastrointestinal cancers We should also mention that we have an infusion unit to treat IBD with the most advanced biologic therapies. Procedures should include ERCP and wireless capsule “camera” studies of the small intestine. We are looking for a full-time Patient Representative to join our growing team. Our ideal candidate is organized, dedicated, and passionate about patient care. Medical office experience is preferred but not necessary for this position. If you are looking to work in a fast-paced medical office with a strong team, apply here! Responsibilities:\n- Greet and check-in patients as they arrive at the medical office\n- Collect and update patient information, including medical history and insurance details\n- Schedule appointments for patients and assist with rescheduling as needed\n- Answer phone calls and respond to patient inquiries in a professional and courteous manner\n- Verify insurance coverage and process insurance claims\n- Maintain patient records and ensure accuracy of information\n- Assist with medical administrative support tasks, such as filing, scanning, and data entry\n- Collaborate with healthcare providers and other staff members to ensure smooth operations \n \n \n \n \n \n \n \n Experience:\n- Previous experience working in a medical office is preferred but not required\n- Familiarity with medical terminology and procedures is a plus\n- Strong communication skills, both verbal and written\n- Excellent customer service skills and ability to interact with patients in a compassionate manner\n- Proficient in using computer systems for scheduling, data entry, and record keeping\n- Attention to detail and ability to multitask in a fast-paced environment \n \n \n \n \n \n We offer a competitive compensation and benefits package for qualified candidates. If you are looking for an opportunity to work in a dynamic healthcare setting and provide essential support to patients, please apply now. For questions or concerns, please contact Ali Gorson at 484-272-3270 ext. 3026 or agorsonmarrow@bmmsa.com. Job Type: Full-time Pay: $18.00 - $20.00 per hour Benefits: • 401(k) • Dental insurance • Disability insurance • Employee discount • Flexible spending account • Health insurance • Life insurance • Paid sick time • Paid time off • Retirement plan • Vision insurance Schedule: • Monday to Friday • No nights • No weekends Work setting: • In-person • Office • Private practice Experience: • Customer service: 1 year (Preferred) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=fcfdea929062d2b8&fccid=e65a7f54f32082bd&vjs=3",
            "title": "Patient Services Representative",
            "company": "Main Line Health",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description:\nCould you be our next Patient Services Representative at Lankenau Medical Center?\n\nWhy work as a Patient Services Rep with Main Line Health? \n \n \n \n • Make an Impact! Be an Integral Member of our Organization! As a PSR, you are the first person to make a GREAT impression with our patients! Using your excellent communication skills, you will help greet, direct and schedule patients and visitors. Serve as a liaison between patients and support staff by preparing patient charts before check-in and keeping the office and all records, reports and other correspondence organized. \n • Develop and Grow your Career! Invest in furthering your education through seeking certifications or advanced degrees by taking advantage of our Tuition Reimbursement! This position is eligible for up to $6,000 per year based upon your Full or Part Time status. \n • Join the Team! Like our patients, the Main Line Health Family encompasses a wide range of backgrounds and abilities. Just as each of our patients requires a personalized care plan, each of our employees, physicians, and volunteers, bring distinctive talents to Main Line Health. Regardless of our unique design, we all share a purpose: providing superior service and care. \n • Position-Specific Benefits include: You are eligible for up to 120 hours of paid time off per year. We also offer a number of employee discounts to various activities, services, and vendors... And employee parking is always free! Position: Patient Service Representative Position Responsibilities: • Greets patients and visitors in a prompt, courteous, and helpful manner, determining their needs. • Checks in patients, verifies and updates insurance and demographic information in the medical record and billing system. (Includes HIPPA regulations) • Prepares patient chart prior to the patient’s appointment. • Maintains appointment schedule and follows office scheduling policies and procedures. • Sends confirmation/ instructions/directions to patients promptly. • Answers telephone, screens calls, takes accurate messages and provides information to customers. • Files charts, coordinates lab work, physician’s report, etc. • Files records daily in appropriate section of patient charts and keeps charts in proper order. • Types correspondence as directed. • Sorts and delivers mail, medical records and other correspondence. • Maintains work areas and waiting room in neat and orderly manner. • Attends meetings as required. • Confirms all patient appointments based on the following days schedule. • Maintains patient confidentiality. • Performs other duties as assigned. Shift: Full Time, Day Shift\n\nExperience:\n1. Two to three years of office experience required.\n2. Knowledge of insurance payers and medical terminology preferred.\n3. Must be experienced in Microsoft Word (columns, tables, envelopes, mail merge, labels) Excel (data base maintenance) and Outlook (maintaining calendars of several staff).\n\nEducation:\nHigh School Diploma\n\nLicensures/Certifications:\nN/A"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=6c4289c9f928eff6&fccid=36b76cf613fccb72&vjs=3",
            "title": "Patient Services Associate- HUP",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n Summary: \n \n • The Patient Services Associate (PSA) assists the practice/department in maintaining a patient/customer focus, supports the delivery of high-quality care, shares a passion for patient and customer-centered care, and assists in meeting or exceeding patient satisfaction and financial/operational targets. The PSA is responsible for the arrival and/or departure activities of patients in the practice, managing and handling patient calls and inquiries, coordinating patient appointments, updating patient insurance/billing information, and performing point of service activities. The PSA may function in a physician practice or a call center environment. Rotation between PSA functions and/or departments may be required.  Responsibilities: Patient Service: • Strives to understand and anticipate patient needs, manages service recovery efforts when needed, enlisting management assistance as appropriate, identifies opportunities to improve the patient experience. • As per practice/department protocols and/or measurements: answer phones in a timely manner, manage/handle patient requests and route appropriately, retrieve voicemails in a timely manner, take accurate and thorough messages and route appropriately through EMR. • Schedule patient appointments (on phone or in person) by determining reason for visit, following established schedules and protocols, using appropriate billing area/appointment location, communicating changes and confirming appointments, and, as needed, offering alternative and canceling/rescheduling appointments. • Responsible for arriving/departing activities of patient at practice and performs point of service activities: collects copays and records accurately, obtains necessary signatures/forms, obtains insurance cards and referrals/authorizations, updates appointment status in EMR, and finalizes all check-out procedures. • Communicates with patients regarding patient flow and wait times – keeps manager aware of potential issues as they arise. • Issues referrals and obtains pre-authorizations for patients as required and as per protocol. \n • Maintains up to date knowledge of insurance requirements pertinent to patient service and billing procedures: including basic knowledge of all managed care plans and which insurers require a copayment or referral. • Validates patient demographic/insurance information and/or registers new patients into EMR using established protocols. • Records receipts accurately to ensure end of day reconciliation; participates in cash reconciliation delineations. Resolves work queues and/or issues from front-end reports; proactively prioritizes recovery of missing charges. • Orders supplies for the office and generates front-end process reports as requested. \n • Ensures compliance with all applicable federal, state, and local regulatory standards (ex TJC, DOH, FDA, HIPAA, HCFA, DPW, LCGME, SCGME, etc) • Flexible and readily adopts new processes and engages in practice operation changes. \n  \n • Coordinates clinical and administrative aspects of the new patient scheduling encounter. • Perform within the expected outcome of the Automated Call Distribution (ACD) environment. • Solves telephone issues and timely reports problems related to volume to manager. • Follow established downtime procedures for registration • As needed: assist with coverage of POS and Pre-Processing Areas, create/mail new patient packets, appointment ‘bumping’, wait list scheduling, resource scheduling, and team scheduling.  Credentials:  Education or Equivalent Experience: \n \n • H.S. Diploma/GED (Required) • And 2+ years Medical office experience, or 4 years of customer service experience. Advanced degree (Associate's, Bachelor's, Master's) may be considered in lieu of experienceEducation Specialization: • Associate of Arts or Science • Education Specialization:  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=22dcacb3776a6f28&fccid=dcff5dab0a5948d4&vjs=3",
            "title": "Clinician (Remote)",
            "company": "ENDEAVORS",
            "location": "Philadelphia, PA 19019",
            "salary": "Not Available",
            "description": "***In addition to the salary, Endeavors is prepared to offer you a sign-on bonus of $5,000.00 payable after 45 days of continuous employment. JOB PURPOSE Provides professional therapeutic services to individuals, families, or groups receiving services within the program area. Must have a license for the state of Pennsylvania. ESSENTIAL JOB RESPONSIBILITIES • Conduct intakes, psychosocial assessments, and mental health diagnosis including the clients’ acuity, strengths, and treatment needs. • Develop family-centered and culturally appropriate treatment plans and provides outpatient services to include: providing individual counseling, family counseling/training, and/or group counseling. Use evidence-based practices and trauma- informed practices. • Work cooperatively with members of a larger treatment or service coordination team, either internally within the agency or externally in the larger community. • Develop, facilitate, and effectively present program curricula for classes or groups on human trafficking, substance abuse/mental health, and other topics. • Responsible for clinical documentation, i.e., progress notes, patient assessments, service/treatment plans, and other forms/records as required in a timely manner. Maintain detailed case files and other documentation in 100% compliance with the program standards. • Participate in actively soliciting feedback from program participants through distributing satisfaction surveys or other approved means. • Meet or exceed program productivity expectations on a regular and sustained basis • Other duties as assigned"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cs0rmy8NcKuMwjZ33B3MwJia_5S8TV5Xj4dHNx35rR_ftUAte2DtJJ9usNnwmihL-gw_DKWyhja2jYAhL6DQZf5wQkDNzPAAFic6I-eL_WJAg99k2aCh6Ji6Rf5YoOVX8UlEOH_AdQrXiE6UklBYltqWC-acf5XqJbt71_IX5LNtwG9faUH6GMfAdhvAD5cPQTyBfhA4eZkgGM7YZvz6ohZazQEQyCFb20BYsRvY3SlSVDhNlGHNfKR3fbHtvb6KEO8YndVipoLCaT3DbjYCQWsW79EDXIfOcBd7r3XcbzvZRTwrX2UDfbzCV7ZpxhvanhiXByAjPhBX4rbJ_u_nyzdAzKhLm7LYWk8jR23ch9EnoeflcNCWQmenEh0YUpiiozY7L_28blnwX-MQW5vXV24vhFmeRG2QvncecaXeI4R0RBwjwY1h3cO5u7K7RwDb9Zu2AqyHqnOJcmzYTugrl1_VNJYe1xrWFkHJS-TP3356PmziAoWxQNszNY3QvazV0lvkFQ6eCULToFyaDvphijQQ6TU_6pDMEcuso0ziUJtv13eIHCF_4LRcxFyPH0lnyYMDms3R8WucjtbEfQuy_2ujHdMDPydAxpdfkAZv_qEJ06fuZQG509aV-AzLrMPWc=&xkcb=SoBO-_M3HKCHnr2aix0FbzkdCdPP&p=13&fvj=1&vjs=3",
            "title": "Patient Accounts Representative",
            "company": "Bryn Mawr Medical Specialists Association",
            "location": "Bryn Mawr, PA",
            "salary": "$17 - $19 an hour",
            "description": "About us Bryn Mawr Medical Specialists Association is a multi-specialty medical group in Bryn Mawr, PA. Our group of highly trained physicians and staff has served the community for over 50 years. This is a professional medical practice that is fast-paced and customer-centric; our goal is to enhance the health of our patients by providing comprehensive, compassionate, coordinated care. BMMSA combines exceptional primary and specialty care for a “one chart” approach to patient-centered healthcare. Our work environment includes: • Modern office setting • Growth opportunities • Lively atmosphere We are looking for an experienced, dedicated individual to fill the position of Patient Accounts Representative. The ideal candidate for this position is someone who is detail oriented and has a strong background in patient billing experience. This individual will be responsible for dealing with patients in a friendly manner, and their main role is to answer questions related to patient invoices and collections, as well as doing work related to reimbursement programs. They will also be responsible for regularly contacting patients via telephone and explaining all charges related to the services provided by our company. Responsibilities: • Processes payments using secure credit card transaction software. • Arrange payment plans on delinquent accounts. • Organize and understand medical claims data. • Answer patient questions on their statements. • Communicate effectively and amicably to patients regarding their balance. Requirements · Minimum high school diploma or equivalent. · Relevant certifications and experience preferred. · Excellent communication and problem-solving skills. For questions, please call 484-272-3270 ext. 3026. Job Type: Full-time Pay: $17.00 - $19.00 per hour Expected hours: 40 per week Benefits: • 401(k) • Dental insurance • Disability insurance • Flexible spending account • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • Monday to Friday Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEiZ3N6-TbIdWEhAofKmZacVVCIYHkPGFXUrDGdi0dWl5w5C6mDUE1KPbJ2FM-j_SwxOEdJqHw0H9ijCzwjSEsWwbIjFlTl1LtzQiozH_lQvcX2xiphiADfn6uyhxp_GedFl8G4cqHqbNW39rwimkHitX_fVDU7OLHCragyfNBCTBhSd_Ryb8h4Fv8crZaQDnmuPuY78vB0K1h-BPlhKflmCNMmKPtAqydequ7yLxxeSdU6fDVO_HspQqmsTMmawTLEBIxT1eUoB0UkP213iFuvdRICIXHAuXA03eClPefdUuTMqK8P32VmSp8DyK66WqQKxQqcLtzvxSotvFzup87nW1chXAvZ6L1_BV1qfaicq2QCjs1XQH3r4eCHoxJpgYnTqhHsPxBvwIcYcQvcwHpKNEA0Y81JTepnZpKGhJEc6MfjCEG-iZu-BAewnDBDIoUb8zCbt1c1oghTcjYOZ-wzX4J8eMVzkQRgWpDaSL0zPAaSglleRc66rNOCpi_aUB30qW1vty2wxmrYFN6igHl08aOvWLqeyx6MR7_UXaO2O4xftw1aRySs04BGCwEl1u9OWfgzXdsITI9jSUK-SNasxj5m2ICJmSIg10n9x8M-uscN3jwccBZTm8_zlwSxE-I9wnZYs7zoQ==&xkcb=SoD6-_M3HKCHnr2aix0EbzkdCdPP&p=14&fvj=1&vjs=3",
            "title": "Administrator for a Mental Health Outpatient Agency in Philadelphia",
            "company": "Growth thru Change",
            "location": "Location Not Found",
            "salary": "$20 - $25 an hour",
            "description": "Job Description for Admin Please note without a cover letter you will not be considered for the role: Growth thru Change and the Ko-OP are seeking an outgoing, detail-oriented, efficient person to join our amazing Admin Team in providing front desk support to our Psychotherapy practice. The ideal candidate will be adept at prioritizing, multi-tasking and have a positive attitude. This Candidate will also be willing to learn and grow with us! Pay: $20 an hour Shifts will be: flexible This role will report to; Owner About Us: We providing Counseling services to PA residents both virtually and at our physical location at 1625 South Street. Local applicants will ONLY be considered for this role. Our Vision We help thousands of people learn to live a life with ease To succeed in this role ….. You will rock this role if you possess excellent communication skills and the ability to lead and promote the vision of the clinic. You must be able to stay extremely organized, thinking 10 steps ahead, and the ability to see the big picture with an entrepreneurial mindset. You have a passion for helping others as you will be communicating with our clients. Qualifications • 2-3 years of experience in Client Care and Customer Service (preferably in a medical office at the front desk) • Psychology undergraduate students and graduates are welcome! Responsibilities • Supporting Clinicians with client bookings, payments, administrating intake & consent forms, etc. • Client support: welcoming clients to the office (occasionally), answering client calls and emails, processing refund payments if needed. • Maintaining Quality Assurance (follow up to payments, managing the booking software including schedules and treatments offered) • Claims processing for Insurance companies Skills & Attributes of our ideal candidate…. • Dynamic, self-motivated individual with the ability to work independently, proactively and well under pressure • High Level computer skills • Strong communication skills, ability to communicate professionally and with compassion to clients with patience when dealing with challenging clients • Confidence to share ideas and constructive criticism to help us grow • Juggling multiple projects and to-do’s simultaneously is no problem for you — you work well under pressure, meet deadlines and keep promises • Tech savvy (we are mostly paper-less and everything is online) • An appetite for innovation and simplicity who is highly process oriented • Working autonomously comes easy to you but you also love collaborating with a talented team • Considerable experience using the Microsoft Office Suite, Google Drive Suite, Gmail, Dropbox, Mac, Windows in a work environment Application Process: Please note without a cover letter you will not be considered for the role: We thank all applicants for their interests: Only those under consideration will be contacted. For more info on our practice, check out our websites: https://psychedelictherapists.co and growththruchange.com/ Job Types: Contract, Part-time Pay: $20.00 - $25.00 per hour Expected hours: 5 – 8 per week Schedule: • Monday to Friday Shift availability: • Day Shift (Required) Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=7cfc04d4e5e6ef69&fccid=36b76cf613fccb72&vjs=3",
            "title": "Medical Records Clerk",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n Title: Medical Records Clerk\nOrganization: PMC Pulmonary Maps\nEntity: CPUP\nLocation: Penn Medicine University City- 3737 Market St\nHours: 8:30-5:00 M-F \n \n \n \n \n Summary: \n • The Medical Records Clerk must maintain a strong patient/customer focus that supports the delivery of the highest quality of care and shares a passion for patient and customer centered care to assist in exceeding patient satisfaction. The primary purpose of the position is to coordinate the medical records process in the practice inclusive of scanning, filing, medical records requests, and patient/customer service. This position is responsible for coordinating and maintaining patient medical records in compliance with and JCAHO policies and procedures. Responsibilities: \n • Daily update of Electronic Medical Records and keep Document Manager in good standing for compliant Medical Records. • Follows appropriate scanning process as specified by UPHS/Department defined process, ensuring patient is properly identified and document is attached/routed appropriately in the EMR. • Prioritizes and scans all appropriate paper data routinely as they come to the department in to the electronic medical record (EMR). • Monthly CQI Report reflecting General Consent tracking Goal is zero yearly outstanding. • Complete AOB updates daily and reporting weekly to meet documentation requirements. • Tracking and processing necessary documentation for Medical Records and Reimbursement requirements. • Confirms visits in CPR+ Visit log for billing purposes daily. • Confirms the presence of the scanned file in the appropriate place in the EMR system prior to the destruction of the paper copy per department protocol. • Sends requests and monitors tracking procedure of any Advanced Directives to be kept in the patient’s record. • As appropriate and as per department protocols, responds to requests and questions related to medical records services in an accurate, timely and professional manner. • Sorts, prioritizes, and disperses faxes and mail according to established protocols. • Retrieving records from external facilities. • Enables communication by answering the phone, providing excellent customer service, and by placing calls to internal and external information sources. • Provides support and backup to Reception and Admin Support group when required. • Maintains compliance with all federal, state and local regulatory standards and requirements. • Performs duties in accordance with Penn Medicine and entity values, policies, and procedures. Education or Equivalent Experience: \n • H.S. Diploma/GED (Required) • And 2+ years work experience required of which one year is in a health/medical office environment (Required). \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=ebd9fba7dd50747b&fccid=36b76cf613fccb72&vjs=3",
            "title": "Unit Secretary- Pulmonology- Silverstein 9- HUP - FT Evenings (Shifts May Vary)",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n The Penn Medicine Recruitment team is seeking a Full-Time, Unit Secretary for our Pulmonology unit, Silverstein 9 @ The Hospital of the University of Pennsylvania \n This schedule for this position is as follows- 3pm-1130pm with flexible shifts that include 11a – 1130p and 7a – 330p / 7a – 730p. • The Unit Secretary is an integral member of the health care team who delivers quality care through collaboration and communication with team members. They work under the direct supervision of the nurse manager and the registered nurse to support the clerical and secretarial operations of the patient care unit. Some of the major responsibilities will include managing clerical and information systems, receptionist duties, collection and reporting of patient data, incorporating organizational competencies of superior quality care and assuming responsibility and accountability for their role performance outcomes while supporting HUP's Standards of Excellence.The Unit Secretary must be a high school graduate or have an equivalency diploma. Post high school education, which includes computer courses and medical terminology, preferred. Familiarity with typewriter/computer keyboard preferred.  Responsibilities: \n • Answers telephones, takes and relays messages promptly, and answers inquiries. • Greets patients and visitors, gives directions, and answers questions. • Communicates with nursing staff and hospital staff about patients’ needs and whereabouts. • Ensures that patient consents and Advance Directive paperwork is in order. • Support Medication Reconciliation Process through appropriate chart forms and electronic auditing. • Answers the patient call bell system and promptly communicates the patients’ needs to the appropriate healthcare team member. • Facilitates access for security door/intercom system on locked nursing units as indicated—respectfully answers intercom request for entry onto the unit and follows through with security measures defined by nursing unit guidelines. • Reports security door malfunctioning to the charge nurse, security and maintenance as indicated. • Assists nurses, physicians and other health care providers in emergency situations by arranging for emergency studies, placing routine, CODE and STAT telephone pages. • Arranges for patient transport as needed. • Sorts and delivers patient flowers, mail, and packages according to unit needs. • Calls for equipment and supplies as needed by the patient and arranges for return of equipment after use. • Places calls, electronic info-grams and/or completes supportive paperwork to supportive serve departments regarding minor problems. • Notifies Nurse Manager of problems of a more serious nature. • Submits completed paperwork for Nurse Manager’s signature. • Communicates patient arrival on unit, impending transfers, or discharges by entering the appropriate information into the computer system. • Enters discharge information and appropriate admission and discharge code in the hospital electronic information system as soon as the patient either arrives on the unit or leaves the unit. • Maintains the Admission, Discharge, and Transfer Log book. • Maintains patient medical record in appropriate order: identifies each sheet with patient identification. • Files and charts laboratory, radiology and other patient information forms in appropriate sections of each patient chart. • Checks charts for sufficient supply of imprinted forms. • Gathers all components of patient chart, including bedside chart from wall desks; assembles in proper discharge order; and ensures each page of the chart is properly imprinted when patient is discharged. • Prepares necessary patient chart copies for discharge to new level of care — Rehabilitation, Psychiatry and/or Hospice.Prepares patient chart for all transitions in care: for tests, new patient care units, etc. • Prepares the Transition Pass as directed. • Facilitates patient progression through regular updates with the charge nurse and clinical staff. • Accountable for placing completed discharge charts in locked box for pickup by Medical Records personnel. • Maintains and updates patient identification bracelets as needed and ensures patient identification bar code stickers are accurate. • Keeps requisition locations filled and ensures sufficient supplies are available at the nurses’ station. • Monitors stationery and paper products levels; initiates order for supplies as directed by the Nurse Manager; maintains locations of forms in compliance with established guidelines. • Maintains work area and mobile workstations in orderly fashion. • Assists Nurse Manager in data collection for departmental projects/research when appropriate. • Provides suggestions at staff meetings and other forums regarding changes in unit practices that provide for improved delivery of patient service. • Accepts reassignment to other units as directed by Nurse Manager or Charge Nurse. • Sensitive and responsive to patient, family, and customer satisfaction issues by demonstrating courtesy and respect for patients, family visitors, hospital staff and employees. • Supports and contributes to the unit’s patient satisfaction goals. • Communicates pertinent observations to appropriate members of the health care team in a timely fashion. • Works in collaboration with all members of the healthcare team. • Provides direction to the medical teams for completing the electronic death certificate. Secures the certificate according to guidelines. • Provides direction to the medical teams for completing the fetal death certificate when appropriate. • Supports the process of notification to Gift of Life.  Education or Equivalent Experience: \n \n • H.S. Diploma/GED (Required)  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=9b0823313a32a2dc&fccid=352384cc32f12434&vjs=3",
            "title": "Medical QA Specialist I",
            "company": "QTC Management, Inc.",
            "location": "1617 John F Kennedy Blvd, Philadelphia, PA 19103",
            "salary": "$23.10 an hour",
            "description": "Are you a medical professional who has a knack for reviewing/interpreting medical records and a passion for helping others? If so, we would love to speak with you! QTC is seeking a Medical Quality Assurance (QA) Specialist to support our Veteran Affairs Operations in Philadelphia, PA. Who is QTC Management Inc.? QTC is the nation’s largest provider of disability and occupational health examination services. We are PASSIONATE about our country’s veterans, UNITED as a team and INSPIRED to make a difference. To provide high-quality, timely, and customer-focused medical examination service solutions, we honor our core values of integrity, innovation, agility, collaboration, inclusion and commitment. We celebrate diverse thinking and welcome contributions from all. What part would you play in this role? As a Medical QA Specialist, you will work closely with medical providers and the Veterans Administration to ensure the documentation process is complete and accurate. In this role, you will review documentation sent over from medical providers and ensure the report is complete, accurate and the veteran has received consultation for all of the medical issues listed. In this rewarding role, you will: • Review exam reports sent over from medical providers • Ensure all medical coding is complete and accurate • Ensure all tests have been ordered and completed • Coordinate with medical providers as needed for clarification of reports • Work with our in house appointment schedules to request additional appointments for the veteran as necessary You must have: • High School diploma, or equivalent (GED) • In-depth knowledge of anatomy and medical terminology In-depth knowledge of anatomy and medical terminology • Ability to read medical reports Preferred to have: • Experience within medical coding and documentation • Knowledge of military medical examinations • Vocational training in the medical field, i.e. LVN, Military Corpsman/Medic, EMT, Medical Scribe, MA (back office), etc. Typical Day: • Mon – Fri: 8:30am – 5pm EST • Positions are located ONSITE at our Philadelphia, PA located 1617 JFK Boulevard Pay and Benefits: Starting pay: $ 23.10 per hour Pay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. As a result, we offer meaningful and engaging careers to support you and your career goals, all while nurturing a healthy work-life balance. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here. • The QTC Management pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to): geographic location, responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law \n  Commitment to Diversity This job description supersedes all prior job descriptions and is intended to describe the general content and essential requirements for the position listed above. It is not to be construed as an exhaustive statement of requirements, duties and responsibilities. Management reserves the right to add or change the duties of this position as required at any time. QTC Management Inc. is a VEVRAA Federal contractor and an Equal Opportunity Employer. The company has an ongoing commitment to affirmative action and the creation of a workplace free of discrimination, harassment and retaliation. The company recruits, hires, trains, and promotes individuals in all job titles without regard to race, color, creed, religion, ancestry, national origin, age, sex, sexual orientation, people with disabilities protected under law, and protected veteran status.  • Less than 1 year(s): Healthcare, medical, or insurance related industry experience • Experience with case management software, electronic medical records and medical databases • Direct healthcare experience in medical case management or quality assurance to include the review of complex multi-focal medical reports for quality, clarity, thoroughness and insightful medical explanation • GED or better • High School Diploma or better • Technical/other training or better in HM Navy Medic or related field • Technical/other training or better in Army Practical Nursing or related field • Technical/other training or better in Vocational Nursing or related field • Technical/other training or better in Combat Medic or related field • Technical/other training or better in Medical Assistant or related field • Foreign Medical Graduate or better • Corpsman or better • Computer Literacy • Analytical • Review Medical Reports/Evaluations • Sense of Urgency • Human Anatomy/Physiology • Written Communication • MS Office • Medical Terminology • Electronic Medical Records • Team Player: Works well as a member of a group • Detail Oriented: Capable of carrying out a given task with all details necessary to get the task done well • Job Security: Inspired to perform well by the knowledge that your job is safe • Ability to Make an Impact: Inspired to perform well by the ability to contribute to the success of a project or the organization • Growth Opportunities: Inspired to perform well by the chance to take on more responsibility • Goal Completion: Inspired to perform well by the completion of tasks Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=5c8de4f3987581f7&fccid=36b76cf613fccb72&vjs=3",
            "title": "Perioperative Assistant - Operating Room @ Penn Presbyterian Medical Center(Full-Time Evening)",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n Summary: \n \n • The Perioperative Assistant assumes responsibility for logistical and environmental functions in the operating room. Responsibilities: \n • High level cleaning of all operating rooms between cases with exposure to blood and bodily fluids • Management of all operating room equipment by frequent cleaning, organizing, pushing/pulling, and lifting • Transporting patients to and from the operating room if applicable • Completing blood and pathology runs for all patients in the operating room • Frequent stocking of the operating room with supplies • Frequent rounding in the operating room to assess patient care needs • Assist in positioning patient as directed by the RN • Carries out unit specific duties and other duties as directed by the nurse manager • Actions demonstrate an understanding of appropriate safety and infection control techniques and hospital policy • Recognizes stressful situations and seeks appropriate resources in a timely manner Credentials: Education or Equivalent Experience: \n \n • H.S. Diploma/GED (Required) • Previous hospital experience preferred  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/company/CKR-for-Temple-Health-and-Fox-Chase-(ClickCast-Bidding-Model)/jobs/Call-Center-Representative-4a1529aa1a22afdb?fccid=83ed0e599be08792&vjs=3",
            "title": "CALL CENTER SPECIALIST (40hrs/wk 8AM-4:30PM + every other weekend and holi",
            "company": "CKR for Temple Health and Fox Chase (ClickCast Bidding Model)",
            "location": "Jenkintown, PA",
            "salary": "$18 - $20 an hour",
            "description": "Serves as the single point of contact to internal and external customers to ensure easy and seamless access to physicians, employees, patients, programs and services. Handles complex requests through various channels while utilizing numerous databases simultaneously. Communicates via written correspondence to patients and physicians on a daily basis. Provides appropriate and clinically relevant information and facilitates requests within the designated timeframes based on clinical urgency as defined per protocol. Maintains knowledge of emergency procedures and ensures proper notification. Assures database compliance and integrity. Education\nHigh School Diploma or Equivalent (Required)\nBachelors Degree : in Marketing, Communications or Healthcare. (Preferred)\nCombination of relevant education and experience may be considered in lieu of degree. \n \n \n Experience\n2 Years experience in customer service. (Required)\nGeneral Experience communicating in Spanish (Bilingual) (Preferred)\nGeneral Experience in a managed care and insurance, physician practice or call center environment (Preferred) \n \n \n Job Type: Full-time Pay: $18.00 - $20.00 per hour Benefits: • 401(k) • 401(k) matching • Dental insurance • Flexible schedule • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • Day shift • Holidays • Weekends as needed Work Location: In person"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=0fb4a135964b3cfd&fccid=cce48ad42816872f&vjs=3",
            "title": "Behavioral Health Associate - Einstein Behavioral Health Residential Facility",
            "company": "Thomas Jefferson University & Jefferson Health",
            "location": "Philadelphia, PA 19144",
            "salary": "Not Available",
            "description": "Primary Function: Under the direction and supervision of a professional nurse, performs and assists with various tasks including basic patient care, direct and indirect diagnostic and therapeutic procedures.  \n This position requires providing service to the following age population(s); older adult, adult, adolescent and children, in a manner that demonstrates an understanding of the functional/developmental age of the individual served.  \n Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Education/Training/Experience: High school diploma or equivalent (GED) along with at least 12 college credits and 2 years experience in Human Services field; or, Associates Degree with major in human service field and 2 years experience in human service field; or, Bachelor’s Degree with major in human service field and 1 year of experience in human service field. Completion of CPR during orientation. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BUPDbJAQAve-3lpcKY-eKGf7j80cWlLCFez2pYkKOVjvaK55vj8TsnSJvJd-CcIUy7lT_nSSSaCLbVamBHYiqUj1wUzvXcwTJAuYIbtCjhfDvhMj0vQBtf1TedaIikxLcyy_eLw6J0agB9GA2uA06z7tMEoaQOd4tLCeWOAwrjb2VD-b_4ZDcKO0wjiqefbHZYy38pwZNGSe3_Px363MAdrV0RdrMTJiIbfTAlxkSFEPs-Co55qRQ2yYb9WuzvprtF39KkCCkUU7R8IQEmXmHkyxLnwZF0DFVDDVx81XLrGU4OFpY-1weBiDlfwIB1tTK6Kt5s-lL6-PSj0Q-ORm_b27e1YlO1-69lI8dZExBtlHb_xKHOdHEBmKD0z-tTwD_qGQroWZj3Vzb5kfK1cMMTLnafFbDRu0vauBX-rKGN2hWjnr379cMxFFfNRoOSwH2iPPdyApTw8KBjv9EKL6cTvyfGpum1FBt4sCvpJw1ulfJy6LG-D54NYwJje4vkip70APJdkIvidYVF80qDAv_Gap7UeRzl_JPZc-p1UbC6wBFJky2tFV2KZtVFmMGYyjkulRtzJFAh62lJ70zeDJ5cW7KvCE5WvLKrsY6uwGNtuk4FctFlIrOCUbM3LIfqi3_uaA2MGf_g3uIelPaNCmRjAuCYyhx55StmM3wWRHgquLYJlsJi3dzq3Myf4XUN4g1ZhEUMkV7XY5Lg-FUeLAWbOEdxtLhrnQlhV4Z8y4AgewEKC08Kgi5z_YtPjqnfTmb87Y4En9OHk-_alxIPbel1EmGiE8dVH93nRp8YTmA6gvWDcYwlR495pOH5W5Dnq2qhLcG8m99bBSZrCvXxC78o-KDKVvflBs7PMXL_jssDe8SBW_Ghhyz7er4PE3oaNQO3gJpUHGgANN-iB8FZUMWnus8xZEfqs5ywxIGGOPNfH9vr5IXZnVbNgV_325EBNfh4qN7HhNUGHe3Fg08P0P4PwYCPTmRkdmvsQMPEppyjbUfoTsaxWv7oAe2pzOJhqcloXhI7rnntt8LbqXiDW4J52dp2wpFnH4qFAYuWdatpV5hKS508uufEowoyCUuY-_tcMfd05QqMthq8wZNWgkWIsTlhUdnYfIU76Md6stUNkw==&xkcb=SoBP-_M3HKCHspyD2Z0NbzkdCdPP&p=6&fvj=0&vjs=3",
            "title": "Locum | Physician Pediatrics",
            "company": "Weatherby Healthcare",
            "location": "Location Not Found",
            "salary": "$90 - $110 an hour",
            "description": "• Must have active state license • BC or BE required • Days • BLS required • 21 patients per day • Well/sick visits • Credentialing not needed • DEA needed • Paid malpractice insurance; pre-paid travel and housing expenses • Assignment details and time entry in online portal • Competitive compensation • 24-hour access to your Weatherby Healthcare consultant • Charter member of NALTO Ranges shown should be used as an estimate and are affected by many factors including the critical need of the position, your overall experience and qualifications, and other considerations. Please reach out to your consultant for more information."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=0ed58b132b701556&fccid=cce48ad42816872f&vjs=3",
            "title": "Jeff Temp - Medical Assistants (Center City/South Philadelphia)",
            "company": "Jefferson - Center City, Philadelphia, PA",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Jeff Temps, Jefferson's in-house temp service, is seeking experienced, Certified Medical Assistants to apply for our temporary pool. We invite you to be a part of a select team committed to superior care.  Essential Functions: \n The Medical Assistant assists physicians as they assess, examine and treat patients. Responsiblities include patient flow management and various diagnostic procedures such as EKGs, phlebotomy, injections and vitals. Acts as liaison to physicians to ensure patient satisfaction. Maintains and orders supplies for their area as needed. \n  Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Since this position will require the selected candidate to engage in regular contact with children in the form of care, guidance, supervision or training, you will be required to meet the requirements of the Child Protective Services Act, including the Pennsylvania State Police criminal background check, the Pennsylvania Department of Welfare child abuse criminal background clearance, and an FBI finger print based federal criminal records check. The selected candidate will not be allowed to commence working until all three (3) are completed satisfactorily. Position Requirements: • High School Diploma or Equivalent required • Current certifications/registrations required • BLS required • Minimum of 2 years experience."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=156f6b2732513ac9&fccid=02c3642d72b15da7&vjs=3",
            "title": "Medical Records Technician (Health Information Technician)",
            "company": "US Veterans Health Administration",
            "location": "3900 Woodland Ave, Philadelphia, PA 19104",
            "salary": "$60,112 - $72,146 a year",
            "description": "Duties for this position include but are not limited to: • Prepares lists of paper health records needed for signature(s) that are in the incomplete record area for distribution to appropriate service lines (i.e., Medicine, Surgery, Psychiatry, etc.) or that are not complete in the electronic health record. • Monitors delinquent dictation list for follow up purposes on necessary documents (i.e., operation reports, discharge summaries, etc.) that are needed for completion of health records. • Notifies appropriate physician and other personnel of the status of dictation. • Monitors house staff rotation schedule and contacts resident house staff to insure completion of records prior to departure from the Medical Center if applicable. • Utilizes basic knowledge of medical terminology, anatomy and physiology, and coding to research and collect information for various medical studies and research projects utilizing the Patient Treatment File (PTF) . • Conducts periodic audit of records processing activities. • Participates in approved quality improvement focused reviews. • Coordinates review activities with the Quality Improvement Program to satisfy external accreditation requirements, and to satisfy current Medical Center performance measures. • Assists with capture and reporting of health record documentation deficiencies as needed including downloading data and creating trended reports. • Preforms analytical tasks associated with the resolution of \"filing\" errors on reports uploaded by a transcription vendor. This includes correctly identifying the patient the report belongs too and filing/assigning it correctly. Makes appropriate recommendations for changes or solutions and facilitate appropriate recommendations for corrective action when authorized so continued filing errors do not occur. • Identifies reviews, verifies, and corrects all statistical data concerning medical transcription to maintain accuracy of medical and statistical reports. Compares and resolves discrepancies between daily Gains and Losses Sheet, Digital System Workload Report, and contract transcription logs as it relates to timeliness and accuracy of dictated reports completed by medical transcription contractor. • Reviews health records to ensure that all records contain sufficient information to meet medical/legal requirements, to ensure continuity of patient care, and to support education and research needs. Assists clinicians with completion of delinquent/incomplete health records. • Consults with the appropriate clinician(s) for clarification when conflicting or ambiguous information appears in the health record documentation. • Brings questions regarding conflicting or unclear documentation to the (insert position title) prior to consulting with the clinician. • Identifies health record deficiencies, tracks deficiencies, and ensures that the appropriate individual completes their deficiencies. • Assists physicians with the completion of delinquent/incomplete health records and servers as the expert resource for clinical staff regarding requirements for complete documentation. • Assesses the paper health record and electronic Computerized Patient Record System (CPRS) for completeness and notes deficiencies in the (insert name of record deficiency monitoring system such as IRT, Nuance, etc.). \n \n \n   • You must be a U.S. Citizen to apply for this job. • All applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA. • Selective Service Registration is required for males born after 12/31/1959. • Must be proficient in written and spoken English. • You may be required to serve a probationary period. • Subject to background/security investigation. • Selected applicants will be required to complete an online onboarding process. • Must pass pre-employment physical examination. • Participation in the seasonal influenza vaccination program is a requirement for all Department of Veterans Affairs Health Care Personnel (HCP). • Participation in the Coronavirus Disease 2019 (COVID-19) vaccination program is a requirement for all Veterans Health Administration Health Care Personnel (HCP) - See \"Additional Information\" below for details.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n • Ability to judge whether health records contain sufficient information for regulatory requirements, are acceptable as legal documents, are adequate for continuity of patient care, and support education and research needs. • Ability to take appropriate actions if health record content is not adequate, accurate, timely, and/or reliable. • Ability to communicate both orally and in writing with individuals or groups, to facilitate compliance with established policies and regulations. • Skill in using appropriate software and computer applications to analyze and record documentation trends. • Ability to apply qualitative and/or quantitative methods for assessment and improvement of health records. • Ability to work independently and utilize problem-solving techniques in the accomplishment of work. \n \n \n \n \n IMPORTANT: A transcript must be submitted with your application if you are basing all or part of your qualifications on education.\n\nNote: Only education or degrees recognized by the U.S. Department of Education from accredited colleges, universities, schools, or institutions may be used to qualify for Federal employment. You can verify your education here: http://ope.ed.gov/accreditation/. If you are using foreign education to meet qualification requirements, you must send a Certificate of Foreign Equivalency with your transcript in order to receive credit for that education. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html. \n \n Receiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThis job opportunity announcement may be used to fill additional vacancies.\n\nThis position is in the Excepted Service and does not confer competitive status.\n\nVA encourages persons with disabilities to apply. The health-related positions in VA are covered by Title 38, and are not covered by the Schedule A excepted appointment authority.\n\nPursuant to VHA Directive 1193.01, VHA health care personnel (HCP) are required to be fully vaccinated against COVID-19 subject to such accommodations as required by law (i.e., medical, religious or pregnancy). VHA HCPs do not include remote workers who only infrequently enter VHA locations. If selected, you will be required to be fully vaccinated against COVID-19 and submit documentation of proof of vaccination before your start date. The agency will provide additional information regarding what information or documentation will be needed and how you can request a legally required accommodation from this requirement using the reasonable accommodation process.\n\nIf you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement. \n \n \n \n \n \n \n \n \n \n \n • Benefits\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nReview our benefits\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered. Benefits A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.  Review our benefits Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered. You will be evaluated for this job based on how well you meet the qualifications above. IN DESCRIBING YOUR EXPERIENCE, PLEASE BE CLEAR AND SPECIFIC. WE MAY NOT MAKE ASSUMPTIONS REGARDING YOUR EXPERIENCE. Your application, resume, C.V., and/or supporting documentation will be verified. Please follow all instructions carefully. Errors or omissions may affect consideration for employment.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nThe Department of Veterans Affairs performs pre-employment reference checks as an assessment method used in the hiring process to verify information provided by a candidate (e.g., on resume or during interview or hiring process); gain additional knowledge regarding a candidate's abilities; and assist a hiring manager with making a final selection for a position.\n\nIt is the policy of the VA to not deny employment to those that have faced financial hardships or periods of unemployment.\n\nVeterans and Transitioning Service Members: Please visit the VA for Vets site for career-search tools for Veterans seeking employment at VA, career development services for our existing Veterans, and coaching and reintegration support for military service members. \n \n \n \n \n \n \n \n • Benefits\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nReview our benefits\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered. Benefits A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.  Review our benefits Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered. • Required Documents\nAs a new or existing federal employee, you and your family may have access to a range of benefits. Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee. You may be eligible for the following benefits, however, check with your agency to make sure you're eligible under their policies.\nTo apply for this position, you must provide a complete Application Package which includes:\nDocument: VA 10-2850c\nResume\n\n\nVA Form 10-2850c Application for Associated Health Occupations can be found at: About VA Form 10-2850C | Veterans Affairs.\n\nThe following documents are accepted, and may be required if applicable to your eligibility and/or qualifications for this position. Please use this checklist to ensure you have included all documents required for your application, such as a copy of your transcript (if using education to qualify), SF-50's (current/former Federal employees), etc.\n\nCover Letter\nDD-214/ Statement of Service\nDisability Letter (VA)\nDocument: VA 10-2850c\nResume\nSF-50/ Notification of Personnel Action\nTranscript\n\n\nVeterans' Preference: When applying for Federal Jobs, eligible Veterans should claim preference for 5pt (TP), 10pt (CP/CPS/XP), or for Sole Survivor Preference (SSP) in the questionnaire. You must provide a legible copy of your DD214(s) which shows dates and character of service (honorable, general, etc.). If you are currently serving on active duty and expect to be released or discharged within 120 days you must submit documentation related to your active duty service which reflects the dates of service, character of service (honorable, general, etc.), and dates of impending separation. Additionally, disabled veterans and others eligible for 10-point preference (such as widows or mothers of eligible Veterans) must also submit an SF-15 \"Application for 10 Point Veteran Preference\" with required proof as stated on the form. Documentation is required to award preference. For more information on Veterans' Preference, please visit Feds Hire Vets - Veterans - Job Seekers - Veterans' Preference.\nIf you are relying on your education to meet qualification requirements:\nEducation must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.\nFailure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating. Required Documents As a new or existing federal employee, you and your family may have access to a range of benefits. Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee. You may be eligible for the following benefits, however, check with your agency to make sure you're eligible under their policies. To apply for this position, you must provide a complete Application Package which includes: \n • Document: VA 10-2850c • Resume \n \n \n \n \n \n • Cover Letter • DD-214/ Statement of Service • Disability Letter (VA) • Document: VA 10-2850c • Resume • SF-50/ Notification of Personnel Action • Transcript \n \n  Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating. • How to Apply\nAll applicants are encouraged to apply online. To apply for this position, you must complete the full questionnaire and submit the documentation specified in the Required Documents section below. The complete application package must be submitted by 11:59 PM (ET) on 12/07/2023 to receive consideration. To preview the questionnaire click https://apply.usastaffing.gov/ViewQuestionnaire/12118414.\nTo begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USA JOBS resume and/or other supporting documents and complete the occupational questionnaire.\nClick Submit My Answers to submit your application package.\n\nNOTE: It is your responsibility to ensure your responses and appropriate documentation is submitted prior to the closing date.\n\nTo verify your application is complete, log into your USA JOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the more information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USA JOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USA JOBS account or your application will be incomplete.\nAgency contact information\nNicholas Gentile\nEmail\nnicholas.gentile@va.gov\nAddress\nCorporal Michael J Crescenz Department of Veterans Affairs Medical Center\n3900 Woodland Avenue\nPhiladelphia, PA 19104\nUS\nNext steps\nOnce your online application is submitted you will receive a confirmation notification by email. After we receive application packages (including all required documents) and the vacancy announcement closes, we will review applications to ensure qualification and eligibility requirements are met. After the review is complete, a referral certificate(s) is issued and applicants will be notified of their status by email. Referred applicants will be notified as such and may be contacted directly by the hiring office for an interview. All referred applicants receive a final notification once a selection decision has been made.\n\nYou may check the status of your application at any time by logging into your USA Jobs account and clicking on Applications. Information regarding your application status can be found in the USAJobs Help Center.\n\nNOTE: Participation in the seasonal influenza program is a condition of employment and a requirement for all Department of Veterans Affairs Health Care Personnel (HCP). It is a requirement that all HCP to receive annual seasonal influenza vaccination or obtain an exemption for medical or religious reasons. Wearing a face mask is required when an exemption to the influenza vaccination has been granted. HCP in violation of this directive may face disciplinary action up to and including removal from federal service. HCP are individuals who, during the influenza season, work in VHA locations or who come into contact with VA patients or other HCP as part of their duties. VHA locations include, but are not limited to, VA hospitals and associated clinics, community living centers (CLCs), community-based outpatient clinics (CBOCs), domiciliary units, Vet centers and VA-leased medical facilities. HCP include all VA licensed and unlicensed, clinical and administrative, remote and onsite, paid and without compensation, full- and part-time employees, intermittent employees, fee basis employees, VA contractors, researchers, volunteers and health professions trainees (HPTs) who are expected to perform any or all of their work at these facilities. HPTs may be paid or unpaid and include residents, interns, fellows and students. HCP also includes VHA personnel providing home-based care to Veterans and drivers and other personnel whose duties put them in contact with patients outside VA medical facilities. How to Apply All applicants are encouraged to apply online. To apply for this position, you must complete the full questionnaire and submit the documentation specified in the Required Documents section below. The complete application package must be submitted by 11:59 PM (ET) on 12/07/2023 to receive consideration. To preview the questionnaire click https://apply.usastaffing.gov/ViewQuestionnaire/12118414. • To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USA JOBS resume and/or other supporting documents and complete the occupational questionnaire. • Click Submit My Answers to submit your application package. \n \n \n  nicholas.gentile@va.gov  \n \n \n Once your online application is submitted you will receive a confirmation notification by email. After we receive application packages (including all required documents) and the vacancy announcement closes, we will review applications to ensure qualification and eligibility requirements are met. After the review is complete, a referral certificate(s) is issued and applicants will be notified of their status by email. Referred applicants will be notified as such and may be contacted directly by the hiring office for an interview. All referred applicants receive a final notification once a selection decision has been made.\n\nYou may check the status of your application at any time by logging into your USA Jobs account and clicking on Applications. Information regarding your application status can be found in the USAJobs Help Center.\n\nNOTE: Participation in the seasonal influenza program is a condition of employment and a requirement for all Department of Veterans Affairs Health Care Personnel (HCP). It is a requirement that all HCP to receive annual seasonal influenza vaccination or obtain an exemption for medical or religious reasons. Wearing a face mask is required when an exemption to the influenza vaccination has been granted. HCP in violation of this directive may face disciplinary action up to and including removal from federal service. HCP are individuals who, during the influenza season, work in VHA locations or who come into contact with VA patients or other HCP as part of their duties. VHA locations include, but are not limited to, VA hospitals and associated clinics, community living centers (CLCs), community-based outpatient clinics (CBOCs), domiciliary units, Vet centers and VA-leased medical facilities. HCP include all VA licensed and unlicensed, clinical and administrative, remote and onsite, paid and without compensation, full- and part-time employees, intermittent employees, fee basis employees, VA contractors, researchers, volunteers and health professions trainees (HPTs) who are expected to perform any or all of their work at these facilities. HPTs may be paid or unpaid and include residents, interns, fellows and students. HCP also includes VHA personnel providing home-based care to Veterans and drivers and other personnel whose duties put them in contact with patients outside VA medical facilities. \n \n \n \n • Fair and Transparent\nThe Federal hiring process is set up to be fair and transparent. Please read the following guidance.\nEqual Employment Opportunity (EEO) Policy\nReasonable accommodation policy\nFinancial suitability\nSelective Service\nNew employee probationary period\nSignature and false statements\nPrivacy Act\nSocial security number request Fair and Transparent The Federal hiring process is set up to be fair and transparent. Please read the following guidance. • Equal Employment Opportunity (EEO) Policy • Reasonable accommodation policy • Financial suitability • Selective Service • New employee probationary period • Signature and false statements • Privacy Act • Social security number request To apply for this position, you must provide a complete Application Package which includes: \n • Document: VA 10-2850c • Resume \n \n \n \n \n \n • Cover Letter • DD-214/ Statement of Service • Disability Letter (VA) • Document: VA 10-2850c • Resume • SF-50/ Notification of Personnel Action • Transcript \n \n  Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating. \n • The public\nU.S. Citizens, Nationals or those who owe allegiance to the U.S. U.S. Citizens, Nationals or those who owe allegiance to the U.S. This posting is open to the public"
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=2355913a7a05b766&fccid=9e2f84f52ca283a0&vjs=3",
            "title": "Per diem Patient Service Representative - Call Center",
            "company": "Wills Eye Hospital",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Primary Function • The Patient Services Representative communicates with patients via the telephone to ensure accurate, prompt and courteous scheduling of primary care appointments, such as preventative screenings or routine office visits. This position is also responsible for delivering superior customer service, answering phones, confirming appointments, communicating with all departments and individuals regarding matters relating to patient care, and obtaining and entering accurate demographic/insurance information for all encounters including patient financial expectations. Essential Duties and Responsibilities • Promptly answers incoming calls to schedule appointments for patients; makes outbound calls when follow-up is needed. • Ensures efficient processing and documentation of all information required for insurance verification, registration and billing in the Electronic Medical Record (EMR) system. • Demonstrates superior customer service to all external and internal customers and helps facilitate smooth flow of patient phone calls. • Communicates effectively with patients, physicians, and/or other departments regarding delays or any issues relating to patient appointments. • Consistently achieves team metric standards and expectations. • Maintains strict confidentiality at all times. • Positively support mission, vision and values of the Hospital. • Brings forth any compliance/ethics issues and recommendations for operational improvement. • Ensures successful adherence to policies, procedures and changes to the organization."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=cc497526ec1a7a14&fccid=36b76cf613fccb72&vjs=3",
            "title": "Scheduling Administrator",
            "company": "Penn Medicine",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "Description \n \n Summary: \n \n • The Scheduling Administrator provides administrative support to the Director for Room Technology, as well as provides administrative assistance to Media Technology and Production Department. This position assists by reviewing and approving AV support requests into the PSOM and UPHS centralized scheduling systems, assisting with the creation and assignment of the daily schedule and by functioning as delegate in the filtering, triaging, and responding to Media Technology and Production email. This position assists in compiling, creating, formatting, assigning, and tracking overtime projects including assigning MTP staff. Additionally, this position provides more general administrative assistance including, but not limited to, the preparation, dissemination, and management of electronic and paper documents and file coordination; scheduling meetings and conference rooms; triaging and referring service requests. This position will assist in the tracking and scheduling of MTP staff and resources to Penn Medicine Health System events both onsite and remote. This position also assists/backs up the MTP Program Coordinator including, but not limited to, prepares/reconciles travel arrangements and expense reimbursements, prepares and enters monthly cost recovery journals and other financial transaction documents. May assist office staff in completing large projects that require general administrative support; and other duties as assigned. This position is considered \"essential.\"  Responsibilities: • Retrieves and compiles information from multiple sources (AVRC, telephone, and email) to assist MTP Directors or other leadership by entering MTP Resource/Talent information into EMS and NFS (Workspace). Acts as liaison between requesters and MTP leadership, and between Special Events/Scheduling and MTP Leadership. Tickles, researches, prompts MTP Leadership, and/or provides follow-up communication regarding MTP Resources/Talent or AVRC requests. \n • Working closely with Director, as Director’s Delegate, triages incoming email by urgency and subject. Drafts or transcribes email responses on Director’s behalf. Assists in management of Director’s calendar. Updates Director’s task list with incoming requests. \n • Creates, compiles, proofreads, submits-for-approval, and distributes the daily MTP event schedule by 4:00pm. \n • Creates, compiles, proofreads, submits-for-approval, and distributes the weekly MTP overtime signups by Friday 12:00pm. Compiles requests, proofreads, assigns, submits-for-approval, and distributes the weekly MTP overtime assignments Monday by 4:00pm. Retrieves and communicates last-minute overtime jobs and collaborates with MTP staff to ensure support is assigned. Assists in the distribution of mandatory overtime when necessary. \n • Working closely with the MTP Program Coordinator and the MTP Leadership, research, drafts, reviews, and posts monthly cost recovery journals. Working closely with MTP staff and MTP Program Coordinator, prepares and reconciles travel arrangements, and expense reimbursements, checking submissions for completeness and appropriateness consistent with Corporate IS Policy and Procedures. \n • Supports Media Technology and Production workgroup in performing departmental administrative functions to facilitate completion of major tasks. Under general supervision, provides administrative support to staff with clerical functions and assists in reconciling A/V equipment inventory. \n • Working closely with the MTP Program Coordinator, maintain, inventory, order office supplies.  Education or Equivalent Experience: \n \n • H.S. Diploma/GED (Required) • 3+ years Professional office support (Required)  Skills/Abilities: \n  • Strong customer service orientation and ability to follow through issues to resolution. • Organizational and detail-oriented skills are essential. • Able to set priorities, organize tasks and work independently. • Must be able to maintain effective work relationships at all levels. • Experience with all Microsoft Office products. • Competent written, verbal and mathematical skills are required. • Ability to work in a fast paced environment with changing priorities.  Be a part of the exciting and ground-breaking upcoming years for the Penn Medicine Information Services department! \n Because growth is essential to continuing to meet the current and future needs of patients, Penn Medicine continues to expand its capabilities. Penn Medicine's Information Services (IS) Department focuses its efforts on the clinical and financial systems that support the day-to-day operations of four hospitals, several satellite practices, and more than 2,000 physicians.   \n Learn more about Information Services: https://www.pennmedicine.org/information-services  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=375d32d4099aab5f&fccid=e9ecdac43ad0cc8d&vjs=3",
            "title": "Administrative Support",
            "company": "Genex Services",
            "location": "Location Not Found",
            "salary": "$18 an hour",
            "description": "Job Duties & Responsibilities: \n • The CSS is able give status updates and to seek assistance when needed to try to reach unresponsive or uncooperative claimants. • The CSS provides overall assistance and support to the department, including but not limited to assisting with status updates and completing adminstrative reponsibilities. • The CSS will interact with the client company account manager, their manager, and the SS department manager as needed."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=57c815a09fa4da37&fccid=cce48ad42816872f&vjs=3",
            "title": "Food Services Associate-Einstein Medical Center (Part Time-Evenings)",
            "company": "Jefferson - Philadelphia, PA",
            "location": "Location Not Found",
            "salary": "Not Available",
            "description": "• The primary function of the trayline worker is to assemble patient meal trays by following the tray ticket, food placement, accuracy of items, portions, requests of menu tickets. • Ensures each station is correct for portion, equipment, menu items. • Cleans/sanitizes & replenishes all stations prior to completing their shift. • Responsible for cleaning of food carts, clean dirty trays, and serviceware. • Responsible for some food production. • Will be cross trained different areas such as but not limited to storeroom, Utility and cold preparation areas. • High School degree or equivalent is required. • 6 months to 1 year in Hospitality/Customer service required. • Must be able to read and write. • Some experience with assembling patient trays preferred Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
        },
        {
            "url": "https://www.indeed.com/rc/clk?jk=63c1cfe1a8af935f&fccid=36b76cf613fccb72&vjs=3",
            "title": "Nursing Assistant -PMUC Recovery Room - Full - Time Day (PPMC)",
            "company": "University of Pennsylvania Health System",
            "location": "3737 Market Street, Philadelphia, PA 19104",
            "salary": "Not Available",
            "description": "Description \n \n Unit: PMUC Recovery Room \n Location: Penn Medicine University City (PPMC) Summary: \n • The Certified Nursing Assistant (CNA) interacts with patient at the most intimate level and highest frequency. As an integral member of the health care team, the CNA shows up and remains engaged in all aspects of the role, drive results with intention, partners with unwavering support, commit to every single moment and serve with compassion. While working under the direct supervision of the registered nurse, the CNA role primary focus is to support and assist in the delivery of quality care to patients and families. Some of the major responsibilities includes participation in RN/CNA hand-off communications and unit huddles, timely collection and reporting of patient data, demonstrating safety protocols at all times, timely notification and escalation of data or clinical conditions, remaining alert and responsive to activities on the unit, and demonstrating a genuine care for the patient (paying a close attention to the basics), e.g., active listening, timely response, cultural sensitivity, individualized approach to care.  Responsibilities: \n • Demonstrates a genuine care for the patient, e.g., active listening and responding, gentle approach to providing care, knock then identify yourself before entering a patient's space, provide timely information to patients in a caring manner; ensure an individualized approach to care to include cultural sensitivities, anticipate patent needs based on dialogue and observation • Active participation in daily RN/CNA handoffs and unit huddles • Communicate with patients to ascertain feelings or need for assistance or social and emotional support. • Answer patient call signals, signal lights, bells, or intercom systems to determine patients' needs. • Provide physical support to assist patients to perform daily living activities, such as getting out of bed, bathing, dressing, using the toilet, standing, walking, or exercising. Assist patient in their independence (when appropriate), preserving the patient's dignity while providing care. • Timely notification and escalation of data or clinical data/information • Gather information from caregivers, nurses, or physicians about patient condition, treatment plans, or appropriate activities. • Collecting and recording vital signs, such as temperature, blood pressure, pulse, or respiration rate, as directed by medical or nursing staff. • Document or otherwise report observations of patient behavior, complaints, or physical symptoms to nurses. • Demonstrates flexibility/change in assignments based on patient acuity and unit needs • Demonstrate safe patient handling skills, proper hand hygiene • Demonstrates support of quality and safety measures in the work environment, e.g., demonstrated support of the unit's Quality Assessment Performance Improvement (QAPI) goals • Ensure actions and behaviors demonstrate their support in creating a positive, caring and healing patient environment • Consistently focus on improving the patient experience  Credentials: \n • Basic Cardiac Life Support (Required) • CNA Certification by the State of Pennsylvania or RN without a BSN Degree(required).  Education or Equivalent Experience: \n • H.S. Diploma/GED (Required) • Matriculated in an accredited BSN Nursing Program preferred; minimally completed the nursing foundations/fundamentals clinical course with a 3.0 GPA overall and in the nursing major.  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
        },
        {
            "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cl6qJ6wur0ZiMBxYRVhry3bIOD9AFY4MR_iHPOfECHLiPYUobSxtmy181an0Fo2sDOEq5Wg76mV-WTsDglAD2XnkrOPCD4Pd0l3WgHWIe_c1SewtkQdOZ-pl5FQ7dTRT6HfRwWNREKhwVmBqcOBuD0T-jJe3TGZrpJhm-JQ7kynObXC3kWZgLZVNSeqypL_SrXe9H-NlqJ_bZ78x88G0TNdLo6_EFfhxnahPHV9VZ2LzVgdAlsu4LTT3Hm-weRGbVRKDJyU612qaH9oAoVtcEHGM7atqvMnqbD087F1CUccS6G8zqV2PIciyBdZsVo2k5Sg0L9Y-DdBcYiKFu6wBNUYTVnodCQ6YaDA1jiYDBcIzG4AnDT07HoCD_kfrxnq-A8Vdtax5YWKqoFQCAOy-EYXZS7irnxu_ohK4OFp_53kmxAqQD0Pu-kdfXUoLNU5YfdYWG1QowjGGLOUYVZz4KjEAJkWg1pE5UCG1nTCKr7-1skp1pkXzI2k5WLXXvroXxQJknK1QZts6rnf3VPOj2iP200mEda9cVtYsFMZkdmweBb0Pm77TDcBw-Hjw9KhqRlboeTilN5Qa5jV946uWjBlWfD5P1aUejdMYGsm-7U1FfYVtda19AqUm5CzJxNS2GmVVSZfB9mhPxIcTuVH6ulpiR0pSUIOk0OarBPXgAxHg==&xkcb=SoAo-_M3HKCHspyD2Z0FbzkdCdPP&p=14&fvj=1&vjs=3",
            "title": "PA-C (Physician Assistant) for In-home Visits - Flexible + New Bonuses!",
            "company": "Signify Health",
            "location": "Philadelphia, PA",
            "salary": "$70 - $87 an hour",
            "description": "Do you have a passion for engaging with people and helping them on their journey to better health? Signify Health is hiring board-certified physician assistant/physician associate (PA) contractors to conduct In-home Health Evaluations for Medicare Advantage, Medicaid, and certain commercial plan members. With our new earning incentives, you can qualify for our base $70.00 per completed assessment plus up to $30,000 in additional bonus opportunities! • Earn $1800 to $3000 each week (Average 6-9 visits daily) • Increase your per-visit rate up to 200% with our Market Multiplier • Earn up to $30,000 with our VIP Bonus • Starting July 1: Introducing a pay-per-test model (for visits where the patient qualifies to receive additional diagnostic and preventive tests) • Shifts available Monday - Sunday (no nights/weekends required) • Short-Term or Long-Term basis • Pre-scheduled visit in-home w/ health plan members • Airfare, Hotel, Rental Car, Malpractice, Availability Incentives provided as needed • Independent Contractor, 1099 status • Flexible Schedule • State License Required These visits include a medication and medical history review, as well as a physical evaluation performed in a health plan member’s home. Our PA contractors can earn a competitive wage (or supplement their current income) while managing other personal and clinical commitments. You will be provided a pre-populated, patient-specific form for each evaluation and are not required to prescribe medicine, order lab tests, or alter people’s current treatment regimen. Interested in travel? We’ll cover all travel and lodging expenses. Signify can also help with multi-state licensing. Why Clinicians Love Working with Signify Health • “Every day, members tell me, ‘I am so glad you came!’ With each member, I work to help them to understand that my primary goal of the visit is to help them to remain so healthy that they will be in their home forever.” – Brenda Z. • \"Many seniors are lonely, and your visit may be the highlight of their day, week, or even month. We get the advantage of seeing members in their environment and on their turf.\" - Laura B. • \"Signify Health has been a very rewarding job. In-home visits allow us more time to educate patients and assess their understanding of their treatment plans without the typical time restraints found in a traditional office setting. We can empower patients to become better advocates of their health.\" - Gary W. Job Types: Full-time, Part-time, Temporary Pay: $70.00 - $87.00 per hour Expected hours: No less than 10 per week Benefits: • Flexible schedule Medical specialties: • Geriatrics • Home Health • Internal Medicine • Medical-Surgical • Primary Care • Urgent Care Schedule: • Choose your own hours • Day shift • Evening shift Application Question(s): • What is your NPI? License/Certification: • Physician Assistant License (Required) Willingness to travel: • 50% (Preferred) Work Location: On the road"
        }
    ],
    "metadata": {
        "source": "https://www.indeed.com/jobs?q=Healthcare&l=Philadelphia",
        "timestamp": "2023-11-28T00:07:39.935921"
    }
}