{
  "domain": "cybersecurity",
  "url": "https://www.indeed.com/jobs?q=cybersecurity&l=Philadelphia",
  "data": [
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZkFBy4Qr63BQKSyytxWB3ShPhLRyFkEHC_ouaWBu8rx-SBjqS8s9tmfY-GxOStErf2sfkvHKh1CDB3LRjI91A-fFkv1E_s1RTfikgPttU-CV5tjSe1zpPEjPci4UEFroANdMSnr62xG9BToBaDrMGGm-Rc4SChVDvampvdgFlUCPrREZ5V94I3MncS_VM18tzdpezZqP5PjeSNnKgVRUNymvgtlTpWwFYImIyiqdzOGaV5ClPBw8iscCgx1fmb6D0DyrvYRc1b6WGK57QQgqq9AuzWtZ7T6iCRGcsJcUIhnfSp9LFCS-RpM4OHd8os21580UL-PE4ifTa2Z6L1McpeFPBZhVSqKmoRT1k0vgmK4Ef7JdeTgELm_BoEJn-hgc33MalgFb41_A3mLtuZW-SbnJyBzmqcR2sRjmTomZOqqrVDFNbKc732NqqSD_ABgH7_lFX-QXhQ_yAnERWR4XKexw1sEacpFgpb1Hn-3NwSKzAQRujDjk1OksLoZNdyhqpramT_Bs80tqiiB1_LM9aLcMrfBx5uBG2XALlKU39FxW10txbp6ihaKo9MuUrdSqiAYuCoBP5Pzs2D4yR_hqPynuIbej289bMcTXMqN43uFLML8yUzQKO1zn4Gb0i7NoaX2OfBfJyaG1luX7GaPMOuGXm8eFXY10J3YgnScxJSM_3zTiYS3vIdk0C8ZIOj4CdGBGKN65V_Ln-yTNDfdXeFM5GTUP3p6VQ1fBh_E9xxpGKEL-JZ6gbJCwIZum_6s9ZgMtx4oEyvMb-__b9C7ESohPphZWb7e9ggLfd-9Vl3jJfZoWlUvo1Hu3CnYh4Se0FFpYRFkVvgbvdTIl0p3q_LEKxJvCLNVKAb2Xh74k8I9U7lmIYCRIFZCExFhcQM2oE5SiCGvxASNlVWUIb9cjbMsro25Ygu00-BX0H9fn_MHnobU6Ee1zEbmEdkiq_ET9T90SYWDa30U6P9ZH71ju15BOpVUfWyPBofenOZ9FYlPeLitEmFoE1-_NAoInGUy4uybCqrXMK-_aQ2CH8rnygG8hoM6sF_PpvPyTfiUqasFqYaYSn-Mtvr-2TcT1DV9E6SHKgjqHkfErGG-LBnsQelfUjBzbl-9Gfy0HfXF8NufeMjd4y6VRgzypRYpfdChHf6Gv9rh3kDM-h-u036N6nPeqaAMDlVBfTD8OpXs2KpUzkarsE__ND2ngm-qmiQX2M-6ZlGMTw6DzNkzLrsunqhHfYFBhfmsgvkyfwC1v1WEKQgvboRaJ24l7DI2ukHgFOKgmc-rnI7ieCTjnj_Tk7CQDmIGQpFign6UWiP5olxz5CAU-9EaLXfo=&xkcb=SoAu-_M3HJjL3f2aix0LbzkdCdPP&p=0&fvj=0&vjs=3",
      "title": "Comcast Cybersecurity: Executive Director, Cyber Security Engineering",
      "company": "Comcast",
      "location": "Philadelphia, PA 19103",
      "salary": "$177,581.69 - $302,696.06 a year",
      "description": "Job Summary Job Description • Reviews and presents operating and capital budgets including forecasts of operations, development, testing and any specialized needs to senior management. • Supervises operations and ensures business strategies and objectives are being met in a structured and concise manner. Delivers strategies and objectives within the department and across the organization. • Evaluates overall work processes and standard procedures to ensure performance is to company and industry standards. • Continuously develops staff through ongoing training programs, operational procedures and policies and develops staff organizational and technical skills etc. • Sets the reporting standards and then works with the Manager of Engineering to analyze reports for such issues as schedule completions for testing, spend levels for NRE costs, yearly license costs etc. • Stays knowledgeable of competition and important new technologies and standards. • Applies background and understanding of Network protocols at all layers, Secure Routing, DNS/DNSSEC, Network Device Security for a broad spectrum of vendors and devices, experience with SDN and automation, understanding and expert ability to fix network issues and network stacks of different platforms, e.g. TCP tuning, queue management for various OSs, Experience with operations at scale, H/A architecture and strategies. • Consistent exercise of independent judgment and discretion in matters of significance. • Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as vital. • Other duties and responsibilities as assigned.  • Understand our Operating Principles; make them the guidelines for how you do your job • Be responsible for the customer experience - think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services • Know your stuff - be enthusiastic learners, users and advocates of our groundbreaking technology, products and services, especially our digital tools and experiences • Win as a team - make big things happen by working together and being open to new insights • Be an active part of the Net Promoter System - a way of working that brings more employee and customer feedback into the company - by joining huddles, making call backs and helping us elevate opportunities to do better for our customers • Drive results and growth • Respect and promote inclusion and diversity • Do what's right for each other, our customers, investors and our communities  Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Comcast will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law, including the Los Angeles Fair Chance Initiative for Hiring Ordinance and the San Francisco Fair Chance Ordinance. Education Master's Degree, Master's Degree, Master's Degree, Master's Degree, Master's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 10 Years + Salary: Pay Range: This job can be performed in California with a Pay Range of $177,581.69 - $302,696.06 Comcast intends to offer the selected candidate base pay within this range, dependent on job-related, non-discriminatory factors such as experience. Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=82cde4e5ee1fda05&fccid=4d297a7bcd1c7be4&vjs=3",
      "title": "Security Incident Response",
      "company": "Lincoln Financial",
      "location": "Radnor, PA",
      "salary": "$90,000 - $175,000 a year",
      "description": " Date: Nov 20, 2023 Primary Location: Radnor, PA, US Company: Lincoln Financial • Monitor, defend and protect perimeter interface for malicious network traffic. • Responding to host based alerts • Performing network analysis of egress and ingress traffic. • Conduct real-time analysis using the SIEM and other security analytics tools. • Responsible for correlation and initial triage of security events and indicators generated by security monitoring tools. • Perform triage and response activities related to suspected phishing emails. • Identifies and recommends process improvements that significantly reduce workloads or improve quality for his/her assigned area(s) of responsibility. • Maintains knowledge on current and emerging developments/trends for assigned area(s) of responsibility, assesses the impact, and collaborates with management to incorporate new trends and developments in current and future solutions. • Administer more complex requests and questions received via phone, e-mail, or an internal ticketing system in a timely and detail-oriented fashion in order to resolve a multitude of cyber security related situations. • Maintain availability of security technologies, such as IDS/IPS, Web Application Firewall, DLP, syslog, vulnerability scanners • 3 - 5+ Years Experience with one or more of the following technologies: IPS, DLP, WAF, Content Filtering, Malware Detection, Vulnerability Management. • 2 - 5+ Years Information Security related experience, in areas such as: security operations, incident analysis, incident handling, and vulnerability management or testing, system patching, log analysis, intrusion detection, or firewall administration. • 4 Year/Bachelor's degree or equivalent work experience • A clearly defined career framework to help you successfully manage your career • Leadership development and virtual training opportunities • PTO/parental leave • Competitive 401K and employee benefits • Free financial counseling, health coaching and employee assistance program • Tuition assistance program • A leadership team that prioritizes your health and well-being; offering a remote work environment and flexible work hybrid situations • Effective productivity/technology tools and training "
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Bm6HJxcY0Tqjaa3n41Rv68Ym0q5XegBsUyML2tebqrB52ZzFs-BVLiFXAGOR5TT4dI581z49sjS_vmFMzXjg4HQkD2izlNoomc2Fehwjp8ZXRQ6kmQqNc6G72kHxl4ytFCVUBk5364IWgfNZPypVJ99Vlu_AjJRGKO1ugqIUQTZjOYIlUg-7C1bCCHkhOFRhc_cviUcholq08nGOxKDgWppjFNzAi91FZWB5kUtfmYs_iM471cwBKjFeLj88MEqSDNvAwxB_Nfv6unXuG0hoixLLycfV7sOXPgVQ5JxmWtwS2WnbWGu4e_-TB0x3RQ1F1KWX9jv5BK_H8Eq86C9bBuU7Yf-ekq8Z19MzujTfxNGV11t5tPqK9I4DQOAY4xl3ErY_vi7tdg0ylZrK_U6bMhRaGRtk49vvoiocMeNlisPr0J-Vcz6FjiNkctNj7ekgj5aqq12IUsJg1HRiWkbaSol0VF5E0OsVUUsHd3gudtgIqR8pcTxR5RtEgW_7JOBA-WAcd_dPfq8jLgNU0PmxULV_WEy_-8SMG-TYZS4_CYZ8jWlojOQOd29dQtm0Sv8M-PVebrGl50U54VbtYqNmUkBPHyCZ1JCLQFRqqJXqIqtmSJsRbQJdjCqqVdlRDOnUMUgySV4Oq6EmngqP6sUETXAU3494-WXEndULgDhDQyEmYGXjMy9uO5QDuWCDmOPqvSY0b7pGatM0iiYY5bgRmS&xkcb=SoAH-_M3HJjL3f2aix0JbzkdCdPP&p=2&fvj=0&vjs=3",
      "title": "Cybersecurity/Data Privacy Incident Response Attorney (Remote)",
      "company": "Latitude",
      "location": "Philadelphia, PA",
      "salary": "Salary Not Available",
      "description": "• Work in a highly collaborative, team environment to provide legal counsel to organizations investigating and responding to data privacy and cybersecurity incidents • Collect information needed to understand the issue and scope of each situation, engage and direct experts needed to appropriately investigate and respond to the event, and communicate to regulatory bodies, law enforcement agencies, and other third-parties as needed while advising clients throughout the investigation • Due to the unpredictable nature of cybersecurity events, all partners and associates participate in a rotating on-call schedule to provide crisis management support to client • 3-5 years of legal experience; cybersecurity experience is preferred but would consider someone with willingness to learn/be trained in cyber law • Licensed to practice in any U.S. state • J.D. from an accredited law school • Exceptional analytical, written, communication, and preparation skills, plus focused attention to detail are key to performing well in this highly responsive environment • Initiative and the ability to independently maintain your own caseload • Ability to thrive in a fast-paced, professional law firm setting • Excellent written and oral advocacy skills • Type of Role: Permanent • Schedule: Full-time • Location: Remote or Hybrid (Suburbs of Philadelphia, PA) • Follow Latitude on LinkedIn • See More Latitude Jobs • See Complimentary Latitude Resources • Find a Great Attorney or Other Legal Professional for your Legal Team"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=f817189588c8714a&fccid=dc3a418540402632&vjs=3",
      "title": "Cybersecurity Specialist (100% Remote)",
      "company": "MEDLOGIX, LLC",
      "location": "Lansdale, PA 19446",
      "salary": "Salary Not Available",
      "description": "Medlogix delivers innovative medical claims solutions through a seamless collaboration of our Medlogix® technology, our highly skilled staff, access to our premier health care provider networks, and our commitment to keeping our clients’ needs as our top priority. Medlogix has a powerful mix of medical expertise, proven processes and innovative technology that delivers a more efficient, disciplined insurance claims process. The result is lower expenses and increased productivity for the auto insurance and workers’ compensation insurance carriers; third party administrators (TPAs); and government entities we serve. This is a 100% remote opportunity. Job Summary: As a Cybersecurity Specialist at Medlogix, you will play a pivotal role in identifying, designing, and implementing technical security controls to protect business data. You will work closely with IT and Information Security leaders to understand the cybersecurity roadmap and collaborate with them to successfully implement improvements on an ongoing basis.  Responsibilities: Administration of Microsoft 365 Security: Configure, monitor, and manage Microsoft 365 security features, such as Conditional Access, Multi-Factor Authentication (MFA), Data Loss Prevention (DLP), and Azure Information Protection (AIP). Implement best practices to enhance the organization's security posture. Antivirus and Antimalware Solutions: Oversee the deployment, configuration, and maintenance of antivirus and antimalware tools across the network in conjunction with the Managed Security Services Provider. Antispam Solution Management: Administer the antispam/anti-phishing system, ensuring effective filtering and blocking of malicious emails and spam content. Stay updated with emerging spam and phishing techniques to continuously improve the solution's effectiveness. Security Incident Response: Understand and contribute to development of incident response plans for security events, including malware outbreaks, phishing attacks, and unauthorized access attempts. Act swiftly to contain, investigate, and remediate security incidents in partnership with the full Information Security Team. Security Patch Management: Collaborate with the IT team and Vulnerability Management Process to ensure timely and consistent application of security patches and updates on all systems, software, and security tools. User Education and Training: In conjunction with Managed Security Services Provider, participate in the delivery of simulated phishing campaigns and cybersecurity training sessions for employees, raising awareness about best practices, social engineering threats, and data security guidelines. Review “reported phish” alerts for legitimacy. Stay Current: Continuously monitor cybersecurity industry trends, emerging threats, and best practices. Improve your knowledge and share it with the IT & Security teams. Collaboration and Support: Work closely with the IT team to provide security-related support. Assist with the troubleshooting of security issues. Collaborate with other IT professionals to ensure smooth operations across all aspects of the organization's IT environment.  Qualifications: • Bachelor's degree in computer science, Information Security, or a related field (relevant certifications can be considered in lieu of a degree). • Certifications such as CompTIA Security+, Certified Information Systems Security Professional (CISSP), Certified Ethical Hacker (CEH), or Microsoft 365 Security Administrator Associate will be advantageous. • Proven experience as a Systems Administrator, IT Helpdesk, Project Engineer or similar role with hands-on experience in administering IT and/or Cybersecurity Operations. • Proficiency administering enterprise security solutions including:\nFirewalls\nMicrosoft 365\nAntispam / Anti-phishing tools\nAntivirus / Anti Malware tools\nWindows Servers and Workstations • Firewalls • Microsoft 365 • Antispam / Anti-phishing tools • Antivirus / Anti Malware tools • Windows Servers and Workstations • Familiarity with security frameworks and concepts (e.g., CIS, NIST, ISO 27001) and their application in private, for-profit business environments. • Excellent problem-solving skills, analytical thinking, and attention to detail. • Strong communication and interpersonal skills to interact effectively with team members and end-users. • Ability to work remotely and independently, manage multiple tasks, and meet deadlines in a fast-paced environment.  Medlogix provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=bab8767b0bbf8946&fccid=510aa29fcf8f87d9&vjs=3",
      "title": "Cloud Security Operations Analyst (remote)",
      "company": "Vanguard",
      "location": "Malvern, PA",
      "salary": "$90,000 - $150,000 a year",
      "description": " Global Risk and Security enables business strategy, protects client and Vanguard interests (e.g., assets and data), and stewards a strong risk culture. Our teams leverage enterprise-wide insights, deep expertise, and trusted advice so that across Vanguard leaders and crew drive faster, stronger, risk-informed decisions.\n\nWithin GR&S, the Enterprise Security and Fraud (ES&F) sub-division is responsible for the global protection of Vanguard crew, property, data, and client assets. We are the trusted advisors that protect the pride of Vanguard with state-of-the-art security and fraud capabilities. We are a world-class destination of highly-engaged, passionate, and diverse talent expected to continuously learn and develop in an ever-changing security landscape.\n\nDo you have prior experience either developing and/or implementing/engineering solutions on a cloud platform? Do you have some previous experience in a Security Operations Center? Do you want to take your current technical acumen to the next level? As a Cloud Security Operations Analyst, you will work closely with the team leads to help implement/design newly developed process and controls to further increase our cloud security posture using native and/or 3rd party mechanisms.  In this role, you will: • Provide senior level cyber security services to prevent, detect, respond to, and remediate threats. Coordinate with external and internal resources to develop and deliver new security solutions. • Utilize existing security controls to improve security posture, and research emerging threats relevant to operations. • Continually develop cloud architecture and security knowledge. Create Standard Operating Procedures (SOPs) for incident response triage. • Assist with the design and implementation of cyber security and operations procedures, tasks, and reports. Assist with automation of redundant processes. • Provide incident response triage support to other Cyber Security Operations teams. • Participate in special projects and performs other duties as assigned.  What it takes: • Minimum of three years related work experience, with two years of Cyber Security experience. • Undergraduate degree in Computer science, Management of Information Systems Security, or equivalent combination of training and experience. • CISSP, AWS Cloud Practitioner, or other cloud or cloud platform equivalent required. Special Factors Sponsorship About Vanguard We are Vanguard. Together, we’re changing the way the world invests.  For us, investing doesn’t just end in value. It starts with values. Because when you invest with courage, when you invest with clarity, and when you invest with care, you can get so much more in return. We invest with purpose – and that’s how we’ve become a global market leader. Here, we grow by doing the right thing for the people we serve. And so can you.  We want to make success accessible to everyone. This is our opportunity. Let’s make it count.  Inclusion Statement Vanguard’s continued commitment to diversity and inclusion is firmly rooted in our culture. Every decision we make to best serve our clients, crew (internally employees are referred to as crew), and communities is guided by one simple statement: “Do the right thing.”  We believe that a critical aspect of doing the right thing requires building diverse, inclusive, and highly effective teams of individuals who are as unique as the clients they serve. We empower our crew to contribute their distinct strengths to achieving Vanguard’s core purpose through our values.  When all crew members feel valued and included, our ability to collaborate and innovate is amplified, and we are united in delivering on Vanguard's core purpose.  Our core purpose: To take a stand for all investors, to treat them fairly, and to give them the best chance for investment success.  Future of Work During the pandemic, we transitioned to a work from home model for the majority of our crew and we continue to interview, hire, and on-board future crew remotely.  As we have developed the path forward, we have taken a thoughtful approach that both maximizes the advantages of working remotely and the many benefits of coming together and collaborating in a shared workspace. We believe that in-person interactions among our crew are important for preserving our unique culture and advantageous for the personal development of our crew.  When our Crew return to the office, many will work in our hybrid model. A smaller proportion of our crew will operate in the Work from Home work model (for example, field sales crew); or in the Work from Office model (for example, portfolio managers).  The working model that your role falls into will be communicated to you in the interview process – please do ask if you are unsure. We encourage you to make the decision regarding your job interview and offer knowing which model your role will fall into. We will test and learn as our ways of working evolve and will continue to evaluate working models along the way.  Salary Range:"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=7d8bb00623dcbe56&fccid=4cd66e5617f038d8&vjs=3",
      "title": "Network Security Associate",
      "company": "Susquehanna International Group",
      "location": "Bala-Cynwyd, PA",
      "salary": "Salary Not Available",
      "description": "• Bachelor’s degree in Information Security, Information Technology, Networking & Systems Administration or a similar technical discipline required • Strong grasp of TCP/IP, networking, operating systems fundamentals is required • Coding skills are required, Python, Perl, Bash or PowerShell are preferred • Experience in a network, security and/or systems administration function, or a similar role is preferred • Visa sponsorship is available for this position."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=e446ca6a8bb84b31&fccid=4cd66e5617f038d8&vjs=3",
      "title": "Security Engineer - Data Protection",
      "company": "Susquehanna International Group",
      "location": "Bala-Cynwyd, PA",
      "salary": "Salary Not Available",
      "description": "• Develop and engineer new solutions to improve existing data classification and protection technologies across the organization. • Work with teams within Security and across the organization internationally to understand and protect business critical data. • Design and execute on diverse projects to improve the data protection infrastructure and increase efficiency and detection rates. • Have the freedom and autonomy to dive deeply into related technologies, understanding how they work and their application to SIG, and how they could be a component in our next solution. • No two days are the same. Security challenges are best solved through a comprehensive multi-disciplinary approach, facilitating collaboration and exposure to high-end security technologies without having to silo your skills or career into artificially constrained buckets. • We encourage curiosity and knowledge sharing. You’ll be working with engineers who are always pushing each other to be better, ensuring they’re always learning, always teaching and always on the cutting edge of developments and trends within Information Security. • We take a proactive risk-based approach to solving security problems. Engineers are empowered to identify and remediate risks in our environment, tailoring solutions to our specific needs. • Take your ideas from inception to completion. Researching and designing innovative solutions to security problems, implementing them in a global technology environment, and supporting and adapting them to keep up with our fast paced ever changing business and security needs. • Bachelor’s degree in Information Security, Information Technology, Networking & Systems Administration, Computer Science or a similar technical discipline required • Strong technical understanding of information security concepts, common attacks and mitigation techniques, and ability to make risk-based decisions • Good understanding of operating systems internals and security practices • Good understanding of common network protocols • Python, PowerShell, or similar programming experience"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DiagSgEqvcBzWjNpUcJTXeVGLF-A6-a5JjYciP9DHoeSxL5tPqeSYgNUukWyYgXXr76wALgyfxPiA5TAPsNZjIe6nygwXUaYrFTZsv4jIQc5JXq86g3sBYTyKLl14txE92VB6O4-SCcjTdxPl_3HwmX09qiw-xoT55qkaU97F20BtfNZtHrKrdBQaT5mM2sLwdUnSugwgRMEZ1N0_70n-2Xjz8cfp3t_NjH4NpdJZIBDYGjzYmsmAsFPGnnUx0FGY7K8vcvDJYaW_VqJIEgrz0FnKLUdFndQF6hFqgnmWn3wEuIOs8x9iZFBhSJi9zMmGcdtZUuvFOI8r34j-T0wHoKQCcOozn7_MGNisDesqm6GgvAfVQjzzqnDn0UhJIaK4H0v36spdtjuTK2rahe6Iv6hstHaHn8yxOWOsiPSVfHNu3LLE5JFRcxAZaFXxBn-z2e3FWLy5DYDsIZBDnZ1IDWw4kSGLHR_vXsyW3ZP7RTeDuc_PAP1_q6EzW37UEMd8kZuhcFbA9prSR59l6W4_4rAd8k82f8yfb9-Y_iB6p2gCqxhoLCOyLNxhQflqaVxnqr8bqgW9Hz97kZbHdSAnMX4333_J8qZPA7MEKmCgfNM3gXVjsCGOm&xkcb=SoCg-_M3HJjL3f2aix0MbzkdCdPP&p=7&fvj=0&vjs=3",
      "title": "Information System Security Manager",
      "company": "Alutiiq",
      "location": "Philadelphia, PA 19112",
      "salary": "Salary Not Available",
      "description": "The Information Systems Security Manager will support an active Naval Surface Warfare Center Philadelphia Division (NSWCPD) contract in Philadelphia, PA. Under direct supervision, will assist in the implementation and maintenance of databases tracking inventory, product life cycle, preventive maintenance schedule, and customer service requests. Candidate will continuously monitor database performance and identify improvements. Support and supervise documentation of configuration change management procedures. • Complies with the responsibilities established in Section 2.6 of DoDEA Administrative • Instruction 8500.01 and Section 2.c.(2)(d) of Enclosure 4 of DoD Instruction 8510.01. • Maintains and reports IT/PIT assessment and authorization status and issues • Provides oversight of ISSOs to ensure that they are following established cybersecurity policies and procedures, in accordance with DoD Instruction 8500.01. • Monitors compliance with cybersecurity policy, as appropriate, and reviews the results of such monitoring. • Supports the ISO on the continuous monitoring security control assessment procedures to complete security responsibilities. • Ensures annual security control assessments are performed and the results entered into eMASS. • Ensures all users have the requisite security clearances and access authorization, and are aware of their cybersecurity responsibilities for DoD IS under their purview before being granted access to those systems. • Ensures that cybersecurity inspections, tests, and reviews are synchronized and coordinated with affected parties and organizations. • Acts as the primary cybersecurity technical advisor to the AO for DoD IT/ PIT systems under their purview. • Ensure CM policies and procedures for authorizing the use of hardware/software on an IS are followed. Any additions, changes or modifications to hardware, software, or firmware must be coordinated with the appropriate AO prior to the addition, change or modification. • Maintain a working knowledge of system functions, security policies, technical security safeguards, and operational security measures. • Manage, maintain, and execute the information security continuous monitoring plan. • Ensure a record is maintained of all security-related vulnerabilities and ensure serious or unresolved violations are reported to the AO/DAO; and Assess changes to the system, its environment, and operational needs that could affect the security authorization. • Develop concept of operations for new systems. • Develop and maintain a formal IS security program and policies for their assigned area of responsibility. • Provide technical and procedural Information System (IS) Security advice to government and industrial teams. • Develop and oversee operational information systems security implementation policy and guidelines. • Bachelor’s degree from Accredited University. • Four (4) years professional experience in computer systems analysis. • CNSSI 4012 or 4013 or 4014 or 4015 or 4016 Certificate or NDU CISO certificate or CCNA or CAP or Security + (CE), ENSA or DoD 8570 IAM II certification. • Active Department of Defense SECRET clearance required. • Pursuant to the Government Contract, you must be a U.S. Citizen."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=91489a85510148f0&fccid=aeb15e43a6800b9d&vjs=3",
      "title": "Information Systems Security Officer, Classified Cybersecurity ISSO",
      "company": "Lockheed Martin Corporation",
      "location": "King of Prussia, PA",
      "salary": "Salary Not Available",
      "description": "JOB ID: 657323BR Date posted: Nov. 21, 2023 Description: This position requires a TS/SCI clearance prior to start and the ability to obtain a Polygraph. • You will have a direct impact to national security, ultimately contributing to protecting your loved ones – this is dynamic, gratifying and impactful work! • You will have the opportunity to engage in all aspects of the cyber discipline • You can enjoy a work-life balance that allows for flex hours and a family-first culture • You get to be a part of a company widely recognized as a top employer for women, people of color and veterans – a highly inclusive culture and ranked #11 in Forbes 2022 \"World's Best Employers\" • Oversee day-to-day information system security operations including hardware and software implementations. • Carry out technical administration of IS in accordance with internal LM and customer security requirements, primarily Risk Management Framework (RMF). • Upkeep, monitor, analyze, and respond to network and security events. • Document compliance actions within the approved automated compliance tracking system or develop a plan of actions and milestones (POA&M) with the Information Systems Security Manager (ISSM) to address non-compliance in the allotted time frame. • Ensure systems are operated, maintained, and disposed of in accordance with internal security policies and practices outlined in the security plan. • Balance competing priorities amongst multiple customers and programs. • Auditing is a large part of this role’s responsibility. Candidate will typically have a Bachelor's Degree and 5+ years of experience. Basic Qualifications: • Current TS/SCI with ability to obtain a Polygraph • DoD 8570 IAT Level II certification or ability to obtain within 6 months of hire • Information Systems auditing experience • Knowledgeable of operating system security requirements • Hands on experience with industry standard Information Assurance tools Desired Skills: • Experience with RMF • Experience with Security Directives, Policies, Publications and Regulations Security Clearance Statement: Clearance Level: Other Important Information You Should Know Expression of Interest: Ability to Work Remotely: Work Schedules: Schedule for this Position: Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Experience Level: Business Unit: Relocation Available: Career Area: Type: Shift: At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer:"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=d7ff267da4d218b5&fccid=105cc25c3f5819cd&vjs=3",
      "title": "CYBERSECURITY ARCHITECT",
      "company": "Temple University Health System",
      "location": "2450 W Hunting Park Ave, Philadelphia, PA 19129",
      "salary": "Salary Not Available",
      "description": "CYBERSECURITY ARCHITECT  Your Tomorrow is Here! Temple Health is a dynamic network of outstanding hospitals, specialty centers, and physician practices that is advancing the fight against disease, pushing the boundaries of medical science, and educating future healthcare professionals. Temple Health consists of Temple University Hospital (TUH), Fox Chase Cancer Center, TUH-Jeanes Campus, TUH-Episcopal Campus, TUH-Northeastern Campus, Temple Physicians, Inc., and Temple Transport Team. Temple Health is proudly affiliated with the Lewis Katz School of Medicine at Temple University.  To support this mission, Temple Health is continuously recruiting top talent to join its diverse, 10,000 strong workforce that fosters a healthy, safe and productive environment for its patients, visitors, students and colleagues alike. At Temple Health, your tomorrow is here! Equal Opportunity Employer/Veterans/Disabled An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.  Your Tomorrow is Here! Temple Health is committed to setting new standards for preventing, diagnosing and treating major diseases in our community and across the nation. Achieving that goal means investing in our employees' success through staff and leadership development. Our recruitment strategy is to attract and retain a diverse, high performing workforce that fosters a healthy, safe and productive environment for our patients and colleagues alike. "
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=cf7187e5f19247fe&fccid=098f028fec64b983&vjs=3",
      "title": "Software Engineer III – Cybersecurity",
      "company": "RELX",
      "location": "Horsham, PA",
      "salary": "Salary Not Available",
      "description": "• You must be a U.S. citizen to apply for this position. • You must successfully pass a background investigation and achieve Public Trust security clearance. • ******REMOTE POSITION*******PREFERENCE for Candidates in the Eastern Time Zone • Collaborate with teams across Information Security and wider technology to define solution requirements by understanding moderately complex product requirements and translating into software designs • Demonstrate strong secure development processes, coding best practices and code reviews, while adhering to company policies and standards • Implement and support threat modeling, as required for the secure software development lifecycle for tools and systems • Support strong QA/ security testing processes in line with industry best practice and company policy • Participate in an iterative development process, such as within stand ups, backlog refinement, sprint planning and team demos • Report progress metrics on a regular basis • All other duties as assigned • Expertise in development/scripting languages, specifically C#, .NET, and SQL. Others are nice-2-have, such as Python, Javascript, PowerShell, etc. • Solid research skills with knowledge of industry software development best practices • Ability to interface competently, and effectively collaborate with internal and external technical personnel, team members and resources for finalizing requirements and other development-related activities • Ability to work independently and within small teams • Proficient in data manipulation languages, data modelling principles, normalization and data storage subsystems & optimization techniques • Solid ability to write and review portions of detailed specifications for the development of system components of moderate complexity • Good problem-solving experience with ability to solve moderately complex bug fixes • Good oral and written communications skills"
    },
    {
      "url": "https://www.indeed.com/company/Mullen-Coughlin-LLC/jobs/Administrative-Assistant-6eaf555b80ef9f4a?fccid=7e6bb98fc2637353&vjs=3",
      "title": "Administrative Assistant - Cybersecurity Law (Hybrid)",
      "company": "Mullen Coughlin LLC",
      "location": "Mullen Coughlin LLC in Devon, PA 19333",
      "salary": "From $22.50 an hour",
      "description": "Mullen Coughlin is a highly successful, fast growing niche law firm focused exclusively on counseling organizations in the context of data privacy, including incident response, regulatory investigation, single-plaintiff and class action litigation compliance. Committed to rapid incident response to incoming client calls, we thrive in a high energy, close-knit, and upbeat office culture. The Firm pays very competitively in the market and offers a full benefit package, including accrued time off, paid maternity and paternity leave, and a generous 401(k) program. At its new office, located at 426 West Lancaster Avenue, Devon, PA, Mullen Coughlin’s home office is over fifty-six thousand square feet, boasting the latest in technology and security, accommodating the projected continued growth of the firm, and providing all Mullen Coughlin employees access to amenities and resources to further their professional careers, as well as their health and well-being. The Administrative Assistant will work as part of a cohesive administrative team to support Partner and Associate Attorneys in our data privacy practice. This is a full-time position eligible for benefits with a daily schedule of 9:00am to 6:00pm (including a 1-hour lunch break) with initial training onsite and the potential to work from home up to 3 days per week following a 6 month review. Responsibilities • Maintain complex calendars. • Directly communicate with internal and external customers. • Intake new cases, open and close files. • Critical, deadline driven management of case work. • Draft and finalize deadline driven responses to regulatory agencies. • Draft and finalize professional correspondence. • Triage email communications. • Electronic filing of documents and electronic communications. • Collaborate and support the team to provide responsive customer service. • Coordinate travel arrangements. • Prepare expense reimbursement reports for submission. • Perform other administrative tasks as assigned. Skills & Qualifications • Ability to perform multiple tasks simultaneously with demanding time frames in an interrupt-driven work environment. • Working understanding of databases. • Strong, accurate typing and formatting skills. • Must be highly organized with a desire to learn and apply new concepts/skills on a continual basis. • Ability to communicate effectively, both orally and in writing. • Effective time management skills to balance workload of partner and associate attorneys, efficiently prioritizing requests. • Strong interpersonal skills. • Ability to work independently or collaboratively with team members. • Good analytical skills. • Ability to resolve issues quickly and efficiently. • Strong organizational skills and attention to detail. • ProLaw experience, a plus. • Demonstrated proficiency in computer software applications, including MS Office (Word, Excel, and PowerPoint); Outlook for calendaring meetings, events, etc. Ability to learn and use other applications, such as ProLaw. • Ability to adhere to standardized inter-department processes efficiently and accurately. • Ability to represent a positive and professional image. • Must have highest integrity, including the ability to treat confidential information appropriately. To Apply\nSubmit a cover letter and resume through our applicant tracking system by using the following link: https://www.mullen.law/careers/?gnk=job&gni=8a7887ac7c19529d017c55f24137493b&gns=Indeed Mullen Coughlin is an Equal Opportunity Employer and believes in strength in diversity.\nMullen Coughlin is not accepting resumes from search firms for this position.\nRelocation assistance is not provided for this position.\nApplicant must be authorized to work in the United States of America. Job Type: Full-time Pay: From $22.50 per hour Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Parental leave • Referral program • Vision insurance Schedule: • 8 hour shift • Day shift • Monday to Friday • Overtime Supplemental pay types: • Bonus opportunities Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=2018baefe5740ccf&fccid=6b4d8589813ead16&vjs=3",
      "title": "Python Developer (Cyber Security)",
      "company": "Brown Brothers Harriman",
      "location": "Philadelphia, PA",
      "salary": "Salary Not Available",
      "description": "• As a Python Software Engineer, you will be responsible for developing and maintaining software systems using Python, Django, SQL, Bash, Javascript, and other related technologies. • As a Python developer, you will be working on expanding and maintaining our Django web application, building and maintaining Plotly Dash-based visualizations, building and maintaining Python-based ETL applications, researching emerging technologies, and helping us manage our server infrastructure. • You will work closely with other engineers, product managers, and stakeholders to deliver high-quality software solutions that meet the needs of internal clients • You will write clean, efficient, and well-documented code that adheres to industry best practices and standards while utilizing development standards like version control and well-documented testing. • You will continuously review our software systems and identify areas for improvement, implementing new features, and optimizing performance; you will also leverage your experience to suggest processes to automate. • You will stay up to date with emerging technologies and industry trends and apply them to software systems as appropriate. • 5+ years of experience in software development using Python (including Django and Plotly Dash) and SQL. Familiarity and experience with object-oriented design a big plus. • Strong understanding of software development principles and best practices, including Agile methodologies, version control, and testing. • Strong problem-solving skills and ability to troubleshoot complex software systems. • Experience with front-end technologies (like JavaScript and HTML5) used in conjunction with Django and Plotly Dash. • Experience working with Linux-based infrastructure and services in a corporate setting. • Experience with secure coding principles and security best practices. • Excellent communication skills and ability to work collaboratively in a team environment or independently and manage multiple priorities and deadlines."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=8d51e6a541e4e108&fccid=6b4d8589813ead16&vjs=3",
      "title": "Cyber Security Operations Analyst",
      "company": "Brown Brothers Harriman",
      "location": "Philadelphia, PA",
      "salary": "Salary Not Available",
      "description": "• Day to day operations of BBH’s Cyber Intelligence Monitoring and Threat analysis. • Provide log analysis, real-time intrusion analysis, incident response, and security monitoring using a wide array of industry leading tools and technologies. • Investigating suspicious activities, alerts, and events detected by the security tools or reported by users and containing and preventing any potential incidents. • Analyzing and reporting on any information security issues, emerging trends, threats, and vulnerabilities affecting the organization or its industry. • Respond and perform analysis and risk assessment of all security events and incidents. • Provide related documentation in support of BBH regulatory guidelines (FFIEC, SOC2, NYDFS, etc.) and auditing initiatives. • Bi-weekly and Monthly reporting. • Maintain a working relationship with a 24x7 external cyber intelligence and threat monitoring service (MSSP) in support of our team. • Engage in security investigations and use tools to identify and report the outcomes of incidents to senior management. • Participate in discussions around security events and activities with various non-technical and technical parties. • Collaborate with various teams to manage security investigations and provide prevention solutions for cyber threats. • Follow the firm’s project management, SDLC disciplines to insure structured effectiveness in implementation and operations. • Responsibilities in working with tools in for identifying the firm’s security vulnerabilities. • Troubleshoot and work with vendors in identifying security vulnerabilities. • Collaborate with application and operation system teams to remediate any security vulnerability findings. • Recommend, and apply best practices for addressing ongoing threats. • Help support security tools that monitor the firm’s security configuration, changes, health, and baselines, such as SIEM, Anti-Virus and other cyber tools. • Respond to Endpoint protection and malware detection tools alerts following response templates. • Makes suggestions on tuning alert volumes. • Makes sure responses are remediated within SLA. • Bachelor’s Degree (or equivalent) or advanced degree highly desired. • 3+ years of Cyber Security experience. • Relevant or similar work experience in some of the following areas:\nSecurity Incident Response\nSecurity Operations management and maintaining IT general controls\nMalware analysis and remediation / Data Analysis\nDesigning and Operating enterprise security controls\nVulnerability & Patch management • Security Incident Response • Security Operations management and maintaining IT general controls • Malware analysis and remediation / Data Analysis • Designing and Operating enterprise security controls • Vulnerability & Patch management • Expertise with security assessment methodologies. • Some knowledge of networking protocols and related equipment. • Interest in packet analysis and forensic tools. • Familiar with Firewalls, IDS/IPS, Web Firewalls, Sandboxing, and other security tool terminology. • Interested in scripting with Bash, Batch, Perl, or Python. • Data Analysis using Excel. • Interest in Unix/Linux & Windows operating systems and privilege access. • Data analysis of various security logs. • Interest in security trends and threat intelligence. • SIEM technologies and correlation. • Familiarity in cyber security forensics is a plus. • Some rotating, 24 x 7 on-call responsibility."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=6a8b9cb511bf1dad&fccid=cce48ad42816872f&vjs=3",
      "title": "Cyber Security Analyst II",
      "company": "Jefferson - Center City, Philadelphia, PA",
      "location": "Philadelphia, PA 19107",
      "salary": "Salary Not Available",
      "description": "PRIMARY FUNCTION: The Cyber Security Analyst is responsible for maintaining the integrity and security of enterprise-wide systems, network and applications at Jefferson. Supports cyber security initiatives through predictive and reactive analysis, articulating emerging trends to leadership and staff. Be an active player during enterprise incident response efforts, driving incidents to timely and complete resolution. Reviews threat data from various sources and develops detection and response capabilities, correlates actionable security events into Security Event and Incident Management platform. Utilizes understanding of attack signatures, tactics, techniques and procedures associated with advanced cyber security threats. Develops analytical products and process fusing enterprise and all-source intelligence.  ESSENTIAL FUNCTIONS: • Develop and carry out information security policies and standards • Develop or implement cyber security tool set to assist in detection, prevention and analysis of security threats. • Develops security strategies to respond to and recover from a security breach with strong understanding of Security Operation Center (SOC) operations both on premise and managed. • Awareness training of the workforce on cyber security standards, polices and best practices • Experience using Windows / Unix / Linux / iOS systems in server and workstation environments. Strong understanding of hardware / software and cloud environments. • Expert in analyzing and investigating network and system intrusions, malware attacks and recommend / implement prevention methods. • Experience with Data Loss Prevention (DLP) systems, implementation and process in on premise and cloud environment. • Experience in cyber security incident response and breach investigations including forensic investigations. • Take ownership of multiple security products thru lifecycle e.g. DLP, Vulnerability Management, SIEM etc., • Must be able to co-ordinate project management and drive adoption of new capabilities. • Must mentor junior members in the team for success of their individual ownership • Must demonstrate 5+ years of successful security project & product delivery. • Reviews IT systems and business processes to identify information security risks and regulatory non-compliance, and guide remedy of issues noted. • Designs and delivers training on various Cyber Security initiatives. • Maintains familiarity with HIPAA / PCI-DSS and other Information Security regulations. • Interacts with co-workers, visitors, and other staff consistent with the iSCORE values of Jefferson. OTHER FUNCTIONS AND COMPETENCIES: • Active team player in cyber security projects at Jefferson. • Conducts various cyber security assessment including risk assessments, DLP assessments, Vulnerability assessment and remediation and reporting • Generates information security metrics by collecting and reporting on data from various systems and methods. • Supports other information security operations as required Bachelor’s degree in an information technology field preferred At least one information security certification, such as a SSCP, GSEC, or professional certificate required. CISSP or CISM preferred _________________________________________________________________________ At least five years of experience in an information security function, ability to multi-task, a keen eye for detail, strong organizational skills, the ability to thrive in fast-paced, high-stress situations, ability to communicate cyber security issues to peers and management. 3+ years solid understanding of Cyber Security & IT controls, network / systems / application penetration testing and vulnerability assessments. Experience with NIST and ISO frameworks. Solid knowledge of HIPAA, HITECH, and other IT security governing bodies. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans."
    }
  ],
  "metadata": {
    "source": "https://www.indeed.com/jobs?q=cybersecurity&l=Philadelphia",
    "timestamp": "2023-11-27T19:35:08.825105"
  },


  "domain": "Business",
  "url": "https://www.indeed.com/jobs?q=Business&l=Philadelphia",
  "data": [
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CQwu2DEPjjEsLNivoCWFiQ9gbHldqYSP95ZIAGZIcDhGJNFmFVpc4goU1DKJSrAy4WL4ZH5lpnCQIfo-NRD5vENTwcNtZm5KbJ79BxIC4iRJb4L9H94jOObMzKlaVARjb-SCWmXKnJnyoO5vtT4PGM1q7RYKUtJj95_LBBWZC-CakIUM6QIMXdegpj_UYnAHuZ_4WW5AOxVVOlzPi6f_6NCkx4Nb2DejlG__kN6AK0cOmT-QbJN9SshqorNLpFDMkaSf5YjRxbIqvfHnmLfFNrEz-aYZc-ftAjG_jaLFcn275bGOETmD9f_kNvDLHcZCwTu_dWgzaQHQN8h7_AGSJjmC7lAf6AtdlWGLgCPg0cU149860szl_SzJTkgnCyg7Ys6oOJKKVwR6o7R5Ink2NiUuLK9Ou9GYPaBJY00xLHKxYAtMYm-xlQYbxTwDHLjFB6rMM7gxWbSMXVeSBWdusD_rsinbKxOHOstfeo8D7q-Sa9-OIB7N8aD8hRhmAx4VijclpeaTllFLcxupHl-BaEb5ikFFTVjPeMdESJQrRbACZABO8RCqyIjNsOARbbKRnWQHoxKO_wJZ_hYx6JdZ_Dc5beBUK9I2nJI3LAyBxZYjObPDP3NuFleg3qFwuhC9Yqz5mXEgJSZA==&xkcb=SoDM-_M3HKAiBTTOhx0LbzkdCdPP&p=0&fvj=1&vjs=3",
      "title": "Regulatory Specialist",
      "company": "Penn Medicine",
      "location": "3400 Spruce Street, Philadelphia, PA 19104",
      "salary": "Not Available",
      "description": "Regulatory Specialist The Hospital of the University of Pennsylvania Shift: Full-time Days Penn Medicine is dedicated to our tripartite mission of providing the highest level of care to patients, conducting innovative research, and educating future leaders in the field of medicine. Working for this leading academic medical center means collaboration with top clinical, technical and business professionals across all disciplines. Today at Penn Medicine, someone will make a breakthrough. Someone will heal a heart, deliver hopeful news, and give comfort and reassurance. Our employees shape our future each day. Are you living your life's work? Summary • Supports the Hospital of the University of Pennsylvania (HUP) and those parts of the Clinical Practices of the University of Pennsylvania (CPUP) which practice at or in conjunction with the hospitals within the University of Pennsylvania Health System (UPHS), operating under the licenses of said hospitals, and its leaders and staff to ensure full compliance with state licensure regulations, hospital conditions of participation, and accreditation standards. • Actively participates and leads the organization's efforts to prepare for, take part in, and respond to any necessary follow-up of both announced and unannounced regulatory body site visits with a focus on the Clinical Practices of the University of Pennsylvania. Responsibilities also include educating staff to hospital accreditation and licensure standards and regulations. • Researches and completes applications, such as the Pennsylvania Department of Health (PA DOH) application and surveys, such as the American Hospital Association (AHA) survey. Actively works with policy owners to support current and develop new Administrative and Clinical hospital polices. • Supports team projects and brings groups to consensus on strategies and/or actions necessary to improve clinical quality and/or safety outcomes. • Develops, maintains, and documents in requisite databases in order to track activities and ensure continuous process improvement and efficiency within the organization and department. • Demonstrates understanding of concepts, methods, techniques and principles needed to accomplish job responsibilities, such as PA DOH, The Joint Commission (TJC) and Center for Medicare and Medicaid Services (CMS) regulations. Responsibilities: • Ensure internal clients are aware of services offered • Supports the vision of the UPHS Clinical Effectiveness and Quality Improvement Department • Develop relationships within the organization to ensure effective communication and partnership / cooperation in all facets of the licensure and accreditation process • Collaborate with leaders and staff to evaluate proposed rules / regulations and assess, develop, or participate in, as appropriate, regulatory advocacy approaches • Coordinate with others, as appropriate, to resolve highly complex or unusual business problems impacted by proposed or final regulatory action or inaction affecting major functions or disciplines • Maintains a solid working knowledge of regulatory body regulations, including but not limited to, TJC, CMS, and PA DOH Maintains a working knowledge of quality outcome related publicly reported data and identifies areas where compliance is problematic • Works with individual clinicians and teams to identify methods to improve compliance with clinical quality indicators required by regulators; Monitors consistency, validity, and reliability of data. Edits as appropriate • Coordinates and participates in regulatory survey readiness activities • Coordinates projects in support of clinical quality improvement, e.g., RCA and FMEA processes. • Researches and completes surveys, such as the AHA survey, which describes institutional demographics and activities • Coordinates quality team projects and brings groups to consensus on methods necessary to improve clinical quality outcomes • Facilitates identification of future performance improvement initiatives and organizes appropriate team members • Develops, documents in, and maintains databases necessary to track compliance activities and outcomes. • Ensures that all initiatives are in compliance with accrediting, regulatory, and institutional standards • Maintains the confidentiality of all inter-departmental correspondence as well as the external clients • Primary liaison with state agency, including but not limited to PA DOH • Collaborates with physicians, administration and staff to achieve desired patient outcomes • Assesses educational needs and provides information and instructional materials to HUP departments • Educates staff on key policies and procedures and regulatory requirements • Conducts Environment of Care rounds and assists in Patient Safety rounds; Serves as a liaison with HUP Pharmacy and Infection Control Departments to identify and solve patient care issues with HUP managers and staff Requirements: • Registered Nurse - PA, preferred • Bachelor of Arts or Science (Required) • Masters of Science in Nursing (MSN) or equivalent preferred • Minimum 3-5 years of experience in healthcare management or healthcare education Additional Information:\nWe believe that the best care for our patients starts with the best care for our employees. Our employee benefits programs help our employees get healthy and stay healthy. We offer a comprehensive compensation and benefits program that includes one of the finest prepaid tuition assistance programs in the region. Penn Medicine employees are actively engaged and committed to our mission. Together we will continue to make medical advances that help people live longer, healthier lives. \n Live Your Life's Work EOE/AA, Minority/Female/Disabled/Veteran Job Type: Full-time Schedule: • Day shift Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0ABEpTQzwxfzc0xME4upgtYvlJMhlguH_u2wDZIAyxab8VmCu274c7lrU2UqSta67lbbTj0eOnuSVusoQcybp50XAkM1Xm211_Ps--JPIWyv6X-U-Ev8zsixXLslpMxdD58ch9kzgbwj2n8UWoszJ5s0Ary3P4jixtZIxEjLTZOyFTC_rJ2B7A62Fxfaww0DwcXxQWZ94Evir7VZJOC0c3a5NjVMtSCFuxcunkzjnYHEuuNy7FvH42xhmQOercxuBQE8heZf0kqbEeOsGND_wVxHCxJHae6uJy0kJPNsZRTDeKhKxUZubsBBIZ-ix39RQ3K1gpoqXwHYckzIrK51aTjOy7fUEWhUVFcOrF3FbMoYRId6r9XLg4foZvhz77ttDQ0F0HYe1xEaVwB470rUp44Dc5R_y3Bt0aHtSNV21JhfOGGMGzB1JclF9lkWukgUm7cngiUMXl8rk0V-RQWjpzWKfonkuB_xuD_-W_3sc8I08H-tGKaoV506f6pHQlL6rAnASMYNqqeQ0brregt1IOynDVcih1cg7cn7NOA2JGeiDku1aAOJQ5Tk3r-68OkCh-jDHjLo9jdCKQmQObsOB5fPUxBvC6dBy5LITKxv-1hJQ==&xkcb=SoB4-_M3HKAiBTTOhx0KbzkdCdPP&p=1&fvj=1&vjs=3",
      "title": "Business Manager",
      "company": "SEAMAAC, Inc/South Philly East Health and Wellness",
      "location": "1902 S 8th St, Philadelphia, PA 19148",
      "salary": "$80,000 a year",
      "description": "General Description: South Philly East Health and Wellness (SoPhiE) welcomes applicants for the position of Business Manager. The Business Manager will be responsible for overseeing the operations of the Hansjörg Wyss Wellness Center. SoPhiE’s mission is to provide high quality, whole-body care for immigrants, refugees, and the general South Philadelphia community and serves patients who are insured and uninsured regardless of ability to pay. The Wyss Wellness Center opened in 2021 through a collaboration between SoPhiE, SEAMAAC, and Jefferson Health’s Department of Family and Community Medicine (DFCM). Providers from Jefferson’s DFCM offer primary care services at the Wyss Center, while SEAMAAC’s Health and Human Services staff provide social services, community education, and wellness groups. SoPhiE will be applying for Federally Qualified Health Center Look-Alike status for the Wyss Wellness Center in early 2024. Position Summary The Business Manager is a full-time, exempt employee reporting to SoPhiE’s Executive Director. The Business Manager will be responsible for overseeing internal systems and ensuring the day-to-day business and operation functions of SoPhiE and the Wyss Center run effectively and efficiently. The Business Manager will also be involved in strategic planning and supporting SoPhiE and the Wyss Center’s future growth. Location: This position is based at the Wyss Wellness Center in South Philadelphia. This is an office-based position with flexibility for some remote work. Essential Responsibilities Operations · Assure health center is open and appropriately staffed during regularly scheduled hours · Oversee front desk operations including scheduling and patient check-in/out · Supervise Patient Services Associate · Manage consultants to identify, implement, and maintain updated technology systems and infrastructure · Recognize and anticipate operational opportunities and challenges, generating solutions for improvement · Update and maintain organizational policies and procedures · Monitor and manage supply inventories · Oversee the Wyss Center’s physical infrastructure · Coordinate equipment maintenance · Provide operational support to new projects and initiatives Accounting · Perform basic bookkeeping activities and financial functions (AP, AR, journal entries) in conjunction with outsourced CFO · Assist with month-end and year-end account activities and the development of an annual operating budget Revenue Cycle · Oversee operations for revenue cycle management, sliding fee scale program, and front-end billing · Work with external EHR/Practice Management vendor to manage revenue cycle processes · Help manage third party insurance payer contracts · Track and analyze data including staffing levels, patient encounters, and provider productivity · Assist uninsured patients in addressing billing issues Qualifications/Competencies · Bachelor’s degree or higher in accounting, finance, business, health care management or related field · 3-5 years of operations and/or finance experience, preferably in a health care setting · Knowledge of information technology · Familiarity with medical health insurance, billing systems, medical coding, and basic medical terminology preferred · Detailed oriented, systems thinker with strong organizational skills · Ability to connect and work with people from a wide array of backgrounds and identities · Commitment to working with medically underserved communities · Proficiency in Microsoft Office products, particularly Excel Hours: Primarily normal business hours (9am – 5pm), with occasional evening and weekend assignments Salary & Benefits: $80,000. Paid health and dental insurance, vacation leave, holidays, sick leave and personal leave. Job Type: Full-time Pay: $80,000.00 per year Benefits: • Dental insurance • Health insurance • Paid time off • Parental leave • Vision insurance Schedule: • 8 hour shift • Monday to Friday • Weekends as needed Education: • Bachelor's (Required) Experience: • Operations: 3 years (Required) • Healthcare management: 1 year (Required) Work Location: Hybrid remote in Philadelphia, PA 19148"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0ALcWRDswkrnfB3tKaDTMTko0b5V1sCRndV9sKqmjFX5u98E8q_-Qnx2R9PPrDtF-zI-oiXVPQsLUztYYIa25Ja0olnfI1ypB8vdjyogtBqV3qJ1ivwLYbkNMpBcWSoRqzwhkWnaoGlctLsIopjgvGJ5QthTgWg5DVpyG3lZKJqcvBZACcifH4B77Apw3uXRuCLUax8_TDcWAU65b4sPbJSY7HmcC9eXpwmf8BBE7rgoNRy1sgaIgAdCw3jZkk-3dntSLpEH727tF9OODHYrJQxEjK9xi1tmVjsk7fjpsKUy9REqhGhHhVt8DhnNzLuZXnBBaETFR6KUldhgpbJZH8At0WQWRqUSiWA8HKLA-XZa59ppf6eg7r5N3BNBoUksRc-y_eMjH0EyqFTsi-l0-yu-03Pd3rIqz4nguFEL2LQannQszqZzjKhC4K6sA2NPUt4sg0qs0Xt6loNbMEgWCASteT-QILSRr9Pdw7gE_04LF-coLLv09ZOcy8JygYUcFkKrw8d21kTG9FsK3DMGrvaJqbdSNThvFNQK776Xgyj48AOQ-_5y11l-FxkKGgQRSIPhijw7MtsYFD3S7kg3ZR1zdy4E6Of6Pw=&xkcb=SoDl-_M3HKAiBTTOhx0JbzkdCdPP&p=2&fvj=1&vjs=3",
      "title": "Supply Chain Planner",
      "company": "Fox Run Brands",
      "location": "1907 Stout Dr, Warminster, PA 18974",
      "salary": "Not Available",
      "description": "We are looking for a Supply Chain Planner to join our dynamic team of professionals who will assist with buyers, sales and customer service to provide information on availability, lead time and forecast performance. Join Fox Run Brands! At Fox Run Brands we are confident you will find opportunity to achieve excellence beyond what you thought possible. We pride ourselves on the enthusiasm and energy of our culture surrounded with like-minded professionals who share our core values and vision. We believe our people are our greatest asset. We provide specialized training customized to the position that will assist you in achieving your highest potential. We offer a comprehensive and competitive benefits package for employees. Requirements • Works collaboratively with buyers, sales, and customer service to provide information on availability, lead time and forecast performance; Sets up and maintains monthly availability reports for selected customers • Analyze customers demand requirements and work with multiple stakeholders to achieve forecast accuracy • Updates forecasts after sales planning approval, loads forecasts to match orders, and creates new item initial forecasts • Provides administrative assistance to Purchasing Management • Reviews and approves purchase orders within thresholds. • Develops and maintains Excel spreadsheets and reports for management review per schedule and upon request • Manages item file maintenance including new item setup, price updates, and inventory discontinuance • Prepares quotes and pricing for large customer programs and maintains catalog pricing across all items • Monitors large programs to troubleshoot potential issues with delivery to ensure customer satisfaction • Reviews inventory values monthly to monitor overstocks and keep overall inventory value low while maintaining high order fulfillment • Contribute to various development projects like new product and new process etc. Qualifications • Bachelor’s Degree in Business or related field required • 2 years experiences on supply chain and purchasing field preferred • Strong analytical skills, ability to interpret data and develop reports • Able to work in a fast pace environment • Experience working in an ERP system(SAP, JDE, Visual etc) • Intermediate Microsoft Excel Knowledge required • Good written and verbal communication skills • A Self-Starter but capable of working in a team environment; Demonstrated competency with cross-functional engagement and collaboration Job Type: Full-time Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Employee discount • Health insurance • Life insurance • Paid time off • Tuition reimbursement • Vision insurance Schedule: • 8 hour shift Ability to commute/relocate: • Warminster, PA 18974: Reliably commute or planning to relocate before starting work (Required) Work Location: Hybrid remote in Warminster, PA 18974"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B5ok5F9QQS25RbBgbvEX7aHXzvivjq9NpRH1Hk2CIpJNnFa-eZjdyZpvHzgDDSq_yr3HBsERzo-uQOaGWUAVMDFShTN725ntcIWbIunkgy71psBAO_08ImliNJsfJUZDo4dOmbDnZPW--j6CC3oken_CFto5k3DNusmjEcDu28t6Tecv4S57ktOixPm8JgWX5prHHxwi1cIZv2H9DTAFl4Id8X6NlvQWM97j4N-3ZCvoBwTdb52gFRgjxJRwyNEC62uUsty0Qf-0E91EFd8EawVrjBPzhQiYKR1aGn9z_wwwLzidOgxhJr0edLxRVB7r13JDrn2mDrII1R0QO3O29fCGbT1vI7PuG0Cku49iATZ9JkLrlhFPmXqT8MnJFqgV223xueBO5TskIkWGqSm13Z3tGdgXA5fpkEeuz3x9zCuvsoOsUB0zYJbohF1V561v5tKTrdGexwzgazsCnUWbDVbQ-gwnZXPhx3cwaOsRZ286OTc_qw3L8HX7tywl_OQgscotdleSzNb8-NhQWX83-JUkLhJ3Zk635tEcehULsFjNJnB1P0D9S3EJL0xAO4EMtDjXXrIhFtSNMipqwFsb8V9hORHNF-WFGJhlnyTrAp2g==&xkcb=SoBR-_M3HKAiBTTOhx0IbzkdCdPP&p=3&fvj=1&vjs=3",
      "title": "Supply Chain/ Production Coordinator",
      "company": "Action Pak, Inc.",
      "location": "1600 River Ave, Camden, NJ 08105",
      "salary": "$18.50 - $22.00 an hour",
      "description": "Action Pak Inc. is hiring for an Supply Chain/ Production Coordinator to work in their new state of the art facility in Southern New Jersey. This position will be instrumental by ensuring that invoicing along with inventory tracking, shipping schedules, production reporting and administrative tasks occur timely and accurately. As part of the Business Operations Team, the individual will be a key player in Action Pak's success. As an employee of Action Pak Inc., you are eligible for medical benefits on your first day of employment. The full benefit package is available after your 90th day of employment. Job Duties: • Be point of contact with customers to enable clear communication as to their requirements for projects and communicate the same in a work order that is provided to the Production Team • Scan customer shipping documents to the appropriate stakeholders in the supply chain • Facilitate in inventory reconciliations for customer owned inventory • Record daily production for customers into software that tracks customer jobs/projects • Schedule pick ups and deliveries of customer inventory with logistics companies • Act as first in line to answer telephone calls and direct to appropriate person • Enter invoice details into accounting system to generate and record customer billing. • All other duties as assigned by management Qualifications and Education Requirements • Associates Degree in Business or Accounting preferred • Experience in inventory tracking billing/invoicing via automated system • Ability to communicate with various stakeholders at all levels in a professional and clear manner • Generating and providing customer account statements for billing and inventory along with production reporting • Microsoft suite • Telephone • Physical Requirements • Lifting up to 10 pounds • Ability to work in seated position for an 8 hour shift • Able to operate keyboard and mouse for an 8 hour shift Work Environment: • Office Job Types: Full-time, Permanent Pay: $18.50 - $22.00 per hour Expected hours: 40 – 45 per week Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Flexible schedule • Health insurance • Life insurance • Paid time off • Vision insurance Compensation package: • Bonus opportunities • Yearly pay Experience level: • 2 years Schedule: • 8 hour shift • Monday to Friday • Overtime Education: • High school or equivalent (Preferred) Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cj-KmZPsf9w80C8b1WzNVrlanjD2SXJjxuCbUWHsXPZrKoeu5JnscFU59DaTYNklrt7TxUBzFakIdcq0_f9akV3MrfGv9uSHVzD5qIr6OauCMaDYBnlMqYXxYj5hrTQLJ_oqAMiANsMFag9vG9l7Ehy67hHstVp0onNbZFEJN7EgNoaMSDsuRVyD0tLmmTYvbmPusYr7C90we-NZ_Nzwmscruz8q6gJZkNb5STloD1nRovJTkjkrqUb_vcYN4RDQNoLcLtJwycNe6oPhX1O0-vy_-tRLVZdDcpOYeA49O0qfPeDBp7_r8VeaaCrSX8l18DFPrq7xJLiNst2w4KTk9Z6nqw58_OouBPp_z4BxyQvp9Z2DcwurOyptb7uM_7fJLXHXXRBf895FxzCprJh60OmpCQP05AxT59icNAG1nGatV79ccrNz2Sqfw2n5v2omP0emPiGJxMFoaYxjsPyDK-eAYPR8oQGn5R106C-nsAUacenNi5VSIvAa61pClzNHHvDSY9zyoOLxnOHMmXqwwoeEUt7MG9tagKENYM-rejsLmb4kcfh-UuPDtvOu4ZQuXej8JLeARHDidDM3trCLBGrhF6I3LRsbA-iyfi-u8rtQDng8Sq179-iS55iado1zsp4z76f9mBHQFezK-yGKbAVfLuMlMiQ3kMtt76-7LACZLS6flYcVz8oYiUsPWQ6Fz_aVr976bxO2PWBmkYiGeLSf2FxQHwZr0KqUG6UVNNMXdiBCpYjeGD2KC5i-9Wwuue5gMffWNoYpdgHZuGdxEbpSo-waeI_dMM-z9GIuVbMcwF1UrbB2KZ0looHxwb2Oz4bhzF3awEjxAEMHXxOevXAD0srXg83WThBQaOJqkGmqGtbBNzrMcO6ykAsRCwrVbmTMlL83npqkRU4Y7DV-WXHE_oJj7179AgCs4lr-QvbYSDQQXEPFBKSEBLzZTDVNITy6m_dkzDWHr77DrV0XSa7DlbB5zII_m9Z4h7sUaByN2I9ePcNMN9Pm8Sduwr4r4w3-fu1vpBJKIEy0gvY08SSbQXAJyGY_XhamY9IxP5ahjUKbGKaSg_5Z_UQZ_zV3qoE3b_spkpvLaTQRUbLUmf0xmAqEdlmCd8bkjXUACOZcDd8o8A54VHMBbQgBfJoTQV2A8ox58zgEXMZfr6UefhsuXFJu7wYC0YZvs6sj6-er5Rme3ZxE0QMfGywV-ZwUNGHnxOhatmWhrpw7smSIrHAgwMR5_2DhYhn-7frpZHTl160npTTPiEdhAACLZ2MTbUcWp7l6jdoILt6vN2BsNSjvPgRZ-FO7csOTWkpRjT3vuZps9jZ8oM&xkcb=SoDf-_M3HKAiBTTOhx0PbzkdCdPP&p=4&fvj=0&vjs=3",
      "title": "Manager, Business Development",
      "company": "Comcast",
      "location": "Philadelphia, PA 19103",
      "salary": "Not Available",
      "description": "Job Summary \n Job Description Core Responsibilities • Analyze and assess emerging strategic business opportunities • Build financial models and business cases to evaluate strategic scenarios and economic impact • Drafts summaries for C-level presentation materials highlighting actionable recommendations • Participates in due diligence on strategic initiatives and potential partnerships • Actively supports team members with active deal negotiations and deal management including maintaining all deal related artifacts such as term sheets, long form agreements, technical documentation, and deal issue lists • Build relationships with stakeholders and subject matter experts across functions and business units • Develop an understanding of Comcast’s business strategy, existing products, and industry trends • Other duties and responsibilities as assigned  Employees at all levels are expected to: • Understand our Operating Principles; make them the guidelines for how you do your job. • Own the customer experience think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services. • Know your stuff be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences. • Win as a team make big things happen by working together and being open to new ideas. • Be an active part of the Net Promoter System a way of working that brings more employee and customer feedback into the company by joining huddles, making call backs and helping us elevate opportunities to do better for our customers. • Drive results and growth. • Respect and promote inclusion & diversity. • Do what's right for each other, our customers, investors and our communities.  Disclaimer: • This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications.  Comcast is proud to be an equal opportunity workplace. We will consider all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, genetic information, or any other basis protected by applicable law. Education \n Bachelor's Degree, Master's Degree While possessing the stated degree is preferred, Comcast also may consider applicants who hold some combination of coursework and experience, or who have extensive related professional experience. Relevant Work Experience 5-7 Years Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details."
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A_wAAiltCI1DjiIXwY4kCEAs65K9PhmOAmbY1VMYlI4kDl_Zb7LGPUoU9ZKLe5hMk9U7jmqbwaB6Hm3lWQUwsW0QR4Vow5APvxXT4DmhFlEL2YYisEuqNRHWWnlsroSnWTbJbwNQ-Cp-Vv2BEUrybY5IhWWjLwYqeNl7Pdwry-XLBf_J0Mtbx15PVNfpBITub4a2_7OwzaGv3FRojqSIQTuQRgOY2ARcWS6Or52AZ_0DP-i8RF4JibwlHvqCpCjItRPOgvxlV-3lVYr7vkmqqoRLtuaRh13l-uvAcGs-OPBUQ1SvUch6Ftqvxhr4-mAyOpmw_x8VaPoTDuIpTuvg-H8vh6h32YsCKs1dHYlXH2mpbn41jQSTvjvTYICQtE4fje4PAIWdIMD2CD_uFpufTdi4eB_z5nPX_6RWUo8eSt3dj04zpKyU2ohr-Y1FA08Bu-ThVjcVK_f1qmgSP09Lz6QglmdWjtDfN1ndo7di5nrNGP4QZ4brPsGMT-05WKicyHrru2SH1Pku6kkNKWDgX_l3ocvfFjgjR-f1GsESdsVuN5EjH061IT2gQnlBT0r25B5HDu2BiWgOW5D8gV6OCL&xkcb=SoBr-_M3HKAiBTTOhx0ObzkdCdPP&p=5&fvj=1&vjs=3",
      "title": "Accounting Bookkeeper",
      "company": "Trinity Packaging Supply Company",
      "location": "220 Laurel Road, Voorhees, NJ 08043",
      "salary": "$34.85 - $38.46 an hour",
      "description": "THE COMPANY Trinity Packaging Supply is the first company to leverage proprietary software to connect over 300 distribution and manufacturing centers across North America to provide businesses with packaging’s largest catalog (over 80,000 custom and stock packaging supplies) — offered at low prices with next-day delivery. Since 2010, Trinity has been the wholesale source of pallets and packaging supplies for manufacturers, retailers, and logistics companies across North America. We have a mindset of innovation, harnessing the power of state-of-the-art technology and our growing network of manufacturing and distribution partnerships to change how businesses think about packaging supplies. After sustained hyper-growth, doubling revenue every two years, we are scaling our team and applying our dropship expertise to a new e-commerce platform. Similar to how Airbnb changed hospitality and Uber changed transportation, this will change the packaging industry forever. THE CULTURE At Trinity Packaging Supply, everyone is driven to win and do whatever is necessary to help push the company to new heights. The culture is about rising the tide that will lift all boats and growing the company into something greater. We believe each team member delivers unique value, and together we are a force for positive change in the world. Not only do we save our customers money, but we also have a lot of fun doing it. We walk the talk and have the awards to prove it. THE OPPORTUNITY This is a once-in-a-lifetime opportunity to join a company that is on the verge of disrupting an entire industry and play a key role in that success. As a bonus, Trinity is also one of Inc. Magazine's Best Workplaces in America (three-time winner!). The culture at Trinity Packaging Supply puts the team first which has directly contributed to the company’s growth. Our authenticity and confidence are part of what makes the creative minds behind Trinity continue to innovate, serve, and connect with the real people behind the businesses we serve. RESPONSIBILITES This is a hands-on accounting role, handling all daily accounting and finance responsibilities. This position requires the ability to work on a wide range of financial duties including: accounting, reporting, GAAP, payroll, and internal policies and procedures in order to provide accurate and timely financial statements. • Responsible for managing and reconciling AR & AP • Maintains and reconciles all accounts • Manages cash flow • Reconciles all bank/credit card statements • Comply with local, state, and federal government reporting requirements and tax filings • Processes payroll on a weekly basis • Comply with Generally Accepted Accounting Principles (GAAP) for financial statements. • Analyze financial information and prepare balance sheets. • Ensure compliance with organizational guidelines and procedures, and federal and state • regulations. • Assist in financial and tax audits and general ledger preparation. • Closeout month-end • Responsibilities and tasks outlined in this document are not exhaustive and may change as determined by the needs of the company QUALIFICATIONS & REQUIREMENTS You could be a fit if you have: • Bachelor's degree in Accounting or Business Administration • Minimum 5 years of accounting experience • Sound understanding of accounting and financial reporting principles and practices • Analytical mind with strong conceptual and problem-solving skills • Meticulous attention to detail with superb organizational skills • Ability to work under pressure and meet tight deadlines • Critical thinker with a high proficiency in math • Ability to work independently and as part of a team • Excellent report writing, communication, and IT skills • Advanced competency in Microsoft Office, a working knowledge of NetSuite software would be an advantage • Excellent report writing, communication, and IT skills * WORKING CONDITIONS • Must be able to remain in a stationary position 80% of the time • The position is set in an office setting • Constantly operates a computer BENEFITS & PERKS Trinity Packaging Supply is a four-time winner of Inc. Best Workplaces because we put our team first. It's a \"work hard, play hard\" type of environment. A few of the employee perks that make us award-winning include: • Medical, Dental, Vision Insurance • PTO & Holidays • 401k with employer 3% contribution • GTL life Insurance • Voluntary life insurance • Voluntary STD plan • Gym membership Job Type: Full-time Pay: $34.85 - $38.46 per hour Expected hours: 40 per week Benefits: • 401(k) • 401(k) matching • Dental insurance • Health insurance • Life insurance • Paid time off • Vision insurance Physical setting: • Office Schedule: • 8 hour shift • Monday to Friday Application Question(s): • This position requires being on-site, Monday - Friday. Are you able to commit to this schedule? Education: • Bachelor's (Required) Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D9_OZ6lvVYK7TOym690zAs0a2VuR3HPvfc6L2d-MEy1JCx77qWHSrMDamFqZPxZz3MUTuy5nYgK-PGjdyRkMlxL7knF7SCVE49IoJ-7A2GMK9UkeApXcYqfXg75XSks3aCaw-Q-K1sXwNLRuZui8aMvcEFYlxBO4Mgt1AbbSkORnqlYzAh7oJeLb_p2_GLgBGDH6o2DJkvXzCE1UsNpNrLNNKaJjr5ZK669lVlXfKE1E2CkY13zVPXhC5vLtTp42zsCxKwFmqx4aaPyTmEkLJEvfaj5Za1japRlucQmcQFc4MojCvRz5LEKuZHRP-rHJVHjzwu3MeDNM8yTzhAHRAf1dXG145NdRohHuH1JGExqxQFA1uEJdotf9CCaDK9rDL5pafgKnLGyNcmvycuTyNZ3nDNPfTtk1LMa4zvtDEZ-lML30I5FVAgv1Y8IbotO2yTPSgEl_ddFnJ6MrikOWd6iq5s07qmiV0OLCleDINmluVry6hbC4M6dbeLE9P02w2yLIoosWLwwXjbMQBUksBht-ZRI6cS24Bzwvpo3fTNhY1nByNZTRaeOUHqeocvuq9wumNMVBvFBb4aDZir6r33x7sojFuz8uGxjaxIFiMnTC0QgLPNTCOF&xkcb=SoD2-_M3HKAiBTTOhx0NbzkdCdPP&p=6&fvj=1&vjs=3",
      "title": "Revenue Cycle Data Analytics Manager",
      "company": "Emergency Care Partners",
      "location": "Philadelphia, PA",
      "salary": "$85,000 - $100,000 a year",
      "description": "RCM Data Analytics Manager We are seeking an experienced Data Manager to lead the development and utilization of data systems within the RCM Department. In this role, you will be responsible for identifying efficient methods to organize, store, and analyze data while maintaining strict security and confidentiality measures. An exceptional Data Manager comprehends the intricacies of data management and possesses an understanding of databases and data analysis procedures. You should also possess strong technical acumen and exceptional troubleshooting abilities. Your primary objective will be to ensure the seamless and secure flow of information within and outside the organization, guaranteeing timely access and delivery of data. By implementing effective data management practices, you will contribute to the overall success of our organization. Responsibilities · Maintain Excel and Tableau data models. Create and enforce policies for effective data management. · Manage annual RCM data testing with billers to ensure accuracy. · Devise efficient procedures for ongoing RCM data management. · Support RCM Operators with the delivery of actionable metrics. · Manage visit reconciliation procedures between census, billing and hospital systems. · Manage reconciliation procedures between bank deposits and payment applications. · Develop and manage dashboards that monitor RCM vendor performance. · Interface with Finance/Accounting on revenue, visit and RCM analysis. Requirements: · Excellent understanding of data administration and management functions (collection, analysis, distribution etc.) · Proficient in MS Office · Experience managing data models in Excel · Knowledge of one or more SQL variant, such as MySQL, MSSQL, and PostgreSQL · Familiarity with Tableau and other BI applications · 1-3 years experience in healthcare setting Job Type: Full-time Pay: $85,000.00 - $100,000.00 per year Benefits: • 401(k) 4% Match Experience level: • 3 years Schedule: • 8 hour shift Ability to commute/relocate: • Philadelphia, PA: Reliably commute or planning to relocate before starting work (Required) Application Question(s): • Do you have at least one year of healthcare billing experience? Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DuWgfoWOinIf0X_eOruHsWHDEM26jLqL0MQslCUQwzf2fZRuzDgVfKL9KYadA-nrcNBvydIJvo9R69BU6EQJVM0QIfAD0htrmnqzWvZmAaJsFfbJ4VyAdaXPiHn8biq56nKPUdSPujnIOIUO7o-0vO0h81ddCVJ9xr3IY0uWon3FKpncLvRwCLBh0-nr5nHlvNJu4qOW5NRvpdUCJuFbHHDJJ1ZWIKrjCeUGjthad1hcHCTGnLb1JKTzDD7y2QoQCYXUICMtMltJnxpcmsi6nznkg7KSDl6p4h6zdcKddh6bH0cZF2HIyrQd8GyT0PHN9bjGMEzSXMyAv-C7p3JYDlO6--ZXrLR-WSowWptJWPFh2_CRkvkh2qE5gyUgx8zLz4y-olhz0h4c9cnCmda3vzSDVULJjfpeA6943Slfgnej_LpRC6CYp7rjjbkMMecS2LIUB6vLG3qNqMYcQmiPPDmCKqnNHwQSBzY74BVE59Z7H0FMZgBT7KlfU8BhtsPQAH_VfPbeAXP9Y2pclZNEqXFFlkKQ6QXmXEdZ6AAYHIzYCdFZhfSrXU1HV-4-CIC8TNFgUDDDynJOsUfvsiqrewV3y79ydwN-c0wx9kmMZGaEr-QydLo-yYxfm-vNENAoDo6kfjXYKqEA==&xkcb=SoBC-_M3HKAiBTTOhx0MbzkdCdPP&p=7&fvj=0&vjs=3",
      "title": "Dialysis Area Manager",
      "company": "Dialyze Direct",
      "location": "7107 Old York Rd, Philadelphia, PA 19126",
      "salary": "Not Available",
      "description": "Exciting opportunity to join a team of highly motivated and energized professionals. Must be able to function as a regional supervisor Monday - Friday days to manage staff; oversee training, orientation, nursing care, compliance, staffing and employee relations. The Area Home Care Coordinator works collaboratively with the State Educator, Regional Clinical Director and site clinical leadership team to ensure quality patient care is provided by highly skilled and motivated caregivers. Qualifications BS/AA/diploma in Nursing with at least 12 months of RN experience (6 months in hemodialysis) needed. Must have valid state nursing license, BLS certification, driver's license, able to travel to local area sites and lift up to 50 pounds. Benefit Summary • Medical, Dental, Vision & Life Insurance • 401(k) with Company match • Flexible Spending Accounts • Education Assistance • Certification & Professional Membership Reimbursement Compensation • Salary Range: Negotiable • Compensation offers are based on education, experience, skills, and geographic region  Learn more at dialyzedirect.com"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=283e023d1e3d73cd&fccid=cce48ad42816872f&vjs=3",
      "title": "HR Business Partner - HOSPITAL",
      "company": "Jefferson - Center City, Philadelphia, PA",
      "location": "111 SOUTH 11TH STREET, Philadelphia, PA 19107",
      "salary": "Not Available",
      "description": "Thomas Jefferson University Hospital is looking for a strategic partner to the hospital departments within Jefferson Center City, Philadelphia. MUST HAVE STRONG HOSPITAL EXPERIENCE!!! The HR Business Partner (HRBP) aligns business objectives with employees and management in designated business units. The HRBP serves as a consultant to management on Human Resource related issues. Successful HRBP will act as employee champion and change agent. HRBP assesses and anticipates HR-related needs. Communicating needs proactively with our HR department and business management, the HRBP seeks to develop integrated solutions. The HRBP formulates partnerships across the HR function to deliver value added service to management and employees that reflect the business objectives of the organization. The HRBP maintains an effective level of business literacy about the business unit’s financial position, its mid-range plans, its culture and its competition. • Acts as a single point of the contact for the employees and managers in the hospital units • Proactively supports the delivery of HR processes a the client’s side • Builds a strong business relationship with the internal client • Accountable for HR service delivery satisfaction to client. • Interacts with co-workers, visitors, and other staff consistent with the core values of Jefferson. EDUCATIONAL/TRAINING REQUIREMENTS: • Bachelor’s degree in related field required. Master’s Degree preferred. CERTIFICATES, LICENSES, AND REGISTRATION: • SPHR or PHR preferred. EXPERIENCE REQUIREMENTS: • Minimum of 5-10 years of the resolution of complex employee relation issues. • Strong experience supporting hospital/in-patient functions in a large healthcare entity is required. • Working knowledge of multiple human resource disciplines including compensation practices, organizational diagnosis, performance management, federal and state respective employment laws. Jefferson includes Thomas Jefferson University and Jefferson Health, a dynamic university and health system with broad reach across the Delaware Valley. Jefferson is the second largest employer in Philadelphia and the largest health system in Philadelphia based on total licensed beds. Through the merger of Thomas Jefferson University and Philadelphia University in 2017, our University includes ten colleges and four schools. We are an NCAA Division II university and an R2 national doctoral university offering undergraduate and graduate-level programs that provide students with a forward-thinking education in architecture, business, design, engineering, fashion and textiles, health, medicine and social science. Jefferson Health, the clinical arm of Thomas Jefferson University, has grown from a three-hospital academic health center in 2015, to an 18-hospital health system through mergers and combinations that include hospitals at Abington Health, Aria Health, Kennedy Health, Magee Rehabilitation and Einstein Healthcare Network. We have over 50 outpatient and urgent care centers; ten Magnet®-designated hospitals (recognized by the ANCC for nursing excellence); the NCI-designated Sidney Kimmel Cancer Center (one of only 70 in the country and one of only two in the region); and one of the largest faculty-based telehealth networks in the country. In 2021, Jefferson Health became the sole owner of HealthPartners Plan, a not-for-profit health maintenance organization in Southeastern Pennsylvania. We are the first health system regionally to create an aligned payer-provider partnership. Jefferson’s mission, vision and values create an organization that attracts the best and the brightest students, faculty, staff, and healthcare professionals, as well as the most visionary leaders to drive exceptional results. • OUR MISSION: We improve lives. • OUR VISION: Reimagining health, education and discovery to create unparalleled value • OUR VALUES: Put People First, Be Bold & Think Differently and Do the Right Thing As an employer, Jefferson maintains a commitment to provide equal access to employment. Jefferson values diversity and encourages applications from women, members of minority groups, LGBTQ individuals, disabled individuals, and veterans. Covid Vaccination is a requirement for employment at Jefferson for employees working at Jefferson’s clinical entities or at the University. If you are not currently vaccinated you will be required to receive the vaccination prior to hire date if you are offered employment, unless you request and receive an approved medical or religious exemption from Jefferson."
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cc-nnF3BWuluZpYtl8hgF7jhPgCeeB_WpGrgwauSvr4xoFK_hbBKXi4oR6PuEeGAYsZbJJGL2Oy9elhoiXPan0RtBhc76uIcETYRSJFtxE9sw6T24Dm-F-ceL9Y3x-CcL3wBPMqvSS3JTNPhaG-J7mr0O2KDqILUsIFAxb1ascnNamr9oOBsQGS6tHHPmvs83iVpi38FldSNT2XdQuvhDM6JGScHuDL2hnzXD0ewkIvFqPK9L_oUWTCJinj8GxI8LnmeT5HQVpUBlRylmR0jSVBsBtRbit9X0A1uD3bl_cwDDzgNHcYawvGu2XJfeHR6BNJ60B3TzMFn_sKP-Vj-KwhCBP88z9-SqfQOPcwdjQHpdU_EyoJDZVN44ZFHNlyKoRtWResbQv_NLRc_KWGB3EYI08TuMEFtwazeStwcNwTPUZQ5Kw84D-5wWB0-zeiA08lD-ofXam1LmoURae1a_IcgXDd0_NZ0H_ELaIM34q3OJSlBWC-NnTO4i8U_V-yx69_UCOAWt8Z_pf6X1MhzctgJWoGwPhdc9cVKLJ9_LkCQvYgfpewJwnLRmdm3aL1Srs6BltX674Vg==&xkcb=SoAf-_M3HKAiBTTOhx0CbzkdCdPP&p=9&fvj=1&vjs=3",
      "title": "Product Manager",
      "company": "Metals USA",
      "location": "Metals USA in Philadelphia, PA 19116",
      "salary": "$75,000 - $85,000 a year",
      "description": "Metals USA is seeking a Product Manager in Northeast Philadelphia PA. Metals USA is a solid, growth oriented, carbon steel (plate, beam and tube) distribution center servicing the defense, commercial, construction, aerospace and fabrication industries. The Product Manager is responsible to develop market strategies, identify customers’ potential products, conduct market research, and determine customer specifications along with production timetables and pricing. Co-manages a sales team and provides leadership towards the achievement of maximum profitability and growth in line with company vision and values. Establishes plans & strategies to expand the customer base in the market. Responsibilities: • Develops & executes strategic business plan to drive growth in revenue and profitability. • Develops and implements specific marketing and sales plans consistent with the growth and profitability goals for products. • Assesses market competition by comparing company’s products to competitor’s products. • Assesses product market by calling on customers’ and evaluating sales call results. • Prepares action plans for effective search of sales leads and prospects. • Facilitates inventory turnover and product availability by reviewing and adjusting inventory levels and production schedules. • Introduces and markets new products by developing time-integrated plans with sales & production. • Determines product pricing by reviewing production & sales costs; anticipating volume; costing special & customized production. Position Qualifications: • Bachelor’s Degree in Business Administration or relevant course of study, or equivalent combination of education and experience. • 5-7 years’ experience in steel service sales • Strong understanding of customer requirements & market dynamics. • Computer Literacy required. • Travel required both in vehicle and air travel as needed. Metals USA offers a competitive starting base salary range of: $ 75,000 - $ 85,000 and benefits plus upward mobility professional growth. Metals USA provides equal employment & affirmative action opportunities to applicants and employees w/o regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disability. Job Type: Full-time Pay: $75,000.00 - $85,000.00 per year Benefits: • 401(k) • Health insurance • Paid time off Weekly day range: • Monday to Friday Work setting: • In-person Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/company/Weber-Gallagher-Simpson-Stapleton-Fires-&-Newby-LLP/jobs/Intake-Specialist-26dd792682e47f4a?fccid=834924b3935cdf0d&vjs=3",
      "title": "New Business Intake Specialist",
      "company": "Weber Gallagher",
      "location": "Weber Gallagher in Philadelphia, PA 19103",
      "salary": "$19 - $31 an hour",
      "description": "Weber Gallagher is a regional law firm, with more than 110 lawyers in ten regional offices.  We provide legal counseling and representation in the Mid-Atlantic and Midwest regions of the United States to local, national and international businesses, financial institutions and insurance companies. We represent businesses, employers and individuals in multiple areas of law. Weber Gallagher has an immediate opening for a New Business Intake Specialist to assist with the processes and procedures for the onboarding of new clients and the identification of potential conflicts of interest. Responsibilities: • Run conflicts and make sure the appropriate waivers/clearances and approvals are received. • Processing new business intake forms to open new matters through Aderant Expert (keeping to a 24 turnaround) • Work with staff to ensure that information is appropriate to formally open all new matters. • Send engagement letters to Billing to create rate codes for new billing clients, when needed. • Determine attorney origination credits and update the master spreadsheet with new credit splits and update the information in Entity Manager in Expert • Apply proper billing rates to each matter, adding the bill cycle. • Quality control of matter data ensuring completeness for every new file • Re-open files as necessary which includes re-running conflicts and a check of matter parties, billing contact, rates, and originations. • Close designated matters upon receipt of emails from staff and update bill cycle to final for billing. • Make record changes to files such as adjusters, addresses, offices, billing attorneys, clients, bill cycles, etc. • Manage the Conflict inbox and Records inbox - making sure requests are organized and completed in a timely manner. • Maintain and update conflict database with current information received regarding clients and their affiliate relationships. Qualifications: • Minimum of two (2) years of prior New Business Intake experience in a law firm setting • Experience with Aderant Expert and conflicts database software • Strong knowledge of conflicts of interest and new business intake principles • Ability to work independently in a high-volume practice and take initiative • Strong multitasker, ability to juggle multiple projects simultaneously Weber Gallagher offers a friendly office environment, excellent benefits package, including 401(k) and medical. Please visit our website: www.wglaw.com. Equal employment opportunity is provided to all employees and applicants for employment without regard to a person’s race, color, religion, age, gender, sex, sexual orientation, gender identity, pregnancy, ancestry, physical handicap, disability, national origin, genetic information, marital status, veteran status, disability, or any other factor/ status in accordance with applicable federal, state and local laws. Job Type: Full-time Pay: $19.00 - $31.00 per hour Expected hours: 35 per week Benefits: • 401(k) • 401(k) matching • Dental insurance • Disability insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Life insurance • Paid time off • Retirement plan • Vision insurance Schedule: • Day shift • Monday to Friday Travel requirement: • No travel Application Question(s): • How many years of experience do you have with the new business intake process? • How many years of experience do you have with the conflict clearance process? Experience: • Law office: 2 years (Required) Work Location: Hybrid remote in Philadelphia, PA 19103"
    },
    {
      "url": "https://www.indeed.com/company/Worldgate-LLC/jobs/Business-Analyst-c7ed58fde0fe1ea4?fccid=e0d635dfc97703f1&vjs=3",
      "title": "Business Analyst (Hybrid)",
      "company": "Worldgate, llc",
      "location": "Worldgate, llc in Philadelphia, PA 19130",
      "salary": "$65,000 - $90,000 a year",
      "description": "Job Summary: The Business Analyst (BA) supports our client's systems project. The BA works with our client’s functional and technical stakeholders to gather business requirements and document processes. The BA will coordinate project stakeholders to effectively implement large-scale organizational, process and system improvements. The BA will report up to project stakeholders using project management tools and desired client reporting structures. The position is located onsite and remote in Philadelphia with a hybrid work option available. Essential Functions / Responsibilities: • Support in the design, configuration, and implementation efforts or the system modules. • Develop Testing Plans, strategies, and test cases • Document and communicate test results • Identify and facilitate issue resolution with functional and technical groups • Conduct business analysis activities by working with functional and technical stakeholders to support the functional systems, data integrations, data validation, data cleansing, testing. • Organize and facilitate stakeholder requirement sessions • Demonstrate the ability to document, define, analyze and translate functional and technical business requirements • Translate business needs into requirements specifications and clearly communicate requirements to both the business and technical stakeholders • Lead in the development and review of requirements documents, use cases, test cases and other functional and technical artifacts • Promote best practices in data analysis and reporting • Capture and document meeting minutes, requirements, work-flows and best practices • Effectively communicate to management and client stakeholders on work products and status • Participate in enterprise-level project teams to identify and implement process and system improvements. • Responsible to understand Worldgate’s values and behaviors (The Worldgate Way) • Ensure that my daily interactions with Worldgate internal and external parties align to Worldgate’s values and behaviors. Key Competencies: • Business Analysis • Problem Solving • Technical Capacity • Team Collaboration Education, Experience and Certifications: • Bachelor's degree (B. A. or B.S.) from four-year college or university • 3+ years of experience as a business analyst • Experience leading and presenting meetings to steakholders Specific Knowledge, Skills & Abilities: • Excellent documentation and writing skills • Experience with data analysis using Microsoft Excel and SQL Database • Experience with implementing large-scale organizational, process and system improvements • Organizational skills, communication skills and strong attention to detail • Knowledge of BI reporting tools • Knowledge of back-end database systems and database languages Worldgate LLC provides equal employment opportunities to all employees and applicants for employment, without regard to race, color, age, creed, religion, sex, sexual orientation, ancestry, national origin, disability, pregnancy, marital status, or gender identity. Job Type: Full-time Pay: $65,000.00 - $90,000.00 per year Benefits: • 401(k) • Dental insurance • Health insurance • Paid time off • Vision insurance Schedule: • 8 hour shift Ability to commute/relocate: • Philadelphia, PA 19130: Reliably commute or planning to relocate before starting work (Required) Application Question(s): • Are you authorized to work in the United States WITHOUT sponsorship? • Are you able to work WITHOUT sponsorship? (Must answer to be considered) Education: • Bachelor's (Required) Experience: • Microsoft Excel: 3 years (Required) • Business analysis: 2 years (Required) • ERP systems: 1 year (Preferred) Work Location: Hybrid remote in Philadelphia, PA 19130"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=98a67af3ebd81260&fccid=36b76cf613fccb72&vjs=3",
      "title": "Business Analyst Contracts IS-REMOTE",
      "company": "Penn Medicine",
      "location": "3600 Civic Center Blvd, Philadelphia, PA 19104",
      "salary": "Not Available",
      "description": "Description \n \n Summary: \n \n • Responsible for working with IS AVPs, ACIOs and directors with vendor negotiations, agreement development, contract validation and other vendor agreement tasks as assigned. This individual will also work closely with Corporate Materials Management, Corporate Finance and the Office of General Counsel (OGC) to ensure IS agreement / negotiations conform with UPHS policies and procedures. Provide written summaries, forward looking multi-year financial modeling and CAF for IS agreements that are assigned. The individual in this job should be able to handle multiple complex projects with variable timelines and work with IS management to prioritize assigned projects. This position is fully remote for the IS-Financial Managment Department.  Responsibilities: \n • Responsible for managing the IS contracting process including engaging with new IS vendors, working with Corporate Materials Management to renew existing IS contracts with better pricing terms, and consolidating contracts for multiple entities within IS. • Works effectively with IS leadership and vendors with regards to pricing, length of contract, annual increase terms, IS service levels and ensuring agreement terms meet IS requirements. • Responsible for maintaining a master list of all contracts that includes but is not limited to vendor name, purpose, cost per contract, renewal dates, appropriate accounting units and responsible parties. • Create agreement summary documents to IS leadership including multi-year financial cost models that summarize UPHS investment commitment and expected savings and/or cost increases for assigned agreements. • Review draft agreements to ensure terms and conditions are compliant with the established Policy and Procedures set by Materials Management, Finance and OGC. • IS liaison with corporate departments; Purchasing, Finance and OGC, as well as serves as an IS contact with outside vendors. • Is well versed in the UPHS signature process and tracks each agreement, quote, order form, CAF, etc. as they proceed through this important phase. • Ensures all agreements and legal documents are stored in PennTract.  Education or Equivalent Experience: \n • Bachelor of Arts or Science (Required) • Business management preferred or Computer Science related field preferred 3+ years Business experience in areas such as consulting, software contracting, finance, etc. • Experience with Clinical Engineering contracts preferred Experience with Clinical Engineering contracts preferred  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C9CXm_xjTENTWCaVwIcy725qFEsz-RtpYWH89FEchvcMvOamyTEyE3lAWsb0j3NECpH3OFgD2Uj2vIrILfNjLzA1OZymtfjGnmiLAh2piqCZ-T4JyFycKKHKyrOoGoSnghUUxqvvv1EZv-unEYgnwq0fFxwnnmDRjK03yvvPCaQhy4p6qSaQqj8NDRJlp8zP0U4pOFNm22z51z7BqxY1lLqDX4hn_zUK590zGwwLDNZ16M83vc5agp1I5MfLssUhowmZkBjPPhg6Zg9gIhkdLCXnQXt3ssRCRMpNnkzi5CMfWHpfcW6lQY7wA6lIVGTKzwW5u9i6j91IPhzG4KCmdx9dKP2Duimt4YQ_jAleyfpAtyQaFbXxJrCqujv_SxjrEoSj8FCh05PYOWSRj59HyFYQ1zZ32YwaxYxffFLyBHDP-6qCnSVfXwyd4THvAyGRKVuKUCCOOdZjLFlRv4igdOXx8zrWap7PiF6S2r2xBLj8nrFVqX5k0YVFJtlrDSlrMWNYoQX5uTYwbMnGekiRHoJK2NuYzLpeZYpPTWkRcrPUBJ3rDzrBLg-cMw8K5C9KJph58ep4AMtXI9VK1kkWN1HRxO9YqtPvufJnmU_vWTFwtD88IyyDsIHkZWKdXJw1Q=&xkcb=SoAM-_M3HKAiBTTOhx0GbzkdCdPP&p=13&fvj=1&vjs=3",
      "title": "Business Development Executive",
      "company": "PharmaCord",
      "location": "Philadelphia, PA",
      "salary": "Not Available",
      "description": "Our Company: PharmaCord is a leading provider in pharmaceutical patient support services. Our services are sponsored by our pharmaceutical company clients. Together, we are committed to compassionately providing patients with support services during their journey on therapy. We are PharmaCord, a purpose-driven organization on a rapid growth journey. Our rapidly growing company is currently seeking a Business Development Executive to further accelerate success in the marketplace. In this position, you will play a pivotal role in driving revenue growth and expanding our client base. Your primary responsibility will be to identify, cultivate, and secure new business opportunities while nurturing existing client relationships. The ideal candidate is a highly driven individual with a passion for building relationships and solutions for bio-pharma companies. The right candidate will thrive in a fast-paced environment that is results-oriented. A typical day in the life of a Business Development Executive will include the following: The responsibilities include, but are not limited to the following: • Conduct in-depth market research to identify potential clients, market trends, and competitive intelligence. • Analyze market data to develop strategies for expanding our patient services offerings. • Provide insights on the industry and identify opportunities within the market for growth through a continual analysis of competitors and competitive offerings. • Build and maintain strong relationships with existing clients to understand their needs and ensure client satisfaction. • Develop and execute effective sales strategies to acquire new business and meet or exceed revenue targets. • Collaborate with cross-functional teams to create compelling proposals and presentations tailored to client needs. • Participate in solution creation and crafting of RFP responses to document solutions. • Deliver engaging and persuasive presentations to potential clients. • Lead negotiations with clients to establish contractual agreements, pricing structures, and service level agreements. • Collaborate with internal teams, including operations, marketing, and finance, to ensure successful implementation of client projects. • Provide regular updates to senior management on sales pipeline, forecasts, and market insights. • Attend industry conferences, seminars, and events to build relationships, stay informed about industry developments, and identify prospective clients. Requirements: • Prior business development experience (5+ years) within healthcare/pharma services • Bachelor’s degree in marketing, business, statistics, design or relevant field (Master’s degree preferred) • In-depth knowledge of the pharmaceutical industry, including regulations, market dynamics, and patient support services. • Demonstrated success in business development/sales within healthcare services sector • Preferred locations: Baltimore, Raleigh/Durham, Philadelphia, Princeton, New York, Boston. • Willingness to travel as needed to meet with clients and attend industry events • Ability to think strategically and analytically • Excellent PowerPoint skills and willing to take ownership and create sales presentations • Proficient in managing and reporting pipeline activity through use of dashboards, PowerPoint and Excel • Excellent communication (oral and written) and presentation skills • Able to multitask, prioritize, and manage time efficiently • Ability to work independently, meet deadlines, and exceed sales target • Creative problem solver who thrives when presented with a challenge Physical Demands & Work Environment: • Ability to travel 60% - 70% of the time to visit clients and to our Headquarters. • While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to sit for long periods of time, use hands to type, handle or feel; and reach with hands and arms. Must be able to type 35 WPM with 97% accuracy. • This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, etc. Once you land this position, you’ll get to enjoy: Our Benefits & Perks • Affordable Medical, Dental, and Vision benefits - PharmaCord covers 75% of Medical Premiums for our employees • PharmaCord has not increased healthcare premiums in the past 4 years • NEW! Concierge Medical Clinic free of cost for those enrolled in a PharmaCord medical plan (including dependents) • Wellness discounts of up to $260 per year for participation in wellness program • Company paid Short-term Disability (STD) • 401(k) company match • Annual HSA employer contribution • Company paid and voluntary Life Insurance options • Voluntary Life, AD&D and Long-Term Disability Insurances • Paid Parental Leave of Absence • Wellness and Employee Assistance Programs • PTO benefits, flex days and paid holidays • Employee Referral Program • Ambassador Program • Tuition reimbursement program A Career You'll Love • Working for PharmaCord - voted Best Places to Work in Kentucky for 2019 and 2021 • Voted Best Companies for Employee Happiness by Comparably in 2023 • Work for a company that values diversity and makes deliberate efforts to create in inclusive workplace • Opportunities for advancement with a company that supports personal and professional growth • Playing a crucial part in the lives of our patients, physicians, and pharmacies by enhancing the patient services experience • Our new state of the art Headquarters building offering many amenities including collaborations spaces, outdoor dining, walking path, marketplace café, and more! Any offer of employment is contingent on completion of a background check to company standard. Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. At PharmaCord, we don’t just accept difference – we celebrate it, support it and we thrive on it for the benefit of our employees, our products and our community. PharmaCord is proud to be an equal opportunity employer. In order to maintain a safe workplace for our team members, PharmaCord strongly recommends that all employees are vaccinated against COVID-19. Want to learn more about us? Find us on LinkedIn, Glassdoor, Twitter & Facebook! Job Type: Full-time Benefits: • 401(k) • 401(k) matching • Dental insurance • Employee assistance program • Flexible spending account • Health insurance • Health savings account • Paid time off • Parental leave • Tuition reimbursement • Vision insurance Schedule: • Monday to Friday Application Question(s): • What is the best email address to reach you? Experience: • healthcare/pharma services: 5 years (Required) Work Location: Remote"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BlVlg5gYhoA4HlL90MNa46P_L691j7AFurTLKi1Ew8GzbogvZMznlDmU5ZxrUXloUeYsPttBioz3piejVpWH3av0r8E6s0uvIuLBJWAiYplAxP4BgPn8WfOoQTcNnCJm3rxHrd_8OwBQ8jemgbLMpFBSyAeGTsIydd8XJYQAfebmou3PVfk1ofsCQ6zB3PIOUL296bCXi9HlDUgvGWuDv3kbH3oO24eX7_EYdO2rplU6kiY9asf3Vy9_ryfXxKkxrM6ZP6T2RSHmoZLEVm4nByaX2oL26YxAcaEGoG1UU9DegMacQsJoDO_kSs_KTkKbtFNfg0uKqtr9G7HGvSLymT1GBnR18z2m8xy12oeOgvCi_B77RWXLqMAqb_yEfeyawwOmJN_d9QFhxPZJQHpWo22A1NX7GPGhFLzk24t03VJvMJ4KK8a5No_bMRM8ctF7ivcmJbvhLHNp6oo3oJHP5m95qz-vPSsGfFuFsUxj_cs8vV9Ww-WWzBNRgelaAiD82SEMhbPQI4QLNY_AhSqNgok81mWJEfly4O4271Q9BLm7u-GX-KIKrOWFrB72mR6B34lE0L9YhkFqqIY8yJz1amdogZHweRmQzK6RgVDGe3xqyZVRDy1grulW4MOVU6Ux2At1vYIY3MDw==&xkcb=SoCR-_M3HKAiBTTOhx0FbzkdCdPP&p=14&fvj=0&vjs=3",
      "title": "Operations Supervisor",
      "company": "QTC Management, Inc.",
      "location": "Philadelphia, PA 19103",
      "salary": "$74,000 - $78,000 a year",
      "description": "Are you an innovative leader who has a passion for empowering and developing high-performing teams? If so we would love to speak to you! \n  QTC is currently seeking an Operations Supervisor to support our Veteran Affairs Operations in Philadelphia, PA. \n  Who is QTC? QTC is the nation’s largest provider of disability and occupational health examination services. We are PASSIONATE about our country’s veterans, UNITED as a team and INSPIRED to make a difference. To provide high-quality, timely, and customer-focused medical examination service solutions, we honor our core values of integrity, innovation, agility, collaboration, inclusion and commitment. We celebrate diverse thinking and welcome contributions from all. \n  What part would you play in this role? As an Operations Supervisor, you will oversee a team of 10-15 Medical Records Specialist for triaging daily VA disability referrals, preparing VA Disability Benefits Questionnaires (DBQs), scheduling veterans and obtaining diagnostics and reports from providers required to process VA disability claims. In this rewarding role, you will: • Manage processes and procedures to ensure timely and quality completion of work according to clients’ contractual obligations. • Oversee the team’s performance in order to achieve the operation goals of timeliness, quality, and customer service. • Coordinate employee onboarding and training, performance assessment, work assignments, salary, and recognition/disciplinary actions. • Analyze and report on a monthly and quarterly basis operational statistic. You must have: • Bachelor’s degree from an accredited college • 5 years total relevant experience; 2 of the 5 years must be supervising or leading teams or projects (preferably in a healthcare setting) • Experience in an operations role within a healthcare setting • Strong leadership skills with the ability to prioritize, delegate, and communicate effectively. Typical Day: • Mon – Fri: 8:30 am – 5:00 pm (EST) • Remote – Highly preferred to Live in Eastern Standard Time Zone Pay and Benefits: $74,000 - $78,000 annually • We offer meaningful and engaging careers to support you and your career goals, all while nurturing a healthy work-life balance, and we are proud to provide an employment package that attracts, develops and retains the best talent: • Competitive compensation and quarterly bonuses • Tuition reimbursement • A 50% company match of your pre- and post-tax contributions up to 6% of your salary, including immediate vesting of company contributions • Generous paid time off (minimum of 14 days/year), as well as 9 paid holidays • Access to flexible benefits, including health and wellness programs, long and short term disability, an employee assistance program, employee referral bonuses, credit union access and flexible spending accounts • An inclusive and ethical work place The QTC Management pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law. Pay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. As a result, we offer meaningful and engaging careers to support you and your career goals, all while nurturing a healthy work-life balance. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here. Commitment to Diversity: This job description supersedes all prior job descriptions and is intended to describe the general content and essential requirements for the position listed above. It is not to be construed as an exhaustive statement of requirements, duties and responsibilities. Management reserves the right to add or change the duties of this position as required at any time. QTC Management Inc. is a VEVRAA Federal contractor and an Equal Opportunity Employer. The company has an ongoing commitment to affirmative action and the creation of a workplace free of discrimination, harassment and retaliation. The company recruits, hires, trains, and promotes individuals in all job titles without regard to race, color, creed, religion, ancestry, national origin, age, sex, sexual orientation, people with disabilities protected under law, and protected veteran status.  \n • 5 year(s): Supervisory or management experience preferably in a heath care setting. • 2 year(s): Project management and medical case management life cycle experience is preferred • Bachelors or better • Medical Assistant • Licensed Vocational Nurse • Licensed Practical Nurse • Written Communication • Verbal Communication • Problem Solving • Organization • MS Office • Medical Terminology • Leadership • Electronic Medical Records • Computer Literacy • Review Medical Reports/Evaluations • Sense of Urgency • Provider Relations • Project Management • Medical Documentation • Medical Scheduling Software • Executing Multiple Tasks • Human Anatomy/Physiology • Leader: Inspires teammates to follow them • Detail Oriented: Capable of carrying out a given task with all details necessary to get the task done well • Team Player: Works well as a member of a group • Innovative: Consistently introduces new ideas and demonstrates original thinking • Dedicated: Devoted to a task or purpose with loyalty or integrity • Self-Starter: Inspired to perform without outside help • Job Security: Inspired to perform well by the knowledge that your job is safe • Growth Opportunities: Inspired to perform well by the chance to take on more responsibility • Goal Completion: Inspired to perform well by the completion of tasks • Ability to Make an Impact: Inspired to perform well by the ability to contribute to the success of a project or the organization Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)"
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AD-4xtc2p1PErP1FrqbdLAnCVBT0xXsZJP4tSI4P9Hd-sq9dPybwN-m_mmVYoVX2sAY0LhMCPnp38RvIhk8Nv130F8nE0GduN1y5mnj8NiEYvRXpuyI53-7hclRfihipl6xAr1xoWDlCX083yCaSWothItMWdZUyYhgkrmhfAZCNzanyXQY53125zXEMYSLMH5rIs_ActYAuEh78Qe6GYHxpML9JxzXMbEMiJZOdd7BTlW3zhf9I57Sfz8Iw7zMCK4rjWA_esMpVstXhDTXDrPHFdUvEn5JIoDYFSS5w9dxFb1YAkbt7dDBnwNahqhSR4055LB32TvncMNLB_uXK7njmASWwwVYYfb5ciYwnLigs6wW--2gNPrBYO86Z92QbiA0GXZG8pZbatUl3GehIOkCEdAza9Giu-pPkIvnHCA_kL5cIcFRmcxoisBCpaDaGDeyJi8v11nKDmnGkiKTka8uwva0On9E7PZNXrMrNZcQS0jl4ENmYTZr8ZctgS_BqXK0un64oFCVCpeXxx9TcMokuinKb6ncix3H77yXtBk3pfTQBfJuepNgXVRFd8JDHo=&xkcb=SoBo-_M3HKAiJcyU4Z0LbzkdCdPP&p=0&fvj=1&vjs=3",
      "title": "Store Employee",
      "company": "Greater Way Marketing",
      "location": "Willow Grove, PA",
      "salary": "$17 - $21 an hour",
      "description": "Are you ready to embark on a career where your contributions truly matter? We are seeking dynamic, motivated, and trainable individuals eager to enter the world of sales. As a Retail Store Employee, you’ll initiate contact with potential clients, uncovering sales prospects through proactive efforts. To thrive in this role, you should be ambitious, goal-oriented, and geared for success in all aspects of life. At Greater Way Marketing, we've discovered that a perfect cultural fit leads to a fantastic, enduring work partnership. Our aim is to make this your most rewarding job opportunity ever! Greater Way Marketing is a top performing marketing and sales company working directly with some of the largest companies in the world representing their brand directly to the consumer. We work to acquire new customers while retaining the existing ones to increase overall revenue across the board. Role responsibilities: • Greet and direct customers • Provide accurate product feature and pricing information • Give knowledgeable answers to customers questions • Conduct price and feature comparisons to facilitate purchasing • Inform customers of discounts and special offers • Coordinate with team to provide exceptional customer service • Meet minimum weekly, monthly, & annual productivity and sales goals • Working closely with management and contributing innovative concepts to enhance sales What we are looking for: • Reliability • Previous work experience in customer service role preferred • Understanding of team work • Excellent communication skills capable of building trusting relationships • Ability to perform in fast paced environments • Schedule flexibility • 18+ required for position • BS in Business or related field a plus What’s in it for you: • Hourly base pay + commission • Paid sales & leadership training • Performance recognition • Diverse business casual team • Group building activities and outings • Exciting incentives • Team orientated environment • Networking conferences and events • Opportunity for career advancement If you think you are the right fit for this position please apply with your resume and/or cover letter for immediate consideration! Job Type: Full-time Pay: $17.00 - $21.00 per hour Benefits: • Dental insurance • Employee discount • Flexible schedule • Health insurance Shift: • 8 hour shift • Day shift Weekly day range: • Monday to Friday • Weekends as needed Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/company/Worldgate-LLC/jobs/Business-Analyst-c7ed58fde0fe1ea4?fccid=e0d635dfc97703f1&vjs=3",
      "title": "Business Analyst (Hybrid)",
      "company": "Worldgate, llc",
      "location": "Worldgate, llc in Philadelphia, PA 19130",
      "salary": "$65,000 - $90,000 a year",
      "description": "Job Summary: The Business Analyst (BA) supports our client's systems project. The BA works with our client’s functional and technical stakeholders to gather business requirements and document processes. The BA will coordinate project stakeholders to effectively implement large-scale organizational, process and system improvements. The BA will report up to project stakeholders using project management tools and desired client reporting structures. The position is located onsite and remote in Philadelphia with a hybrid work option available. Essential Functions / Responsibilities: • Support in the design, configuration, and implementation efforts or the system modules. • Develop Testing Plans, strategies, and test cases • Document and communicate test results • Identify and facilitate issue resolution with functional and technical groups • Conduct business analysis activities by working with functional and technical stakeholders to support the functional systems, data integrations, data validation, data cleansing, testing. • Organize and facilitate stakeholder requirement sessions • Demonstrate the ability to document, define, analyze and translate functional and technical business requirements • Translate business needs into requirements specifications and clearly communicate requirements to both the business and technical stakeholders • Lead in the development and review of requirements documents, use cases, test cases and other functional and technical artifacts • Promote best practices in data analysis and reporting • Capture and document meeting minutes, requirements, work-flows and best practices • Effectively communicate to management and client stakeholders on work products and status • Participate in enterprise-level project teams to identify and implement process and system improvements. • Responsible to understand Worldgate’s values and behaviors (The Worldgate Way) • Ensure that my daily interactions with Worldgate internal and external parties align to Worldgate’s values and behaviors. Key Competencies: • Business Analysis • Problem Solving • Technical Capacity • Team Collaboration Education, Experience and Certifications: • Bachelor's degree (B. A. or B.S.) from four-year college or university • 3+ years of experience as a business analyst • Experience leading and presenting meetings to steakholders Specific Knowledge, Skills & Abilities: • Excellent documentation and writing skills • Experience with data analysis using Microsoft Excel and SQL Database • Experience with implementing large-scale organizational, process and system improvements • Organizational skills, communication skills and strong attention to detail • Knowledge of BI reporting tools • Knowledge of back-end database systems and database languages Worldgate LLC provides equal employment opportunities to all employees and applicants for employment, without regard to race, color, age, creed, religion, sex, sexual orientation, ancestry, national origin, disability, pregnancy, marital status, or gender identity. Job Type: Full-time Pay: $65,000.00 - $90,000.00 per year Benefits: • 401(k) • Dental insurance • Health insurance • Paid time off • Vision insurance Schedule: • 8 hour shift Ability to commute/relocate: • Philadelphia, PA 19130: Reliably commute or planning to relocate before starting work (Required) Application Question(s): • Are you authorized to work in the United States WITHOUT sponsorship? • Are you able to work WITHOUT sponsorship? (Must answer to be considered) Education: • Bachelor's (Required) Experience: • Microsoft Excel: 3 years (Required) • Business analysis: 2 years (Required) • ERP systems: 1 year (Preferred) Work Location: Hybrid remote in Philadelphia, PA 19130"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=98a67af3ebd81260&fccid=36b76cf613fccb72&vjs=3",
      "title": "Business Analyst Contracts IS-REMOTE",
      "company": "Penn Medicine",
      "location": "3600 Civic Center Blvd, Philadelphia, PA 19104",
      "salary": "Not Available",
      "description": "Description \n \n Summary: \n \n • Responsible for working with IS AVPs, ACIOs and directors with vendor negotiations, agreement development, contract validation and other vendor agreement tasks as assigned. This individual will also work closely with Corporate Materials Management, Corporate Finance and the Office of General Counsel (OGC) to ensure IS agreement / negotiations conform with UPHS policies and procedures. Provide written summaries, forward looking multi-year financial modeling and CAF for IS agreements that are assigned. The individual in this job should be able to handle multiple complex projects with variable timelines and work with IS management to prioritize assigned projects. This position is fully remote for the IS-Financial Managment Department.  Responsibilities: \n • Responsible for managing the IS contracting process including engaging with new IS vendors, working with Corporate Materials Management to renew existing IS contracts with better pricing terms, and consolidating contracts for multiple entities within IS. • Works effectively with IS leadership and vendors with regards to pricing, length of contract, annual increase terms, IS service levels and ensuring agreement terms meet IS requirements. • Responsible for maintaining a master list of all contracts that includes but is not limited to vendor name, purpose, cost per contract, renewal dates, appropriate accounting units and responsible parties. • Create agreement summary documents to IS leadership including multi-year financial cost models that summarize UPHS investment commitment and expected savings and/or cost increases for assigned agreements. • Review draft agreements to ensure terms and conditions are compliant with the established Policy and Procedures set by Materials Management, Finance and OGC. • IS liaison with corporate departments; Purchasing, Finance and OGC, as well as serves as an IS contact with outside vendors. • Is well versed in the UPHS signature process and tracks each agreement, quote, order form, CAF, etc. as they proceed through this important phase. • Ensures all agreements and legal documents are stored in PennTract.  Education or Equivalent Experience: \n • Bachelor of Arts or Science (Required) • Business management preferred or Computer Science related field preferred 3+ years Business experience in areas such as consulting, software contracting, finance, etc. • Experience with Clinical Engineering contracts preferred Experience with Clinical Engineering contracts preferred  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
    },
    {
      "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AD8s2zhpU9GARCOVTS56QZbhzNwGdna2GmE7NcLmRtuextKLn4PcauCWlk_TBN-OFzOVxnlsAVJofeH62edohi0cSRyFbO5Q0gDhufMrqvaoUufvXX50ONVxofrdvp5oYG7b1SaFioDLI3V2CzHJmkYtzlqGtcSvHD-8Hc60jm3ywG8u6Hz0xBXCd7I5wUIP9HymsUJ75qp20APqA6gdKCVfIU5AIJb2yJEKK4qIPyWee9VKjVol0RFdzTIGkupj_tLzGpsawFcsjEHrL_2OZVEYWEvkrJzaEf3xnF7a1KRzMfZX4Tem69TN8tIwGvlr5tis8Q8XwS975E5Uw2wkQCbZ7EYt04G4yKZCpyFTp_vN_f98ka_bE26hnv_2Iiyzs_sxMcGmF2W52xcGs4HRW1BZU9_NLSRyLWWbECx2JEn7LFiYQM6tIiGqdSIH6J4nEAJLbsLPg8vIkoy-PJqe8ybltyKvvz0i1Fmg9vBS5wdtjbnmzZNFRdyvwF8tLarkpxrkMDKossq8uNXHC8m9xqnl-qvf5uKkrZrOxTsiXMyHiPoSJ5dxWXbUlBryScqWP-xCZSohP-WGIViRm7DlxkSoQMW5C077R2Rs8V9PJ6AcNKyr1Rw7go&xkcb=SoD1-_M3HKAiJcyU4Z0IbzkdCdPP&p=3&fvj=1&vjs=3",
      "title": "Corporate Director of Case Management",
      "company": "Recovery Centers of America",
      "location": "2201 Renaissance Blvd, King of Prussia, PA 19406",
      "salary": "Not Available",
      "description": "Position Overview: Our commitment is to deliver excellence and an empathetic human experience to every patient, every family member, every employee, every time. The Corporate Director of Case Management develops the strategy and is responsible for execution of RCA Case Management program across the enterprise. They are a subject matter expert in all aspects of case management, providing direct onsite support and change management. Facility onsite support includes data analysis, facility gap assessments, and action plan development to achieve established goals. Oversees the facilitation of care coordination of the patient and family through the management of quality clinical service delivery. Directs facility case management regarding care coordination/case management and care transition ensuring partnership with external customers, referral sources and payors to ensure the facilitation and coordination of the discharge planning process and serves as the patient and family advocate. The Director of Care Management ensures that the facilities are in compliance with RCA standards, policies, and regulatory requirements. They must possess excellent communication skills, proven motivational capabilities. Must have an executive presence and a demonstrated record of accomplishment for delivering results and attaining goals. Collaborates closely with facility leadership including CEO, Care Coordinator Supervisor, Clinical Director, Admissions Director, and Utilization Review leadership. Responsible to improve the Key Performance Indicator of patient Progressions. Education and Experience: • Graduate of an accredited program required: • RN or BSN preferred; or Master of Social Work with licensure as required by state regulations; or master’s degree in healthcare administration, business administration, or clinical specialty. • Healthcare professional licensure required as Registered Nurse, Licensed Clinical Social Worker (LCSW), or Licensed Social Worker (LSW), as required by state. • Certification in Case Management preferred. • 5+ years’ experience in Case Management Leadership, preferably within a large multi-hospital system • Knowledge of payer requirements and discharge planning regulations that support the effect development of departmental policies, procedures, and standards. Job Type: Full-time Work Location: Hybrid remote in King of Prussia, PA 19406"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=245fe0f3cc275394&fccid=7821a2e77aac6277&vjs=3",
      "title": "Business Analyst",
      "company": "Exelon Corporation",
      "location": "2301 Market Street, Philadelphia, PA 19103",
      "salary": "Not Available",
      "description": "Description \n \n \n \n \n \n \n \n \n \n Perform general analysis and prepare reports to support business operations. Conduct modeling, forecasting, trending, variance analysis, business case development, and other general financial and operational analysis. Monitor and coordinate activities to support operational performance management (e.g., safety, reliability, service level, productivity, etc.). Research and provide statistical financial and operational information. Track, maintain, analyze and provide current information on the operation's business scorecard or key performance indicators (KPIs). Develop and organize performance reports for both internal and external use. Contribute to the development of shortterm and long-range business planning. Provide analytical and operational support to the business unit. Position may be required to work extended hours for coverage during storms or other energy delivery emergencies. \n \n • Support and contribute to the development of short-term and long-range business planning. Conduct modeling, forecasting, trending, variance analysis, business case development, and other financial and operational analysis (e.g., operational effectiveness, budget, resource, workload, workforce and capacity utilization, competitor, etc.). • Provide statistical information to ensure the most effective utilization of personnel, equipment and/or materials for business operations. • Monitor and coordinate activities to support operational performance management (e.g., safety, reliability, service level, productivity, etc.). • Track, maintain, analyze and provide current information on the operation's business scorecard or key performance indicators (KPIs). • Perform analysis of the operation's cost elements to ensure effective and efficient operations. • Prepare and analyze detailed standard and non-standard reports. • Develop, organize and present detailed performance reports for both internal and external use. • Provide analytical and operational support to the business unit. \n • This is an individual contributor position that works under general supervision and frequently performs non-routine work. This position is expected to resolve most questions and problems through interaction with internal and/or external stakeholders, executives, directors, managers, and staff across the organization, and refers only the most complex issues to higher levels. On occasion, may mentor less experienced colleagues. • May require working extended hours and/or shift work to support business operations. Qualifications MINIMUM QUALIFICATIONS • Bachelor's degree in Business or Engineering AND 2 - 4 years related business experience, or in lieu of Bachelor's degree, a minimum of 3 - 6 years relevant business experience is required. • General understanding of applicable standards, methods, processes and practices, business fundamentals, and performance metrics in the specific functional area supported by this position (e.g., asset management, electric or gas operations, customer service, transmission and substation, distribution system operations, regulatory and external affairs, transmission operations and planning). • General proficiency in standard software applications (e.g., Microsoft Word, Excel, Access, PowerPoint, Project), specialized business technologies and applications (e.g., workforce management, project management, PassPort, Brio, CIS, EPS, Business Objects, SAP planning, business modeling, forecasting, voice response unit, automatic call distributors, work management, outage management) to retrieve and analyze data in support of business needs. • Ability to provide general analysis and apply managerial accounting concepts, customer intelligence gathering, forecasting, staff planning, scheduling, analytical and statistical problem solving, financial, accounting, business and budget analysis. General analytical skills for project evaluation including analysis of projects with economic, financial, risk and decision analysis. • General analytical skills for project evaluation including analysis of projects with economic, financial, risk and decision analysis. Experience in business case development and ability to effectively present business cases to business unit leadership. • Customer driven with good oral and written communications skills and general analytical, problem solving and project management skills. • General knowledge of the practices, procedures and principles of performance analysis (trending, root cause and gap analysis) benchmarking and audit compliance. Ability to analyze organizational data and problems, interpret and recommend alternative courses of action, and implement intervention strategies to attain performance targets. PREFERRED QUALIFICATIONS \n • Experience in the practices, procedures and principles of performance analysis (trending, root cause and gap analysis) benchmarking and audit compliance. Ability to analyze organizational data and problems, interpret and recommend alternative courses of action, and implement intervention strategies to attain performance targets. • Responsible for the prioritization, scheduling, and coordination of project task and project resources • Proficiency in standard software applications (e.g., Microsoft Word, Excel, Access, PowerPoint, Project), specialized business technologies and applications (e.g., , project management, WPT, Asset Suite 8, , CIS, EPS, , forecasting, ) to retrieve and analyze data in support of business needs • Strong organizational, interpersonal and verbal and written communication skills • Ability to adapt to new or changing conditions"
    },
    {
      "url": "https://www.indeed.com/company/SEAMAAC,-Inc/jobs/Business-Manager-4ebb3c93d7203c1a?fccid=99119ac6975b5a50&vjs=3",
      "title": "Business Manager",
      "company": "SEAMAAC, Inc/South Philly East Health and Wellness",
      "location": "1902 S 8th St, Philadelphia, PA 19148",
      "salary": "$80,000 a year",
      "description": "General Description: South Philly East Health and Wellness (SoPhiE) welcomes applicants for the position of Business Manager. The Business Manager will be responsible for overseeing the operations of the Hansjörg Wyss Wellness Center. SoPhiE’s mission is to provide high quality, whole-body care for immigrants, refugees, and the general South Philadelphia community and serves patients who are insured and uninsured regardless of ability to pay. The Wyss Wellness Center opened in 2021 through a collaboration between SoPhiE, SEAMAAC, and Jefferson Health’s Department of Family and Community Medicine (DFCM). Providers from Jefferson’s DFCM offer primary care services at the Wyss Center, while SEAMAAC’s Health and Human Services staff provide social services, community education, and wellness groups. SoPhiE will be applying for Federally Qualified Health Center Look-Alike status for the Wyss Wellness Center in early 2024. Position Summary The Business Manager is a full-time, exempt employee reporting to SoPhiE’s Executive Director. The Business Manager will be responsible for overseeing internal systems and ensuring the day-to-day business and operation functions of SoPhiE and the Wyss Center run effectively and efficiently. The Business Manager will also be involved in strategic planning and supporting SoPhiE and the Wyss Center’s future growth. Location: This position is based at the Wyss Wellness Center in South Philadelphia. This is an office-based position with flexibility for some remote work. Essential Responsibilities Operations · Assure health center is open and appropriately staffed during regularly scheduled hours · Oversee front desk operations including scheduling and patient check-in/out · Supervise Patient Services Associate · Manage consultants to identify, implement, and maintain updated technology systems and infrastructure · Recognize and anticipate operational opportunities and challenges, generating solutions for improvement · Update and maintain organizational policies and procedures · Monitor and manage supply inventories · Oversee the Wyss Center’s physical infrastructure · Coordinate equipment maintenance · Provide operational support to new projects and initiatives Accounting · Perform basic bookkeeping activities and financial functions (AP, AR, journal entries) in conjunction with outsourced CFO · Assist with month-end and year-end account activities and the development of an annual operating budget Revenue Cycle · Oversee operations for revenue cycle management, sliding fee scale program, and front-end billing · Work with external EHR/Practice Management vendor to manage revenue cycle processes · Help manage third party insurance payer contracts · Track and analyze data including staffing levels, patient encounters, and provider productivity · Assist uninsured patients in addressing billing issues Qualifications/Competencies · Bachelor’s degree or higher in accounting, finance, business, health care management or related field · 3-5 years of operations and/or finance experience, preferably in a health care setting · Knowledge of information technology · Familiarity with medical health insurance, billing systems, medical coding, and basic medical terminology preferred · Detailed oriented, systems thinker with strong organizational skills · Ability to connect and work with people from a wide array of backgrounds and identities · Commitment to working with medically underserved communities · Proficiency in Microsoft Office products, particularly Excel Hours: Primarily normal business hours (9am – 5pm), with occasional evening and weekend assignments Salary & Benefits: $80,000. Paid health and dental insurance, vacation leave, holidays, sick leave and personal leave. Job Type: Full-time Pay: $80,000.00 per year Benefits: • Dental insurance • Health insurance • Paid time off • Parental leave • Vision insurance Schedule: • 8 hour shift • Monday to Friday • Weekends as needed Education: • Bachelor's (Required) Experience: • Operations: 3 years (Required) • Healthcare management: 1 year (Required) Work Location: Hybrid remote in Philadelphia, PA 19148"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=c08bc0adb0668f39&fccid=36b76cf613fccb72&vjs=3",
      "title": "Project Coordinator",
      "company": "Penn Medicine",
      "location": "3600 Civic Center Blvd, Philadelphia, PA 19104",
      "salary": "Not Available",
      "description": "Description \n \n Entity: CPUP \n Department: CPUP AED Nursing \n Location: 3600 Civic Center Blvd Hours: Per Departmental Needs, Full Time Summary: The Project Coordinator provides support and execution of critical initiatives for identified key priorities. The role requires execution of tasks in alignment with strategies as outlined by clinical leadership. Project work includes clinical initiatives, project support, calendar support/scheduling, meeting support, scheduling agenda/ minutes, project support creating presentations and data pull, recognition, and awards program support. Accountabilities:  • Supports leadership in the department in specialized projects including clinical initiatives, patient experience, program optimization and creation of dashboards and data gathering. • Supports leadership in the department in specialized projects including facility build out, patient experience, program optimization and creation of dashboards and data gathering. • Produce accurate reports that are thoroughly checked and validated. • Creates and maintains meeting agendas and minutes using Microsoft Teams. • Assist with recognitions and award programs i.e., scheduling of events, ordering of materials and catering. • Create department Newsletter in collaboration with AED and Clinical Directors. • Manage content on Ambulatory Resource site, including updating clinical distribution lists, master phone list, and assist Directors with private folders and uploading documents. • Other duties as assigned.  Education or Equivalent Experience:  • High School Diploma required. • Bachelor’s Degree in Business, Health Care, or equivalent field is preferred. • 3-5+ years knowledge of health care facilities and/or operations is preferred.  Skills & Abilities: \n  • Demonstrated organizational skills. • Ability to multi-task. • Strong analytical and computing skills to resolve complex technical and administrative problems. • Strong organization skills are required. • Strong oral and written communication skills and presentation skills necessary to interact diplomatically with diverse groups of people, exchange information and produce written correspondence. • Demonstrated interpersonal/verbal communication skills. • Demonstrated written communication skills. • Demonstrated analytical skills. • Ability to work independently. • Ability to use Microsoft Office (Excel, Power Point, Word). • Demonstrated time management and priority setting skills.  \n \n  We are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law."
    },
    {
      "url": "https://www.indeed.com/company/Saint-Martha's-Healthcare/jobs/Office-Coordinator-123249d7169dee9b?fccid=dde176ea5ef6f4d5&vjs=3",
      "title": "Business Office Medicaid Coordinator",
      "company": "St Francis Center for Rehabilitation & Healthcare",
      "location": "1412 Lansdowne Ave, Darby, PA 19023",
      "salary": "$60,000 - $80,000 a year",
      "description": "Full time Business Office Medicaid Coordinator to work at a Nursing Home facility in Darby PA. This position is to work as a team alongside the Medicaid Supervisor in the facility and assist with Medicaid Application, Medicaid Recertifications, Meetings and Collecting Documentation. Job duties include • Working with clients and families to obtain information and documentation to apply for public benefits • Communicating with social security office, accounts receivable, and collections. Salary commensurate with experience. Job Type: Full-time Pay: $60,000.00 - $80,000.00 per year Benefits: • 401(k) • Dental insurance • Employee assistance program • Health insurance • Life insurance • Paid time off • Vision insurance Schedule: • 8 hour shift • Monday to Friday Ability to commute/relocate: • Darby, PA 19023: Reliably commute or planning to relocate before starting work (Required) Experience: • medicaid coordinator: 1 year (Preferred) Work Location: In person"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=2402dcbd454992a9&fccid=4f38d655a8b3e9dc&vjs=3",
      "title": "Project Manager",
      "company": "Seer Interactive",
      "location": "Philadelphia, PA",
      "salary": "$65,000 - $80,000 a year",
      "description": "• $65,000-$80,000 annually • Evaluation of comp at least once a year • Profit Sharing • Benefits that support your whole self • Recharge week: 1 week PTO before starting • Unlimited PTO with a 3 week minimum/year requirement and Flexible Fridays • Reduced Holiday Hours from Christmas through New Year’s for the whole team to unplug and recharge • 13 paid company holidays, including Employee Appreciation Days & Mental Health Days • 100% paid parental leave to support your growing family with phased return • Elected Medical, Dental & Vision benefits effective your first day with employer funded employee premiums, HRA and Dental • If you enroll in our medical plan, a medical HRA to support your individual / family deductible • All Access HRA annual allowance to support your health & wellness • Annual Kaizen budget for your professional development • Company funded Mental Health support via Ginger • 401k at 1 year, 100% vested with a generous match and company funded financial advisor available day 1 • Flexible working schedule with core business hours in your time zone • Joining us 100% remotely? You’ll receive a $400 Remote Office setup stipend to set up your workspace • You’ll be the primary point of contact for all new client requests on some of our highest priority accounts, working with our internal team to align on priorities and timing • You will manage an integrated project plan, working with all service lines • You’ll plan and monitor resource utilization on the account, forecast workload, and bandwidth to proactively manage project budget, and allocate resources • You’ll track hours and costs to keep projects within budget, proactively raising red flags to finance and escalating to management as needed • You will manage and delegate tasks across team members as needed via our PM tool, monday.com, and/or a separate client-preferred project management tool • You will lead ongoing process improvements for driving greater efficiency across the company, supporting internal initiatives and operations. • You have an innate talent for project management, who has experience wrangling team members, vendors, and Client stakeholders, in order to rally around a project plan and meet deadlines according to your client’s goals • Your approach to PM is proactive and you take anticipatory actions, demonstrating an ability to independently navigate tasks without needing explicit directions • You’ve managed projects with internal cross-functional teams of 8-10+ people • You have a working knowledge of digital marketing, including SEO, Paid Media, Data Analytics, and UX • You’re a champion of process and ongoing improvements, educating the team on project management best practices while keeping your eyes/ears open for new opportunities to drive workflow efficiency • You know how to best forecast team bandwidth for upcoming projects and are quick to find workarounds for surprise roadblocks; your strong communication, organization, and time management skills are unmatched, and your team loves you for them! • You have experience interfacing directly with client POCs of all levels and can adapt your communication style and approach accordingly"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=3411cc1807559859&fccid=efd76c98bd20bd43&vjs=3",
      "title": "Financial Analyst I (Jr)",
      "company": "Vectrus",
      "location": "Philadelphia, PA",
      "salary": "Not Available",
      "description": "• Junior Financial Analyst to provide financial support to NAVAIR’s PMA265 Kuwait F-18 and METCAL office. Due to the Foreign Military Sales (FMS) environment, US citizenship is required and no foreign nationals living with the candidate • Answering requests from the NAVAIR customer and Team lead • Retrieving system queries from MISIL, DIFS, and Information Warehouse and reviewing data to prepare adjustment packages • Reviewing hard copy documents and posting financial information into CRT • Preparing ad-hoc reports • Bachelor’s Degree or Qualifying Experience • Qualifying Experience: 4 years of experience is required to offset a degree in any financial field • Must be proficient in MS Office suite or other word processing and spreadsheet programs. • Foreign Military Sales (FMS) experience is a plus • MS Office (Word, Excel, PowerPoint, Access)"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=400fc831efc71610&fccid=d7114f1cac8d0711&vjs=3",
      "title": "Contact Center Rep III, Small Business Banking-Mt. Laurel, NJ PM",
      "company": "TD Bank",
      "location": "6000 Atrium Way, Mount Laurel, NJ 08054",
      "salary": "$22.00 - $32.50 an hour",
      "description": "Job Category - Primary Work Location Employment Type City Time Type State Hours Pay Range Department Overview The Contact Center Representative III (US) performs a broad range of Customer service transactions, may provide information and/or advice on services, products, and/or solutions to existing or prospective TD Customers. This role contributes to the growth of the business by developing and deepening new and existing relationships. This role is required to understand Customer needs and identify opportunities to promote products, services, and/or refer them to the appropriate team member or internal Bank partner, while ensuring a Legendary Customer Experience. Job Details • Meets compliance requirements of the role • Assumes responsibility to minimize risk by complying with all TDBG and Industry Codes of Conduct • Creates a Legendary Customer Experience with every client interaction and contribute to the ongoing improvement of the overall Customer experience by ensuring advice, service, and inquiries and/or issues are managed promptly and effectively under all conditions • Identifies Customer needs and determine solutions to Customer problems • Uses ability to discover and advise on meeting and exceeding Customer needs by asking curious questions • Offers comprehensive product knowledge and/or guidance as it relates to the Colleague's respective business area • Ensures Customer/partner problems are handled appropriately the first time, escalating issues when necessary • May identify cross-sell opportunities and/or refer Customers/partners to internal Bank partners • Expected to meet the needs of Customers by offering advice and guidance based on the Customer's total financial situation and possessing a thorough knowledge of customer life cycle needs • Identifies cross-sell opportunities and/or refer Customers to internal Bank partners • Completes a broad range of financial transactions (e.g., withdrawals, bill payments, and/or other transactions, as necessary) in an accurate and efficient manner • Identifies Customer needs and determine solutions to Customer problems, particularly as it relates to digital banking products and services • Gathers and analyzes data to identify and to help solve complex problems • Evaluates and communicates unusual and/or complex content in a clear manner; handles sensitive information and escalated matters as necessary • Uses sound judgement and understanding of process/policy risk when recommending exceptions outside general practices or guidelines • Impacts their own team and other teams whose work activities are closely related Job Requirements • High School diploma or GED • 2+ years of related experience • Successfully complete contact center training • Cross-trained on multiple contact center specialty skill sets preferred • Thorough understanding of all aspects of Contact Center Representative positions, with the ability to meet goals and standards established by the department • Demonstrated sales and service ability including knowledge of Company products and services • Ability to use/learn current technology and software applications related to position • High degree of judgment throughout each stage of the engagement process along with exceptional communication skills both written and verbal • Extensive knowledge of the organization in order to action and resolve a wide range of escalating situations in a timely manner • Ability to multitask in a fast-paced, dynamic work environment • Ability to work effectively within a close team environment • Highly flexible and able to adapt to quickly changing priorities • Positive approach with a focus on the Customer experience • Self-starter with ability to work both independently and collaboratively Physical Requirements: \n Never: 0%; Occasional: 1-33%; Frequent: 34-66%; Continuous: 67-100% • Domestic Travel – Occasional • International Travel – Never • Performing sedentary work – Continuous • Performing multiple tasks – Continuous • Operating standard office equipment - Continuous • Responding quickly to sounds – Occasional • Sitting – Continuous • Standing – Occasional • Walking – Occasional • Moving safely in confined spaces – Occasional • Lifting/Carrying (under 25 lbs.) – Occasional • Lifting/Carrying (over 25 lbs.) – Never • Squatting – Occasional • Bending – Occasional • Kneeling – Never • Crawling – Never • Climbing – Never • Reaching overhead – Never • Reaching forward – Occasional • Pushing – Never • Pulling – Never • Twisting – Never • Concentrating for long periods of time – Continuous • Applying common sense to deal with problems involving standardized situations – Continuous • Reading, writing and comprehending instructions – Continuous • Adding, subtracting, multiplying and dividing – Continuous  The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required. The listed or specified responsibilities & duties are considered essential functions for ADA purposes. \n Company Overview \n \n \n \n \n \n \n \n \n \n \n \n \n Inclusiveness \n \n \n \n \n \n \n \n \n \n \n Business Line Country State (Primary) City (Primary) Job Expires"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=4c18cb5964694f6d&fccid=44cccfbc6f3429d5&vjs=3",
      "title": "IT Business Analyst",
      "company": "City of Philadelphia",
      "location": "1234 Market Street, Philadelphia, PA 19107",
      "salary": "Not Available",
      "description": "A best-in-class city that attracts best-in-class talent, Philadelphia is an incredible place to build a career. From our thriving arts scene and rich history to our culture of passion and grit, there are countless reasons to love living and working here. With a workforce of over 30,000 people, and more than 1,000 different job categories, the City of Philadelphia offers boundless opportunities to make an impact. \n As an employer, the City of Philadelphia values inclusion, integrity, innovation, empowerment, and hard work above all else. We offer a vibrant work environment, comprehensive health care and benefits, and the experience you need to grow and excel. If you’re interested in working with a passionate team of people who care about the future of Philadelphia, start here. What We Offer: Impact - The work you do here matters to millions. Growth - Philadelphia is growing, why not grow with it? Diversity & Inclusion - Find a career in a place where everyone belongs Benefits - We care about your well being The Office of Innovation & Technology (OIT) is the central IT agency for the City of Philadelphia headed by the Chief Information Officer (CIO). OIT oversees all major information and communications technology initiatives for the City of Philadelphia - increasing the effectiveness of the information technology infrastructure, where the services provided are advanced, optimized, and responsive to the needs of the City of Philadelphia’s businesses, residents, and visitors. OIT responsibilities include: identifying the most effective approach for implementing new information technology directions throughout city government; improving the value of the city’s technology assets and the return on the city’s technology investments; ensuring data security continuity; planning for continuing operations in the event of disruption of information technology or communications services; and supporting accountable, efficient and effective government across every city department, board, commission and agency. \n The Business Analyst reports to the Enterprise & Governance PMO Operations Manager. This role is responsible for guiding the success of the technology and services related to various business processes that align with the City’s technological strategic priorities and future-state agile, digital city experience. Working with cross-functional technology teams and business process stakeholders, they will oversee technology related business process initiatives from requirements through implementation, assessment, testing, and continuous enhancement. In this role, the Business Analyst will be the ‘voice of the customer,’ focusing on needs, expectations, understandings, and desires of the OIT and business process stakeholders to improve processes and increase satisfaction.\nAs a member of the Enterprise and Governance PMO, the Business Analyst is expected to uphold the organization’s mission and contribute positively to a collaborative, human-centered, innovative, accountable, transparent, and inclusive culture within the Enterprise and Governance PMO. \n \n \n \n • Advocate for the value of various business processes and encourage their use. • Lead requirements gathering (including interviewing users, analyzing work processes and operations, establishing solution objectives, and evaluating systems functionality) to uncover insights about various business processes and opportunities to improve existing services and explore new ones. • Work closely with development and support teams during business process related projects, including writing use cases and assisting in prioritization of features and functionality for systems. • Contribute to the planning for new or enhanced IT services or service bundles based on partner input and knowledge of OIT policies and standards. • Research, investigate, and promote the use of existing and emerging technologies to support or enhance IT operations and/or work. • Perform initial testing of enhancements and provide feedback to developers as needed. Coordinate with subject matter experts on second level testing. • Keen ability to determine when to apply Project Management principles. • Contribute to Project and Portfolio Management. • Ask smart questions, take risks, and champion new ideas. \n • Build and maintain collaborative and consultative relationships with customers and central OIT areas related to specific business processes being managed and serve as primary point of contact for IT coordination of services, communication, and planning around those business processes. • Gain an in-depth understanding of OIT’s processes and requirements. • Conduct regular reviews, priority-setting, and planning sessions with customers and other stakeholders. Serve as an advocate for those priorities, plans, and other technology needs within customer departments and OIT. • Monitor, evaluate, and regularly report to Enterprise & Governance PMO leadership on business process-related IT projects, services, and support; the delivery of services according to service level agreements; and levels of client satisfaction. \n \n • Demonstrated ability to think strategically about the application of technology to solve business problems and develop user/business-driven technology strategies and plans. • Ability to work with end users to understand and analyze business processes, define requirements, and assess technologies to determine fit for client needs; and with technical staff to translate those requirements into appropriate technical specifications. • Exceptional communication skills, with the ability to communicate technical concepts and information to non-technical audiences in a compelling and empowering way. • Deep commitment to developing and delivering modern, user-centered, and value-producing technology products, systems, and services in a collaborative way. • Ability to build effective relationships and strong commitment to working collegially and collaboratively with constituents at all levels in a diverse and distributed environment. \n We care more about what you can do than where you learned how to do it. That said, a bachelor’s degree is a good foundation for the work, and job-related experience around the competencies above is acceptable as well. The ideal candidate will have at least three years of experience with business analysis as well as working on and/or leading project teams. \n \n Salary Not to Exceed: $75,000 \n Starting salary to be determined based on experience and qualifications. Important: To apply, candidates must provide a cover letter and a resume. Did you know? • We are a Public Service Loan Forgiveness Program qualified employer • 25% tuition discount program for City employees (and sometimes spouses and dependents as well) in partnership with area colleges and universities • We offer Comprehensive health coverage for employees and their eligible dependents • Our wellness program offers eligibility into the discounted medical plan • Employees receive paid vacation, sick leave, and holidays • Generous retirement savings options are available • The successful candidate must be a city of Philadelphia resident within six months of hire The City of Philadelphia is an Equal Opportunity employer and does not permit discrimination based on race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, source of income, familial status, genetic information or domestic or sexual violence victim status. If you believe you were discriminated against, call the Philadelphia Commission on Human Relations at 215-686-4670 or send an email to faqpchr @phila.gov. For more information, go to: Human Relations Website: http://www.phila.gov/humanrelations/Pages/default.aspx"
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=2bbe76fb0b1ee83e&fccid=fe0933928b3bb3ad&vjs=3",
      "title": "Project Coordinator",
      "company": "Catalent",
      "location": "Philadelphia, PA 19154",
      "salary": "Not Available",
      "description": "Catalent Pharma Solutions in Philadelphia, PA is hiring a Project Coordinator in the Project Management department. This person must be familiar with applicable GMP. This individual will support Project Management teams in the management and successful delivery of assigned Projects. Will be the Catalent Advocate and Client Advocate. They will be responsible for communicating e-mail and potentially other forms of client communication (i.e. via teleconference). Will promote continuous improvement in all aspects of the job. Will focus on professionalism and Customer Service Excellence when working with all internal and external clients. Will display a reasonable degree of independent judgment and analyses to complete the responsibilities of this position.  This is a full-time role: Monday – Friday, days. This is a hybrid role.  Catalent is a global, high-growth, public company and a leading partner for the pharmaceutical industry in the development and manufacturing of new treatments for patients worldwide. Your talents, ideas, and passion are essential to our mission: to help people live better, healthier lives.  This 206,878 square-foot facility, located in the Philadelphia area is Catalent’s global Center of Excellence for Clinical Supply Packaging. Catalent offers GMP secondary packaging and clinical labeling services throughout our global network. Packaging can be configured to hold a single product or multiple products as determined by study requirements. We offer manual patient kit assembly along with semi-automated and automated wallet sealing and high-speed automated carding to meet the needs of studies of all sizes. For temperature sensitive products and those with minimal to zero allowable time out of environment, we can perform secondary packaging in refrigerated and frozen packaging rooms or over dry ice depending upon your project needs. Using our Clinicopia global labeling system with its multi-lingual label phrase library we can design single panel, booklet labels or our unique Peel-ID™ safe storage labels for your studies. Single panel and Peel-ID™ safe storage labels can be conveniently reviewed and approved online via our Fusion portal before being printed and inspected at our facilities.  Catalent is committed to a Patient First culture through excellence in quality and compliance, and to the safety of every patient, consumer, and Catalent employee.  The Role • Under direction from project management team co-ordinate projects from award stage to completion ensuring correct planning timelines are generated, monitored and tracked to ensure successful adherence and completion • Attend and produce minutes and actions for internal client meetings/teleconferences/client visits and Audits to support project management team and understand full scope requirements to generate all required project documentation • Receive, monitor and manage client supplied label text/Randomizations, drug, components and materials and ensure delivery to internal functions as required • Generate required documentation and liaise with depot group for 3rd party depot set up • Manage inventory reporting and monitor and track client inventory in line with project requirements • Collect KPI data and supply to Project Management team • May be requested to perform any role/level within the CSE team if trained to do so  The Candidate • Educated to a high level, typically Bachelor degree level (or equivalent) in a related field or good educational standard with relevant practical experience preferred • 1 to 2 years’ experience in a customer service or appropriate business-related area preferred • Professional Project Management Qualification preferred • Individual may be required to sit, stand, walk regularly and occasionally lift 0-15 pounds  Why you should join Catalent: • Defined career path and annual performance review and feedback process • Diverse, inclusive culture • 152 hours of PTO + 8 paid holidays • Several Employee Resource Groups focusing on D&I • Dynamic, fast-paced work environment • Employee Stock Purchase Program • Positive working environment focusing on continually improving processes to remain innovative • Potential for career growth on an expanding team within an organization dedicated to preserving and bettering lives • Competitive salary with possible bonus potential • Community engagement and green initiatives • Generous 401K match and Paid Time Off accrual • Medical, dental and vision benefits effective day one of employment • Tuition Reimbursement – Let us help you finish your degree or earn a new one! • GymPass program to promote overall physical wellness • Perkspot - offers exclusive or private discounts from approximately 900+ merchants in a wide array of categories  Catalent offers rewarding opportunities to further your career! Join the global drug development and delivery leader and help us bring over 7,000 life-saving and life-enhancing products to patients around the world. Catalent is an exciting and growing international company where employees work directly with pharma, biopharma and consumer health companies of all sizes to advance new medicines from early development to clinical trials and to the market. Catalent produces more than 70 billion doses per year, and each one will be used by someone who is counting on us. Join us in making a difference. Catalent is committed to the health and safety of its employees, visitors and the customers and patients we serve. As a result of the global pandemic, we have modified many of our recruitment and on-boarding processes to maintain everyone’s safety. The Human Resources teams will communicate all necessary safety processes and procedures throughout each stage.  personal initiative. dynamic pace. meaningful work. \n Visit Catalent Careers to explore career opportunities.  Catalent is an Equal Opportunity Employer, including disability and veterans.  If you require reasonable accommodation for any part of the application or hiring process due to a disability, you may submit your request by sending an email, and confirming your request for an accommodation and include the job number, title and location to DisabilityAccommodations@catalent.com. This option is reserved for individuals who require accommodation due to a disability. Information received will be processed by a U.S. Catalent employee and then routed to a local recruiter who will provide assistance to ensure appropriate consideration in the application or hiring process.  Notice to Agency and Search Firm Representatives: Catalent Pharma Solutions (Catalent) is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Catalent employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Catalent. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you. \n  Important Security Notice to U.S. Job Seekers: Catalent NEVER asks candidates to provide any type of payment, bank details, photocopies of identification, social security number or other highly sensitive personal information during the offer process, and we NEVER do so via email or social media. If you receive any such request, DO NOT respond— it is a fraudulent request. Please forward such requests to spam@catalent.com for us to investigate with local authorities.  California Job Seekers can find our California Job Applicant Notice HERE."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=67773ee76eaa3be2&fccid=105cc25c3f5819cd&vjs=3",
      "title": "Data Analyst",
      "company": "Temple University",
      "location": "Philadelphia, PA",
      "salary": "Not Available",
      "description": "Grade: T25 The link below will give you information about the University’s “T” salary structure. Learn more about the “T” salary structure. A variety of important factors are reviewed by HR when considering salary, including job duties, the applicant’s education and experience, all relevant internal equity considerations, department budget, and funding source. As a key member of the PCORI Team, the Data Analyst analyzes data to determine met and unmet outcomes; identifies relevant trends and convey feedback to front-line providers as part of the PCORI Health System Implementation Initiative (HSII) which was created to build project capacity. The Analyst administers real-time maintenance of the data infrastructure and tools to ensure uninterrupted services mapping our relevant key performance indicators directly from Temple Health and Temple University data. The primary focus of the Analysis encompasses the collection, analysis, and interpretation of diverse data that will best optimize implementation strategies and approaches for capacity-building services. The analyst also creates dashboards for front-end users in Microsoft Power BI for data visualization. \n • Gather raw data from various internal and external sources to provide a foundation for analysis. • Liaise with team members to ensure accurate data collection and storage. • Identify, correct, or remove any corrupted, incomplete, or inaccurately entered data. • Standardize data formats across different datasets. • Conduct basic statistical analyses to understand data trends and patterns. • Use statistical tools and software to interpret data sets, paying particular attention to trends and patterns that could be valuable for diagnostic and predictive analytics efforts. • Design and create data visualizations using tools like Tableau, Power BI, or Excel to effectively represent data in charts, graphs, and dashboards. • Work with team members to determine the most effective ways to visually represent data insights. • Modify and adjust visualizations based on feedback and requirements. • Assist in creating regular reports based on collected and analyzed data. • Provide support in the interpretation of data reports and visualizations for non-technical team members. • Work closely with other departments (like marketing, finance, or operations) to support new Temple Health projects. • Participate in team meetings, sharing insights, and findings from data analyses. • Ensure databases are accessible, consistent, and secure. Assist in the maintenance of databases, ensuring that data storage practices are efficient and adhere to best practices. \n • Monitor analytics and metrics results for consistent accuracy. Implement data quality checks and practices to ensure data integrity. • Address any issues or discrepancies in data results by troubleshooting and collaborating with relevant teams. • Recommend solutions to data-related challenges. • Clearly communicate findings and insights to both technical and non-technical stakeholders. Present data-driven recommendations. Employment at Temple University means much more than a competitive salary. Temple strives to maintain a culture of diversity and inclusivity and provide employees with opportunities for growth and advancement. You will enjoy a collaborative working environment that values innovation and creativity. Our health and wellness benefits are among the best in the region, and our retirement savings plans allow you to plan for the future. Temple University offers many opportunities for employees to enhance skills, gain new perspectives and grow professionally. For example, you can earn your bachelor's degree or an advanced degree through our tuition remission benefit or develop your management and leadership skills in one of our HR Learning and Development's academies. Temple University employees also enjoy recreational, entertainment, and cultural activities both on campus and throughout the Philadelphia region. Click here to learn more about the benefits of working at Temple University. Required Education & Experience:\nBachelor's degree in data management, information systems, or a related field and at least one year of directly related data management experience. An equivalent combination of education and experience may be considered. \n \n • Proficiency in database management software and tools. • Knowledge of SQL, Python, Tableau or Power BI • Strong analytical skills with the ability to collect, organize, analyze, and disseminate information with attention to detail and accuracy. • Demonstrated computer skills, and proficiency with Microsoft Office software programs, including MS Word and advanced MS Excel functions. • Strong communication and interpersonal skills, along with the ability to interact with a diverse constituent population. • Ability to work independently and as part of a team environment. Demonstrated organizational skills, along with the ability to meet deadlines, and process large amounts of information. Ability to prioritize workloads. This position is assigned a hybrid work arrangement (on-campus and remote), the duration of this hybrid work arrangement is at the discretion of Temple University and the Department. Temple University is committed to a policy of equal opportunity for all in every aspect of its operations, including employment, service, and educational programs. The University has pledged not to discriminate on the basis of age, color, disability, marital status, national origin or ethnic origin, race, religion, sex (including pregnancy), sexual orientation, gender identity, genetic information or veteran status. Compliance Statement: In the performance of their functions as detailed in the position description employees have an obligation to avoid ethical, legal, financial and other conflicts of interest to ensure that their actions and outside activities do not conflict with their primary employment responsibilities at the institution. Employees are also expected to understand and be in compliance with applicable laws, University and employment policies and regulations, including NCAA regulations for areas and departments which their essential functions cause them to interact. To obtain additional information about Temple University please visit our website at www.temple.edu. Temple University's Annual Security and Fire Safety Report contains statistics, policies, and procedures related to campus safety. Click here. You may request a copy of the report by calling Temple University’s Campus Safety Services at 215-204-7900."
    },
    {
      "url": "https://www.indeed.com/rc/clk?jk=4093ebcdb2d8a1ab&fccid=deaf42f77aacd9e6&vjs=3",
      "title": "Human Resources Specialist",
      "company": "Constellation Health Services",
      "location": "Philadelphia, PA 19116",
      "salary": "$31 - $33 an hour",
      "description": "Constellation Health is seeking a Part-Time Human Resources Specialist \n  We are looking for someone that can work 4 hours per day 5 times a week Monday-Friday.  The Human Resources Specialist handles our core HR functions to help us provide excellent guidance to our employees. The individual will assist the Director with executing the company’s policies and procedures. The Human Resources Specialist provides assistance in the following areas: HRIS, onboarding, performance reviews, HR compliance, employee relations and administrative functions. \n  Responsibilities: \n • Facilities a smooth onboarding process for all new hires, and coordination with various departments to ensure a positive first-day experience. • Assist in administering various company programs including but not limited to: workers' compensation, FMLA, ADA, state-specific leaves and disability programs. • Ensure legal compliance of state and federal regulations and employment laws. • Handle all administrative tasks, including but not limited to pre-onboarding requirements, maintaining HR records, data entry in the company’s HRIS, and conducting regular audits of records. • Assist with employment off-boarding and exit interviews. • Assist the Director of Employee Relations with coordinating and conducting investigations, as needed, while adhering to applicable employment laws and company policies and procedures. • Ability to interpret, implement and communicate the company’s processes. • Maintain confidentiality of private and sensitive information. • Performs other human resources tasks and general office duties as necessary. \n  Qualifications: • 2 to 5 years of previous experience is required, healthcare industry is preferred. • Bachelor’s degree in human resources, Business Administration, or a related field; Master's degree preferred. • Knowledge of employment laws and regulations. • The position requires excellent customer service skills. Superior organizational, computer and communication skills. • Work requires continual attention to detail, composing and proofing materials, establishing priorities and meeting deadlines. • Must be able to work in a fast-paced environment with demonstrated ability to juggle multiple competing tasks and demands. • Previous experience working with an HRIS preferred. • Must be proficient with Microsoft Office Applications including; Word, Excel, Powerpoint and Outlook. • The employee must have the required licensure, education, training, and qualifications required by rule, regulation, law and/or statute to qualify for the role in their state. • Must have excellent interpersonal and communications (verbal and written) skills to handle sensitive and confidential information. \n  Why Constellation: • Extraordinary Benefits: Competitive salary, perks, and a rich benefits package. • Endless Growth: Career advancement opportunities to reach for the stars. • Work-Life Harmony: We prioritize your balance, allowing you more time to connect with your patients. • Family Atmosphere: Our dedicated team treats you like family, with direct leadership support. • Accolades Await: A Great Place to Work and one of the Top 25 Places to Work For in Healthcare in the US."
    }
  ],
  "metadata": {
    "source": "https://www.indeed.com/jobs?q=Business&l=Philadelphia",
    "timestamp": "2023-11-27T23:53:51.428964"
  }
}